oracle.html
<!DOCTYPE html>
<html>
<head>
<title>Oracle11g</title>
<!-- 2016-09-27 周二 03:21 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="imfine">
<link rel="stylesheet" href="ss.css">
</head>
<body>
<div id="content">
<h1 class="title">Oracle11g</h1>
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Oracle 的体系结构</a>
<ul>
<li><a href="#sec-1-1">服务端</a>
<ul>
<li><a href="#sec-1-1-1">实例 (INSTANCE)</a></li>
<li><a href="#sec-1-1-2">数据库 (DATABASE)</a></li>
<li><a href="#sec-1-1-3">启动过程</a></li>
</ul>
</li>
<li><a href="#sec-1-2">客户端</a>
<ul>
<li><a href="#sec-1-2-1">sqlplus</a></li>
<li><a href="#sec-1-2-2">jdbc</a></li>
<li><a href="#sec-1-2-3">其他的图形化工具</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">Oracle 网络配置</a>
<ul>
<li><a href="#sec-2-1">配置途径</a></li>
<li><a href="#sec-2-2">服务端 (NETWORK/ADMIN/listener.ora)</a></li>
<li><a href="#sec-2-3">客户端 (NETWORK/ADMIN/tnsnames.ora)</a></li>
</ul>
</li>
<li><a href="#sec-3">用户与权限</a>
<ul>
<li><a href="#sec-3-1">用户</a>
<ul>
<li><a href="#sec-3-1-1">系统缺省用户</a></li>
<li><a href="#sec-3-1-2">用户的默认表空间</a></li>
<li><a href="#sec-3-1-3">资源文件 (Profile)</a></li>
<li><a href="#sec-3-1-4">创建/修改/删除用户</a></li>
</ul>
</li>
<li><a href="#sec-3-2">权限</a>
<ul>
<li><a href="#sec-3-2-1">系统权限 (执行特定命令)</a></li>
<li><a href="#sec-3-2-2">对象权限 (访问数据库对象)</a></li>
<li><a href="#sec-3-2-3">示例</a></li>
</ul>
</li>
<li><a href="#sec-3-3">角色</a>
<ul>
<li><a href="#sec-3-3-1">创建角色</a></li>
<li><a href="#sec-3-3-2">配置角色</a></li>
<li><a href="#sec-3-3-3">使用角色</a></li>
<li><a href="#sec-3-3-4">删除角色</a></li>
<li><a href="#sec-3-3-5">相关的字典表</a></li>
<li><a href="#sec-3-3-6">特殊的 PUBLIC 角色</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-4"><span class="todo TODO">TODO</span> 阶段性实践</a></li>
<li><a href="#sec-5">SQL</a>
<ul>
<li><a href="#sec-5-1">SQL 的历史及概念</a></li>
<li><a href="#sec-5-2">SQL 的分类</a>
<ul>
<li><a href="#sec-5-2-1">DDL（Data Definition Language）</a></li>
<li><a href="#sec-5-2-2">DML（Data Definition Language）</a></li>
<li><a href="#sec-5-2-3">TCL（Transaction Control Language)</a></li>
<li><a href="#sec-5-2-4">DCL（Data Control Language)</a></li>
</ul>
</li>
<li><a href="#sec-5-3">数据类型</a>
<ul>
<li><a href="#sec-5-3-1">字符类型</a></li>
<li><a href="#sec-5-3-2">数字类型</a></li>
<li><a href="#sec-5-3-3">时间类型</a></li>
<li><a href="#sec-5-3-4">RAW 类型</a></li>
<li><a href="#sec-5-3-5">LOB类型(large Object)</a></li>
<li><a href="#sec-5-3-6">ROWID/ROWNUM</a></li>
<li><a href="#sec-5-3-7">NULL</a></li>
</ul>
</li>
<li><a href="#sec-5-4">运算符</a></li>
<li><a href="#sec-5-5">函数</a>
<ul>
<li><a href="#sec-5-5-1">数值函数</a></li>
<li><a href="#sec-5-5-2">字符函数</a></li>
<li><a href="#sec-5-5-3">时间函数</a></li>
<li><a href="#sec-5-5-4">比较函数</a></li>
<li><a href="#sec-5-5-5">转换函数</a></li>
<li><a href="#sec-5-5-6">其他函数</a></li>
<li><a href="#sec-5-5-7">分组函数</a></li>
<li><a href="#sec-5-5-8">分析函数</a></li>
</ul>
</li>
<li><a href="#sec-5-6">自定义函数</a></li>
</ul>
</li>
<li><a href="#sec-6">同义词 (Synonymous)</a></li>
<li><a href="#sec-7">序列 (Sequence)</a></li>
<li><a href="#sec-8">表的分区(Partition)</a>
<ul>
<li><a href="#sec-8-1">范围分区</a></li>
<li><a href="#sec-8-2">列表分区</a></li>
<li><a href="#sec-8-3">哈希分区</a></li>
<li><a href="#sec-8-4">范围-列表分区</a></li>
<li><a href="#sec-8-5">范围-列表分区</a></li>
<li><a href="#sec-8-6">分区的修改</a></li>
</ul>
</li>
<li><a href="#sec-9">视图 (View)</a>
<ul>
<li><a href="#sec-9-1">关系视图</a></li>
<li><a href="#sec-9-2">内嵌视图</a></li>
<li><a href="#sec-9-3">对象视图（可选）</a></li>
<li><a href="#sec-9-4">物化视图</a></li>
</ul>
</li>
<li><a href="#sec-10">作业相关</a></li>
<li><a href="#sec-11">索引</a></li>
<li><a href="#sec-12">PL/SQL</a>
<ul>
<li><a href="#sec-12-1">变量类型</a></li>
<li><a href="#sec-12-2">常用的一些操作</a></li>
</ul>
</li>
</ul>
</div>
</nav>


<section id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Oracle 的体系结构</h2>
<div class="outline-text-2" id="text-1">
<p>
数据库是一个以某种有组织的方式存储的数据集合。
它本质上是用计算机存储记录的系统，是位于用户和系统之间的一层管理软件。
Oracle 数据库是目前最流行、最强大的面向对象的关系型数据库(ORDBMS)。
</p>


<p>
Oracle 是基于请求响应的方式，分为服务端和客户端。
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">服务端</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Oracle 是由实例和数据库两部分组成的。
</p>
</div>

<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1">实例 (INSTANCE)</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
又称为oracle数据库引擎，由由内存即SGA(System Global Area,系统全局区)和后台处理进程组成。
</p>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2">数据库 (DATABASE)</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
保存在计算机上的数据文件等。可以从物理物件或逻辑组件的角度看待。
</p>
</div>

<ul class="org-ul"><li><a id="sec-1-1-2-1" name="sec-1-1-2-1"></a>物理组件<br ><div class="outline-text-5" id="text-1-1-2-1">
<ol class="org-ol">
<li>控制文件 (Control File)
<pre class="example">
select * from v$controlfile;
</pre>
<p>
记录数据库的物理结构和其他控制信息，如数据库名称，数据文件、日志文件名称和位置等。多副本保证安全。
</p>
</li>

<li>数据文件 (Data File)
<pre class="example">
select name,status,enabled from v$datafile;
</pre>
</li>

<li>日志文件 (联机日志文件/归档日志文件)
<pre class="example">
select * from v$log;   -- 查看日志
</pre>

<p>
保存用户的所有操作。一个数据库至少有两个日志组，轮流写入。<br >
  每个日志组至少有一个日志成员，成员之间是镜像关系，这是为了保护数据。<br >
  联机日志组的交换过程叫切换。当一个组写完会自动切换下一组，也可以手动切换：
</p>
<pre class="example">
alter system switch logfile   -- 切换日志文件
</pre>

<p>
如果打开归档模式，切换日志的时候会产生归档文件。打开归档模式命令:
</p>
<pre class="example">
alter database archivelog
</pre>
</li>

<li>初始化参数文件 (Parameter File)
<pre class="example">
$ORA_HOME/admin/&lt;SID&gt;/pfile/init.ora.xxx
</pre>
<p>
记录了数据库启动运行的一系列参数，内存、控制文件等
</p>
</li>
</ol>
</div>
</li>

<li><a id="sec-1-1-2-2" name="sec-1-1-2-2"></a>逻辑组件<br ><div class="outline-text-5" id="text-1-1-2-2">
<ol class="org-ol">
<li>表空间 (tablespace)
<pre class="example">
select * from v$tablespace;
</pre>
<ul class="org-ul">
<li><b>最基本的逻辑结构</b> ，是数据库恢复的最小单位, 容纳着许多数据库实体, 如表、视图、索引、聚簇、回退段和临时段等。
</li>
<li>默认创建的表空间有 SYSTEM/SYSAUX/TEMP/UNDO/USERS
</li>
<li>表空间跟数据文件是 1vN 的关系。一个表空间至少需要一个相应的数据文件
</li>
<li>在实际生产中，不建议用默认表空间，要根据情况自己创建
</li>
<li>创建/删除表空间的语法：
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #8D8D84; font-style: italic;">-- &#34920;&#31354;&#38388;&#21019;&#24314;</span>
<span style="color: #0000FF;">create</span> tablespace xxx
  logging
  datafile <span style="color: #008000;">'D:\xxx.dbf'</span>
  <span style="color: #0000FF;">size</span> 50m
  autoextend <span style="color: #0000FF;">on</span>
  <span style="color: #0000FF;">next</span> 50m maxsize 20480m
  extent management <span style="color: #0000FF;">local</span>;

<span style="color: #8D8D84; font-style: italic;">-- &#21019;&#24314;&#20020;&#26102;&#34920;&#31354;&#38388;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">temporary</span> tablespace yyy
  tempfile <span style="color: #008000;">'D:\yyy.dbf'</span>;

<span style="color: #8D8D84; font-style: italic;">-- &#21024;&#38500;</span>
<span style="color: #0000FF;">drop</span> tablespace yyy;
</pre>
</div>
</li>
<li>逻辑上说，一个表空间是由一到多个段组成的。
</li>
</ul>
</li>

<li>段 (Segment)
<ul class="org-ul">
<li>段是对象在数据库中占用的空间
</li>
<li>每个段，对应的是每个对象，有 table/index/view 等
</li>
<li>按照存储对象类型的不同，分为数据段、索引段、回滚段和临时段
</li>
<li>逻辑上说，段是由区组成的
</li>
</ul>
</li>

<li>区 (Extend)
<ul class="org-ul">
<li>由连续的数据块组成，由 Oracle 自动分配管理
</li>
<li>当段中的空间已满时，会自动扩展新区
</li>
</ul>
</li>

<li>块 (Block)
<ul class="org-ul">
<li>数据块是Oracle服务器所能分配、读取或写入的最小逻辑单位。
</li>
<li>Oracle服务器以数据块为单位管理数据文件的存储空间。 
</li>
<li>正常情况下，块的大小是操作系统块的整数倍，称作标准块。
</li>
<li>可以通过参数 db_block_size 控制，默认 8k.
</li>
</ul>
</li>
</ol>
</div>
</li></ul>
</div>

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3">启动过程</h4>
<div class="outline-text-4" id="text-1-1-3">
<pre class="example">
startup nomount        -- 只启动了实例 (Instance)
alter database mount   -- 数据库挂载
alter database open    -- 数据库打开
</pre>

<pre class="example">
shutdown immediate     -- 立刻关闭
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">客户端</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">sqlplus</h4>
<div class="outline-text-4" id="text-1-2-1">
</div><ul class="org-ul"><li><a id="sec-1-2-1-1" name="sec-1-2-1-1"></a>连接语法：<br ><div class="outline-text-5" id="text-1-2-1-1">
<pre class="example">
sqlplus sys/southit as sysdba     -- 管理员登录
sqlplus / as sysdba               -- 操作系统认证
sqlplus scott/tiger               -- 普通用户登录
sqlplus scott/tiger@remotedb      -- 连接远程数据库
sqlplus /nolog                    -- 未连接状态，之后可以用 conn user/pass 语法登录
</pre>
</div>
</li>

<li><a id="sec-1-2-1-2" name="sec-1-2-1-2"></a>常用命令 (set/show)<br ><div class="outline-text-5" id="text-1-2-1-2">
<pre class="example">
linesize/pagesize/header/autocommit/echo/pause/serveroutput/autotrace/timing...
column xxx format a22
show parameters [系统参数]
</pre>
</div>
</li>

<li><a id="sec-1-2-1-3" name="sec-1-2-1-3"></a>快速编辑之修改<br ><div class="outline-text-5" id="text-1-2-1-3">
<ol class="org-ol">
<li>list 定位到需要修改的行
</li>
<li>通过 change 去做替换
<pre class="example">
change /table_names/table_name
</pre>
</li>
<li>通过list 命令，查看修改完的语句 
</li>
<li>通过调用 run 命令，运行目前缓存区存在的语句。
</li>
</ol>
</div>
</li>

<li><a id="sec-1-2-1-4" name="sec-1-2-1-4"></a>快速编辑之追加单词<br ><div class="outline-text-5" id="text-1-2-1-4">
<ol class="org-ol">
<li>list 定位到需要修改的行
</li>
<li>通过 append 去追加字段
<pre class="example">
append table_name
</pre>
</li>
<li>通过list做检查
</li>
<li>通过 run 去执行命令。
</li>
</ol>
</div>
</li>

<li><a id="sec-1-2-1-5" name="sec-1-2-1-5"></a>快速编辑之删除<br ><div class="outline-text-5" id="text-1-2-1-5">
<ol class="org-ol">
<li>list 定位到需要修改的行
<pre class="example">
list 1
</pre>
</li>
<li>通过 del 直接删除 / 通过 change 命令，把本行替换为空。
</li>
<li>list 查看结果
</li>
<li>run 运行语句
</li>
</ol>
</div>
</li>

<li><a id="sec-1-2-1-6" name="sec-1-2-1-6"></a>快速编辑之添加新行<br ><div class="outline-text-5" id="text-1-2-1-6">
<ol class="org-ol">
<li>list 定位
</li>
<li>通过 input 输入新行的内容
</li>
<li>list 查看结果
</li>
<li>run 运行命令
</li>
</ol>
</div>
</li>

<li><a id="sec-1-2-1-7" name="sec-1-2-1-7"></a>快速编辑之其他<br ><div class="outline-text-5" id="text-1-2-1-7">
<pre class="example">
list last         -- 定位到缓冲区内容的最后一行
save name         -- 保存当前缓冲区的内容到 .sql 文件。默认为当前目录，可以添加详细路径
start name.sql    -- 加载 .sql 文件并执行。简写为 @name
get name          -- 加载 .sql 文件但不执行
run               -- 执行缓冲区内容。简写为 /
edit              -- 调用外部编辑器修改缓冲区内容
clear buffer      -- 清空缓存区
clear screen      -- 清屏
</pre>
</div>
</li></ul>
</div>

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2">jdbc</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
利用 java 连接 Oracle. 需要 ojdbc.jar
</p>
</div>
</div>

<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3">其他的图形化工具</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Toad / PLSQL Developer 等
</p>
</div>
</div>
</div>
</section>


<section id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Oracle 网络配置</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">配置途径</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>直接修改 NETWORK/ADMIN 下的配置文件
</li>
<li>通过 Oracle 的 Net Manager 工具配置
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">服务端 (NETWORK/ADMIN/listener.ora)</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>直接修改配置文件或通过图形界面配置。主要配置元素有：
<ul class="org-ul">
<li>协议 (TCP/IP)
</li>
<li>连接地址
</li>
<li>端口号 (默认1521，一般不需要修改)
</li>
</ul>
</li>
<li>开启 TNSListener 服务
</li>
</ol>
</div>
</div>
