oracle.org
** 客户端 (NETWORK/ADMIN/tnsnames.ora)
1. 直接修改配置文件或通过图形界面配置。主要配置元素有：
   - 协议 (TCP/IP)
   - 连接地址 (机器名或IP地址)
   - 端口号 (默认1521，需要跟服务器端的一致)
   - 数据库的服务名(默认跟SID/数据库名等是一致的)
2. 配置完后，就可以通过类似如下语句连接：
   : sqlplus scott/tiger@DBALIAS



* 用户与权限
** 用户
用户是用于资源控制和权限管理的一个概念


开始新的项目时，保持良好的习惯： 
为项目创建新的用户，指定新的表空间。

*** 系统缺省用户
**** SYS 用户，又叫特权用户，数据库中至高无上的用户。
- 它是数据库的系统管理员，负责的是数据的安装、维护、升级、备份、恢复、优化等操作。
- 不能用 normal 的身份登录，必须用 SYSDBA/SYSOPER 的身份登录。
- 即使其他的用户用 SYSDBA/SYSOPER 的身份登录，实际上登录的也是 SYS。

**** SYSTEM 用户。
数据库的管理员。SYSTEM 用户之下保存着数据库运行的一些基本字典数据。
它拥有 DBA 的角色。主要负责对数据库中各种对象，各种资源的管理。

**** 其他用户 (如SCOTT)
普通用户，能够执行被授权范围之内的操作。

*** 用户的默认表空间
SYS/SYSTEM -> SYSTEM 表空间

普通用户  -> USERS 表空间

*** 资源文件 (Profile)
资源文件是口令限制、资源限制的命名集合

#+BEGIN_SRC sql
-- 查询
select *from dba_profiles where profile = 'DEFAULT';    -- default profile

-- 创建
CREATE PROFILE filename LIMIT
  SESSION_PER_USER integer
  CPU_PER_SESSION integer
  USER_PER_CALL integer
  CONNECT_TIME integer|UNLIMITED

-- RESOURCE_LIMIT 设置为 TRUE，才会有效
alter system set RESOURCE_LIMIT = TRUE;
-- 创建资源限制文件
create profile myprofile limit failed_login_attempts 3;

#+END_SRC

常用选项（我随便写的，你们自己再整理修订下）
| FAILED_LOGIN_ATTEMPTS    | 用于指定联系登陆的最大失败次数.                   |
| PASSWORD_LOCK_TIME       | 用于指定帐户被锁定的天数.                         |
| PASSWORD_LIFE_TIME       | 用于指定口令有效期                                |
| PASSWORD_GRACE_TIME      | 用于指定口令宽限期.                               |
| PASSWORD_REUSE_TIME      | 用于指定口令可用时间.                             |
| PASSWORD_REUSE_MAX       | 用于指定口令在有效期内可更改次数.                 |
| PASSWORD_VERIFY_FUNCTION | 是否校验口令(校验将值改为VERIFY_FUNCTION)         |
| CPU_PER_SESSION          | 用于指定每个会话可以占用的最大CPU时间.            |
| LOGICAL_READS_PER_SESSON | 用于指定会话的最大逻辑读取次数.                   |
| PRIVATE_SGA              | 用于指定会话在共享池中可以分配的最大总计私有空间. |
| COMPOSITE_LIMIT          | 用于指定会话的总计资源消耗                        |
| CPU_PER_CALL             | 限制每次调用可占用的最大CPU时间                   |
| LOGICAL_READS_PER_CALL   | 用于限制每次调用的最大逻辑I/O次数.                |
| SESSIONS_PER_USER        | 用于指定每个用户的最大并发会话个数.               |
| CONNECT_TIME             | 用于指定会话的最大连接时间.                       |
| IDLE_TIME                | 用于指定会话的最大空闲时间.                       |

*** 创建/修改/删除用户

1. 创建用户语法格式
   : create USER name
   :   identified by password
   :   [default tablespace users]
   :   [temporary tablespace temp]
   :   [profile default]
   :   [quota xxx on users]
   :   [other key/value pair]

2. 修改用户语法格式
   : alter USER name
   :   identified by password
   :   [default tablespace users]
   :   [temporary tablespace temp]
   :   [profile default]
   :   [quota xxx on users]
   :   [other key/value pair]

3. 删除用户
   : drop USER name [cascade]

4. 操作示例
   #+BEGIN_SRC sql
   -- 查询
   select * from dba_users where username='SCOTT';
   
   -- 最基本的创建语法（用户名+密码）
   create user vip identified by vip;
   
   -- 较详细的创建语法
   create User vip
     identified by vip
     default tablespace users
     temporary temporary temp
     profile default
     quota ulimited on users;
   
   -- 修改用户
   alter user vip identified by vop;
   alter user vip profile ttt;
   alter user vip default tablespace system;
   alter user vip temporary tablespace mytemp;
   alter user vip account unlock/lock;
   alter user vip quota unlimited on test;  -- very good
   
   -- 删除用户。如果用户下存在对象，需要添加 cascade 关键词。
   drop user vip;
   drop user vip cascade;
   
   #+END_SRC


** 权限
权限指的是执行特定命令或访问数据库对象的权利。分为系统权限和对象权限。

*** 系统权限 (执行特定命令)
**** 授权语法
: grant 权限名字 to 用户 [with admin option]
with admin option 参数可以使得到授权的用户有权把得到的权限授予其他用户。

****  撤销语法
: revoke 权限名字 from 用户

**** 相关的字典表
: select * from system_privilege_map;  -- 所有的系统权限
: select * from dba_sys_privs where grantee='SCOTT';         -- 目前已经被授权的系统权限

*** 对象权限 (访问数据库对象)

**** 授权语法
: grant 对象权限的关键词(select/update/..)on [schema.]对象名字 to 用户 [with granted option];
: grant all on scott.emp to vip with grant option;

**** 撤销权限
: revoke 权限名字 from 用户

**** 相关的字典表
: select * from dba_tab_privs/all_tab_privs/user_tab_privs;      -- 存放的是所有对象权限的授权情况。

