oracle.html

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">客户端 (NETWORK/ADMIN/tnsnames.ora)</h3>
<div class="outline-text-3" id="text-2-3">
<ol class="org-ol">
<li>直接修改配置文件或通过图形界面配置。主要配置元素有：
<ul class="org-ul">
<li>协议 (TCP/IP)
</li>
<li>连接地址 (机器名或IP地址)
</li>
<li>端口号 (默认1521，需要跟服务器端的一致)
</li>
<li>数据库的服务名(默认跟SID/数据库名等是一致的)
</li>
</ul>
</li>
<li>配置完后，就可以通过类似如下语句连接：
<pre class="example">
sqlplus scott/tiger@DBALIAS
</pre>
</li>
</ol>
</div>
</div>
</section>



<section id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">用户与权限</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">用户</h3>
<div class="outline-text-3" id="text-3-1">
<p>
用户是用于资源控制和权限管理的一个概念
</p>


<p>
开始新的项目时，保持良好的习惯： 
为项目创建新的用户，指定新的表空间。
</p>
</div>

<div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1">系统缺省用户</h4>
<div class="outline-text-4" id="text-3-1-1">
</div><ul class="org-ul"><li><a id="sec-3-1-1-1" name="sec-3-1-1-1"></a>SYS 用户，又叫特权用户，数据库中至高无上的用户。<br ><div class="outline-text-5" id="text-3-1-1-1">
<ul class="org-ul">
<li>它是数据库的系统管理员，负责的是数据的安装、维护、升级、备份、恢复、优化等操作。
</li>
<li>不能用 normal 的身份登录，必须用 SYSDBA/SYSOPER 的身份登录。
</li>
<li>即使其他的用户用 SYSDBA/SYSOPER 的身份登录，实际上登录的也是 SYS。
</li>
</ul>
</div>
</li>

<li><a id="sec-3-1-1-2" name="sec-3-1-1-2"></a>SYSTEM 用户。<br ><div class="outline-text-5" id="text-3-1-1-2">
<p>
数据库的管理员。SYSTEM 用户之下保存着数据库运行的一些基本字典数据。
它拥有 DBA 的角色。主要负责对数据库中各种对象，各种资源的管理。
</p>
</div>
</li>

<li><a id="sec-3-1-1-3" name="sec-3-1-1-3"></a>其他用户 (如SCOTT)<br ><div class="outline-text-5" id="text-3-1-1-3">
<p>
普通用户，能够执行被授权范围之内的操作。
</p>
</div>
</li></ul>
</div>

<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2">用户的默认表空间</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
SYS/SYSTEM -&gt; SYSTEM 表空间
</p>

<p>
普通用户  -&gt; USERS 表空间
</p>
</div>
</div>

<div id="outline-container-sec-3-1-3" class="outline-4">
<h4 id="sec-3-1-3">资源文件 (Profile)</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
资源文件是口令限制、资源限制的命名集合
</p>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #8D8D84; font-style: italic;">-- &#26597;&#35810;</span>
<span style="color: #0000FF;">select</span> *<span style="color: #0000FF;">from</span> dba_profiles <span style="color: #0000FF;">where</span> profile = <span style="color: #008000;">'DEFAULT'</span>;    <span style="color: #8D8D84; font-style: italic;">-- default profile</span>

<span style="color: #8D8D84; font-style: italic;">-- &#21019;&#24314;</span>
<span style="color: #0000FF;">CREATE</span> PROFILE filename <span style="color: #0000FF;">LIMIT</span>
  SESSION_PER_USER <span style="color: #6434A3;">integer</span>
  CPU_PER_SESSION <span style="color: #6434A3;">integer</span>
  USER_PER_CALL <span style="color: #6434A3;">integer</span>
  CONNECT_TIME <span style="color: #6434A3;">integer</span>|UNLIMITED

<span style="color: #8D8D84; font-style: italic;">-- RESOURCE_LIMIT &#35774;&#32622;&#20026; TRUE&#65292;&#25165;&#20250;&#26377;&#25928;</span>
<span style="color: #0000FF;">alter</span> <span style="color: #0000FF;">system</span> <span style="color: #0000FF;">set</span> RESOURCE_LIMIT = <span style="color: #0000FF;">TRUE</span>;
<span style="color: #8D8D84; font-style: italic;">-- &#21019;&#24314;&#36164;&#28304;&#38480;&#21046;&#25991;&#20214;</span>
<span style="color: #0000FF;">create</span> profile myprofile <span style="color: #0000FF;">limit</span> failed_login_attempts 3;
</pre>
</div>

<p>
常用选项（我随便写的，你们自己再整理修订下）
</p>
<table>


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="left">FAILED_LOGIN_ATTEMPTS</td>
<td class="left">用于指定联系登陆的最大失败次数.</td>
</tr>

<tr>
<td class="left">PASSWORD_LOCK_TIME</td>
<td class="left">用于指定帐户被锁定的天数.</td>
</tr>

<tr>
<td class="left">PASSWORD_LIFE_TIME</td>
<td class="left">用于指定口令有效期</td>
</tr>

<tr>
<td class="left">PASSWORD_GRACE_TIME</td>
<td class="left">用于指定口令宽限期.</td>
</tr>

<tr>
<td class="left">PASSWORD_REUSE_TIME</td>
<td class="left">用于指定口令可用时间.</td>
</tr>

<tr>
<td class="left">PASSWORD_REUSE_MAX</td>
<td class="left">用于指定口令在有效期内可更改次数.</td>
</tr>

<tr>
<td class="left">PASSWORD_VERIFY_FUNCTION</td>
<td class="left">是否校验口令(校验将值改为VERIFY_FUNCTION)</td>
</tr>

<tr>
<td class="left">CPU_PER_SESSION</td>
<td class="left">用于指定每个会话可以占用的最大CPU时间.</td>
</tr>

<tr>
<td class="left">LOGICAL_READS_PER_SESSON</td>
<td class="left">用于指定会话的最大逻辑读取次数.</td>
</tr>

<tr>
<td class="left">PRIVATE_SGA</td>
<td class="left">用于指定会话在共享池中可以分配的最大总计私有空间.</td>
</tr>

<tr>
<td class="left">COMPOSITE_LIMIT</td>
<td class="left">用于指定会话的总计资源消耗</td>
</tr>

<tr>
<td class="left">CPU_PER_CALL</td>
<td class="left">限制每次调用可占用的最大CPU时间</td>
</tr>

<tr>
<td class="left">LOGICAL_READS_PER_CALL</td>
<td class="left">用于限制每次调用的最大逻辑I/O次数.</td>
</tr>

<tr>
<td class="left">SESSIONS_PER_USER</td>
<td class="left">用于指定每个用户的最大并发会话个数.</td>
</tr>

<tr>
<td class="left">CONNECT_TIME</td>
<td class="left">用于指定会话的最大连接时间.</td>
</tr>

<tr>
<td class="left">IDLE_TIME</td>
<td class="left">用于指定会话的最大空闲时间.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-3-1-4" class="outline-4">
<h4 id="sec-3-1-4">创建/修改/删除用户</h4>
<div class="outline-text-4" id="text-3-1-4">
<ol class="org-ol">
<li>创建用户语法格式
<pre class="example">
create USER name
  identified by password
  [default tablespace users]
  [temporary tablespace temp]
  [profile default]
  [quota xxx on users]
  [other key/value pair]
</pre>
</li>

<li>修改用户语法格式
<pre class="example">
alter USER name
  identified by password
  [default tablespace users]
  [temporary tablespace temp]
  [profile default]
  [quota xxx on users]
  [other key/value pair]
</pre>
</li>

<li>删除用户
<pre class="example">
drop USER name [cascade]
</pre>
</li>

<li>操作示例
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #8D8D84; font-style: italic;">-- &#26597;&#35810;</span>
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> dba_users <span style="color: #0000FF;">where</span> username=<span style="color: #008000;">'SCOTT'</span>;

<span style="color: #8D8D84; font-style: italic;">-- &#26368;&#22522;&#26412;&#30340;&#21019;&#24314;&#35821;&#27861;&#65288;&#29992;&#25143;&#21517;+&#23494;&#30721;&#65289;</span>
<span style="color: #0000FF;">create</span> <span style="color: #006FE0;">user</span> vip identified <span style="color: #0000FF;">by</span> vip;

<span style="color: #8D8D84; font-style: italic;">-- &#36739;&#35814;&#32454;&#30340;&#21019;&#24314;&#35821;&#27861;</span>
<span style="color: #0000FF;">create</span> <span style="color: #006FE0;">User</span> vip
  identified <span style="color: #0000FF;">by</span> vip
  <span style="color: #0000FF;">default</span> tablespace users
  <span style="color: #0000FF;">temporary</span> <span style="color: #0000FF;">temporary</span> temp
  profile <span style="color: #0000FF;">default</span>
  quota ulimited <span style="color: #0000FF;">on</span> users;

<span style="color: #8D8D84; font-style: italic;">-- &#20462;&#25913;&#29992;&#25143;</span>
<span style="color: #0000FF;">alter</span> <span style="color: #006FE0;">user</span> vip identified <span style="color: #0000FF;">by</span> vop;
<span style="color: #0000FF;">alter</span> <span style="color: #006FE0;">user</span> vip profile ttt;
<span style="color: #0000FF;">alter</span> <span style="color: #006FE0;">user</span> vip <span style="color: #0000FF;">default</span> <span style="color: #006699;">tablespace</span> <span style="color: #0000FF;">system</span>;
<span style="color: #0000FF;">alter</span> <span style="color: #006FE0;">user</span> vip <span style="color: #0000FF;">temporary</span> tablespace mytemp;
<span style="color: #0000FF;">alter</span> <span style="color: #006FE0;">user</span> vip account unlock/lock;
<span style="color: #0000FF;">alter</span> <span style="color: #006FE0;">user</span> vip quota unlimited <span style="color: #0000FF;">on</span> test;  <span style="color: #8D8D84; font-style: italic;">-- very good</span>

<span style="color: #8D8D84; font-style: italic;">-- &#21024;&#38500;&#29992;&#25143;&#12290;&#22914;&#26524;&#29992;&#25143;&#19979;&#23384;&#22312;&#23545;&#35937;&#65292;&#38656;&#35201;&#28155;&#21152; cascade &#20851;&#38190;&#35789;&#12290;</span>
<span style="color: #0000FF;">drop</span> <span style="color: #006FE0;">user</span> vip;
<span style="color: #0000FF;">drop</span> <span style="color: #006FE0;">user</span> vip <span style="color: #0000FF;">cascade</span>;
</pre>
</div>
</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">权限</h3>
<div class="outline-text-3" id="text-3-2">
<p>
权限指的是执行特定命令或访问数据库对象的权利。分为系统权限和对象权限。
</p>
</div>

<div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1">系统权限 (执行特定命令)</h4>
<div class="outline-text-4" id="text-3-2-1">
</div><ul class="org-ul"><li><a id="sec-3-2-1-1" name="sec-3-2-1-1"></a>授权语法<br ><div class="outline-text-5" id="text-3-2-1-1">
<pre class="example">
grant 权限名字 to 用户 [with admin option]
</pre>
<p>
with admin option 参数可以使得到授权的用户有权把得到的权限授予其他用户。
</p>
</div>
</li>

<li><a id="sec-3-2-1-2" name="sec-3-2-1-2"></a>撤销语法<br ><div class="outline-text-5" id="text-3-2-1-2">
<pre class="example">
revoke 权限名字 from 用户
</pre>
</div>
</li>

<li><a id="sec-3-2-1-3" name="sec-3-2-1-3"></a>相关的字典表<br ><div class="outline-text-5" id="text-3-2-1-3">
<pre class="example">
select * from system_privilege_map;  -- 所有的系统权限
select * from dba_sys_privs where grantee='SCOTT';         -- 目前已经被授权的系统权限
</pre>
</div>
</li></ul>
</div>

<div id="outline-container-sec-3-2-2" class="outline-4">
<h4 id="sec-3-2-2">对象权限 (访问数据库对象)</h4>
<div class="outline-text-4" id="text-3-2-2">
</div><ul class="org-ul"><li><a id="sec-3-2-2-1" name="sec-3-2-2-1"></a>授权语法<br ><div class="outline-text-5" id="text-3-2-2-1">
<pre class="example">
grant 对象权限的关键词(select/update/..)on [schema.]对象名字 to 用户 [with granted option];
grant all on scott.emp to vip with grant option;
</pre>
</div>
</li>

<li><a id="sec-3-2-2-2" name="sec-3-2-2-2"></a>撤销权限<br ><div class="outline-text-5" id="text-3-2-2-2">
<pre class="example">
revoke 权限名字 from 用户
</pre>
</div>
</li>

<li><a id="sec-3-2-2-3" name="sec-3-2-2-3"></a>相关的字典表<br ><div class="outline-text-5" id="text-3-2-2-3">
<pre class="example">
select * from dba_tab_privs/all_tab_privs/user_tab_privs;      -- 存放的是所有对象权限的授权情况。
</pre>
</div>
</li></ul>
</div>
