oracle.org
*** 示例
#+BEGIN_SRC sql
-- 授权
grant create table to vip;
grant create session to vip [with admin option];
grant select, insert on sys.dba_tab_privs to vip;
grant all on scott to vip;           -- 授予所有

grant create synonym to vip;         -- 可以为自己创建 synonym
grant create any synonym to vip;     -- 可以为任意用户创建 synonym
grant create public synonym to vip;  -- 可以创建 public synonym

-- 撤权
revoke create table, create session from rain;
revoke alter on scott from vip;

#+END_SRC



** 角色
角色是权限的命名集合。

*** 创建角色
: create role name

*** 配置角色
: grant 权限名字 to 角色名字
: grant 角色名字 to 角色名字

*** 使用角色
: grant 角色名字 to 用户名字

*** 删除角色
: drop ROLE 角色名字

*** 相关的字典表
: select * from dba_roles;                            -- 列出系统中所有存在的角色。
: select * from dba_sys_privs where grantee='DBA';    -- 查看DBA所拥有的所有系统权限
: select * from dba_role_privs where grantee='SYSTEM' -- 查看用户所拥有的所有角色

*** 特殊的 PUBLIC 角色
公用角色，默认是授予每个用户的。


* TODO 阶段性实践
计算大家完成以下工作所消耗的时间：
1. 连接上指定服务器的指定数据库。
2. 为新的用户创建所需要的默认表空间。
3. 为新的用户创建所需要的资源文件。
4. 创建用户，指定表空间、资源文件，设置配额。
5. 为所创建的用户授予特定的系统权限，如创建会话、创建表、更新数据等。
6. 为 scott 用户授予相应的对象权限，让 scott 用户能够操纵我们所创建用户下的一些对象。
7. 进行一系列的简单操作。



* SQL
Structured Query Language，结构性查询语言。

** SQL 的历史及概念
** SQL 的分类
*** DDL（Data Definition Language）
