oracle.html

<div id="outline-container-sec-3-2-3" class="outline-4">
<h4 id="sec-3-2-3">示例</h4>
<div class="outline-text-4" id="text-3-2-3">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #8D8D84; font-style: italic;">-- &#25480;&#26435;</span>
<span style="color: #0000FF;">grant</span> <span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #0000FF;">to</span> vip;
<span style="color: #0000FF;">grant</span> <span style="color: #0000FF;">create</span> <span style="color: #0000FF;">session</span> <span style="color: #0000FF;">to</span> vip <span style="color: #707183;">[</span><span style="color: #0000FF;">with</span> <span style="color: #0000FF;">admin</span> <span style="color: #0000FF;">option</span><span style="color: #707183;">]</span>;
<span style="color: #0000FF;">grant</span> <span style="color: #0000FF;">select</span>, <span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">on</span> sys.dba_tab_privs <span style="color: #0000FF;">to</span> vip;
<span style="color: #0000FF;">grant</span> <span style="color: #0000FF;">all</span> <span style="color: #0000FF;">on</span> scott <span style="color: #0000FF;">to</span> vip;           <span style="color: #8D8D84; font-style: italic;">-- &#25480;&#20104;&#25152;&#26377;</span>

<span style="color: #0000FF;">grant</span> <span style="color: #0000FF;">create</span> synonym <span style="color: #0000FF;">to</span> vip;         <span style="color: #8D8D84; font-style: italic;">-- &#21487;&#20197;&#20026;&#33258;&#24049;&#21019;&#24314; synonym</span>
<span style="color: #0000FF;">grant</span> <span style="color: #0000FF;">create</span> <span style="color: #0000FF;">any</span> synonym <span style="color: #0000FF;">to</span> vip;     <span style="color: #8D8D84; font-style: italic;">-- &#21487;&#20197;&#20026;&#20219;&#24847;&#29992;&#25143;&#21019;&#24314; synonym</span>
<span style="color: #0000FF;">grant</span> <span style="color: #0000FF;">create</span> <span style="color: #0000FF;">public</span> synonym <span style="color: #0000FF;">to</span> vip;  <span style="color: #8D8D84; font-style: italic;">-- &#21487;&#20197;&#21019;&#24314; public synonym</span>

<span style="color: #8D8D84; font-style: italic;">-- &#25764;&#26435;</span>
<span style="color: #0000FF;">revoke</span> <span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span>, <span style="color: #0000FF;">create</span> <span style="color: #0000FF;">session</span> <span style="color: #0000FF;">from</span> rain;
<span style="color: #0000FF;">revoke</span> <span style="color: #0000FF;">alter</span> <span style="color: #0000FF;">on</span> scott <span style="color: #0000FF;">from</span> vip;
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3">角色</h3>
<div class="outline-text-3" id="text-3-3">
<p>
角色是权限的命名集合。
</p>
</div>

<div id="outline-container-sec-3-3-1" class="outline-4">
<h4 id="sec-3-3-1">创建角色</h4>
<div class="outline-text-4" id="text-3-3-1">
<pre class="example">
create role name
</pre>
</div>
</div>

<div id="outline-container-sec-3-3-2" class="outline-4">
<h4 id="sec-3-3-2">配置角色</h4>
<div class="outline-text-4" id="text-3-3-2">
<pre class="example">
grant 权限名字 to 角色名字
grant 角色名字 to 角色名字
</pre>
</div>
</div>

<div id="outline-container-sec-3-3-3" class="outline-4">
<h4 id="sec-3-3-3">使用角色</h4>
<div class="outline-text-4" id="text-3-3-3">
<pre class="example">
grant 角色名字 to 用户名字
</pre>
</div>
</div>

<div id="outline-container-sec-3-3-4" class="outline-4">
<h4 id="sec-3-3-4">删除角色</h4>
<div class="outline-text-4" id="text-3-3-4">
<pre class="example">
drop ROLE 角色名字
</pre>
</div>
</div>

<div id="outline-container-sec-3-3-5" class="outline-4">
<h4 id="sec-3-3-5">相关的字典表</h4>
<div class="outline-text-4" id="text-3-3-5">
<pre class="example">
select * from dba_roles;                            -- 列出系统中所有存在的角色。
select * from dba_sys_privs where grantee='DBA';    -- 查看DBA所拥有的所有系统权限
select * from dba_role_privs where grantee='SYSTEM' -- 查看用户所拥有的所有角色
</pre>
</div>
</div>

<div id="outline-container-sec-3-3-6" class="outline-4">
<h4 id="sec-3-3-6">特殊的 PUBLIC 角色</h4>
<div class="outline-text-4" id="text-3-3-6">
<p>
公用角色，默认是授予每个用户的。
</p>
</div>
</div>
</div>
</section>


<section id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="todo TODO">TODO</span> 阶段性实践</h2>
<div class="outline-text-2" id="text-4">
<p>
计算大家完成以下工作所消耗的时间：
</p>
<ol class="org-ol">
<li>连接上指定服务器的指定数据库。
</li>
<li>为新的用户创建所需要的默认表空间。
</li>
<li>为新的用户创建所需要的资源文件。
</li>
<li>创建用户，指定表空间、资源文件，设置配额。
</li>
<li>为所创建的用户授予特定的系统权限，如创建会话、创建表、更新数据等。
</li>
<li>为 scott 用户授予相应的对象权限，让 scott 用户能够操纵我们所创建用户下的一些对象。
</li>
<li>进行一系列的简单操作。
</li>
</ol>
</div>
</section>



<section id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">SQL</h2>
<div class="outline-text-2" id="text-5">
<p>
Structured Query Language，结构性查询语言。
</p>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">SQL 的历史及概念</h3>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2">SQL 的分类</h3>
<div class="outline-text-3" id="text-5-2">
</div><div id="outline-container-sec-5-2-1" class="outline-4">
<h4 id="sec-5-2-1">DDL（Data Definition Language）</h4>
<div class="outline-text-4" id="text-5-2-1">
</div><ul class="org-ul"><li><a id="sec-5-2-1-1" name="sec-5-2-1-1"></a>CREATE<br ><div class="outline-text-5" id="text-5-2-1-1">
<p>
创建表的典型语句为:
</p>
<pre class="example">
