oracle.org
**** CREATE
 创建表的典型语句为:
: create TABLE table_name
: (column_name column_type,[column_name column_type...]);

例子:
#+BEGIN_SRC sql
-- 最基本的创建
create table OrderTB (id number, name varchar2(20));

-- 添加主键
create table OrderTB (id number primary key, name varchar2(20));
create table OrderTB 
  (id number,
   name varchar2(20),
   primary key(id));
create table OrderTB (id number, name varchar2(20), constraints pk_ordertb primary key(id));

-- 添加外键，外键映射到的必须是主键
create table sex (value primary key, detail varchar2(20));
create table Mates (id number primary key, name varchar2(20), sex number references sex(value));

create table Mates 
  (id number primary key,
   name varchar2(20),
   sex number,
   foreign key (sex) references sex(value));

create table Mates 
  (id number primary key,
   name varchar2(20),
   sex number,
   constraints fk_mates foreign key (sex) references sex(value));

-- check 约束
create table Classes (id number, count number check (count > 10 and count < 100));
create table Classes222
( id number primary key,
  count number,
  constraints ck_classes check (count > 10 and count < 100));

-- TODO Unique 约束


-- 双引号强制表名保留原来的大小写。
create table "XiaoMing" (name varchar2(20), age int);


-- 创建一张表，不生产重做日志的话
create table nologtab (id number) nologging;


-- 创建一张表，指定另外的表空间
create table spetab (id number) tablespace system;

-- 强制字段内容不能为
create table notnulltab (name varchar2(20) not null);

-- 指定某个字段的默认值
create table tab_defaultval (name varchar2(20) not null, sex number default 1);

#+END_SRC

需要注意，首先，表的名字要符合一定的规范(长度，组成字符，保留字，以及其他)。

Oracle 会自动把表名转换为大写，但是如果想保留大小写的话，可以在创建表的时候，把表名用双引号括起来。

主键：

需要简短、效率、不重复、不可改变。
所以，不要用业务字段作为主键，即使觉得业务字段是唯一且不可改变的。因为，你觉得不可改变的东西，往往经不住时间的考验。
需要用自增的，简单的，跟业务没有关系的，所谓的代理主键。[[http://www.w3school.com.cn/sql/sql_autoincrement.asp][就比如 sqlserver 中的 identity, MySQL 中的 auto_increment]].

查看数据库中表的 DDL 语句：
: set long 999
: select DBMS_METADATA.get_ddl('TABLE', 'EMP') from dual;


从已经存在的表中，创建新的表

#+BEGIN_SRC sql
-- 语法
create table 表名 as select clause...

-- 简单应用
create table emp1 as select * from scott.emp;

-- 限定列
create table emp2 as select empno, ename, hiredate from scott.emp;

-- 限定列的过程中，可以使用运算符或者函数
create table emp2 as select empno, ename, sal/1000 s from scott.emp;

-- 限定行(限定插入的数据)
create table emp3 as select empno, ename from scott.emp where empno < 7566;

-- 如果只想复制表的结构的话
create table emp4 as select * from scott.emp where 1=2;
create table emp4 as select * from scott.emp where rownum < 1;

#+END_SRC


