oracle.html
create TABLE table_name
(column_name column_type,[column_name column_type...]);
</pre>

<p>
例子:
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #8D8D84; font-style: italic;">-- &#26368;&#22522;&#26412;&#30340;&#21019;&#24314;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">OrderTB</span> <span style="color: #707183;">(</span>id <span style="color: #0000FF;">number</span>, <span style="color: #0000FF;">name</span> varchar2<span style="color: #7388D6;">(</span>20<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>;

<span style="color: #8D8D84; font-style: italic;">-- &#28155;&#21152;&#20027;&#38190;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">OrderTB</span> <span style="color: #707183;">(</span>id <span style="color: #0000FF;">number</span> <span style="color: #0000FF;">primary</span> <span style="color: #0000FF;">key</span>, <span style="color: #0000FF;">name</span> varchar2<span style="color: #7388D6;">(</span>20<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>;
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">OrderTB</span> 
  <span style="color: #707183;">(</span>id <span style="color: #0000FF;">number</span>,
   <span style="color: #0000FF;">name</span> varchar2<span style="color: #7388D6;">(</span>20<span style="color: #7388D6;">)</span>,
   <span style="color: #0000FF;">primary</span> <span style="color: #0000FF;">key</span><span style="color: #7388D6;">(</span>id<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>;
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">OrderTB</span> <span style="color: #707183;">(</span>id <span style="color: #0000FF;">number</span>, <span style="color: #0000FF;">name</span> varchar2<span style="color: #7388D6;">(</span>20<span style="color: #7388D6;">)</span>, <span style="color: #0000FF;">constraints</span> pk_ordertb <span style="color: #0000FF;">primary</span> <span style="color: #0000FF;">key</span><span style="color: #7388D6;">(</span>id<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>;

<span style="color: #8D8D84; font-style: italic;">-- &#28155;&#21152;&#22806;&#38190;&#65292;&#22806;&#38190;&#26144;&#23556;&#21040;&#30340;&#24517;&#39035;&#26159;&#20027;&#38190;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">sex</span> <span style="color: #707183;">(</span><span style="color: #0000FF;">value</span> <span style="color: #0000FF;">primary</span> <span style="color: #0000FF;">key</span>, detail varchar2<span style="color: #7388D6;">(</span>20<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>;
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">Mates</span> <span style="color: #707183;">(</span>id <span style="color: #0000FF;">number</span> <span style="color: #0000FF;">primary</span> <span style="color: #0000FF;">key</span>, <span style="color: #0000FF;">name</span> varchar2<span style="color: #7388D6;">(</span>20<span style="color: #7388D6;">)</span>, sex <span style="color: #0000FF;">number</span> <span style="color: #0000FF;">references</span> sex<span style="color: #7388D6;">(</span><span style="color: #0000FF;">value</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>;

<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">Mates</span> 
  <span style="color: #707183;">(</span>id <span style="color: #0000FF;">number</span> <span style="color: #0000FF;">primary</span> <span style="color: #0000FF;">key</span>,
   <span style="color: #0000FF;">name</span> varchar2<span style="color: #7388D6;">(</span>20<span style="color: #7388D6;">)</span>,
   sex <span style="color: #0000FF;">number</span>,
   <span style="color: #0000FF;">foreign</span> <span style="color: #0000FF;">key</span> <span style="color: #7388D6;">(</span>sex<span style="color: #7388D6;">)</span> <span style="color: #0000FF;">references</span> sex<span style="color: #7388D6;">(</span><span style="color: #0000FF;">value</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>;

<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">Mates</span> 
  <span style="color: #707183;">(</span>id <span style="color: #0000FF;">number</span> <span style="color: #0000FF;">primary</span> <span style="color: #0000FF;">key</span>,
   <span style="color: #0000FF;">name</span> varchar2<span style="color: #7388D6;">(</span>20<span style="color: #7388D6;">)</span>,
   sex <span style="color: #0000FF;">number</span>,
   <span style="color: #0000FF;">constraints</span> fk_mates <span style="color: #0000FF;">foreign</span> <span style="color: #0000FF;">key</span> <span style="color: #7388D6;">(</span>sex<span style="color: #7388D6;">)</span> <span style="color: #0000FF;">references</span> sex<span style="color: #7388D6;">(</span><span style="color: #0000FF;">value</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>;

<span style="color: #8D8D84; font-style: italic;">-- check &#32422;&#26463;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">Classes</span> <span style="color: #707183;">(</span>id <span style="color: #0000FF;">number</span>, <span style="color: #006FE0;">count</span> <span style="color: #0000FF;">number</span> <span style="color: #0000FF;">check</span> <span style="color: #7388D6;">(</span><span style="color: #006FE0;">count</span> &gt; 10 <span style="color: #0000FF;">and</span> <span style="color: #006FE0;">count</span> &lt; 100<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>;
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">Classes222</span>
<span style="color: #707183;">(</span> id <span style="color: #0000FF;">number</span> <span style="color: #0000FF;">primary</span> <span style="color: #0000FF;">key</span>,
  <span style="color: #006FE0;">count</span> <span style="color: #0000FF;">number</span>,
  <span style="color: #0000FF;">constraints</span> ck_classes <span style="color: #0000FF;">check</span> <span style="color: #7388D6;">(</span><span style="color: #006FE0;">count</span> &gt; 10 <span style="color: #0000FF;">and</span> <span style="color: #006FE0;">count</span> &lt; 100<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>;

<span style="color: #8D8D84; font-style: italic;">-- TODO Unique &#32422;&#26463;</span>


<span style="color: #8D8D84; font-style: italic;">-- &#21452;&#24341;&#21495;&#24378;&#21046;&#34920;&#21517;&#20445;&#30041;&#21407;&#26469;&#30340;&#22823;&#23567;&#20889;&#12290;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> "XiaoMing" <span style="color: #707183;">(</span><span style="color: #0000FF;">name</span> varchar2<span style="color: #7388D6;">(</span>20<span style="color: #7388D6;">)</span>, age <span style="color: #6434A3;">int</span><span style="color: #707183;">)</span>;


<span style="color: #8D8D84; font-style: italic;">-- &#21019;&#24314;&#19968;&#24352;&#34920;&#65292;&#19981;&#29983;&#20135;&#37325;&#20570;&#26085;&#24535;&#30340;&#35805;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">nologtab</span> <span style="color: #707183;">(</span>id <span style="color: #0000FF;">number</span><span style="color: #707183;">)</span> nologging;


<span style="color: #8D8D84; font-style: italic;">-- &#21019;&#24314;&#19968;&#24352;&#34920;&#65292;&#25351;&#23450;&#21478;&#22806;&#30340;&#34920;&#31354;&#38388;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">spetab</span> <span style="color: #707183;">(</span>id <span style="color: #0000FF;">number</span><span style="color: #707183;">)</span> tablespace <span style="color: #0000FF;">system</span>;

<span style="color: #8D8D84; font-style: italic;">-- &#24378;&#21046;&#23383;&#27573;&#20869;&#23481;&#19981;&#33021;&#20026;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">notnulltab</span> <span style="color: #707183;">(</span><span style="color: #0000FF;">name</span> varchar2<span style="color: #7388D6;">(</span>20<span style="color: #7388D6;">)</span> <span style="color: #0000FF;">not</span> <span style="color: #0000FF;">null</span><span style="color: #707183;">)</span>;

<span style="color: #8D8D84; font-style: italic;">-- &#25351;&#23450;&#26576;&#20010;&#23383;&#27573;&#30340;&#40664;&#35748;&#20540;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">tab_defaultval</span> <span style="color: #707183;">(</span><span style="color: #0000FF;">name</span> varchar2<span style="color: #7388D6;">(</span>20<span style="color: #7388D6;">)</span> <span style="color: #0000FF;">not</span> <span style="color: #0000FF;">null</span>, sex <span style="color: #0000FF;">number</span> <span style="color: #0000FF;">default</span> 1<span style="color: #707183;">)</span>;
</pre>
</div>

<p>
需要注意，首先，表的名字要符合一定的规范(长度，组成字符，保留字，以及其他)。
</p>

<p>
Oracle 会自动把表名转换为大写，但是如果想保留大小写的话，可以在创建表的时候，把表名用双引号括起来。
</p>

<p>
主键：
</p>

<p>
需要简短、效率、不重复、不可改变。
所以，不要用业务字段作为主键，即使觉得业务字段是唯一且不可改变的。因为，你觉得不可改变的东西，往往经不住时间的考验。
需要用自增的，简单的，跟业务没有关系的，所谓的代理主键。<a href="http://www.w3school.com.cn/sql/sql_autoincrement.asp">就比如 sqlserver 中的 identity, MySQL 中的 auto_increment</a>.
</p>

<p>
查看数据库中表的 DDL 语句：
</p>
<pre class="example">
set long 999
select DBMS_METADATA.get_ddl('TABLE', 'EMP') from dual;
</pre>


<p>
从已经存在的表中，创建新的表
</p>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #8D8D84; font-style: italic;">-- &#35821;&#27861;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">&#34920;&#21517;</span> <span style="color: #0000FF;">as</span> <span style="color: #0000FF;">select</span> clause...

<span style="color: #8D8D84; font-style: italic;">-- &#31616;&#21333;&#24212;&#29992;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">emp1</span> <span style="color: #0000FF;">as</span> <span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> scott.emp;

<span style="color: #8D8D84; font-style: italic;">-- &#38480;&#23450;&#21015;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">emp2</span> <span style="color: #0000FF;">as</span> <span style="color: #0000FF;">select</span> empno, ename, hiredate <span style="color: #0000FF;">from</span> scott.emp;

<span style="color: #8D8D84; font-style: italic;">-- &#38480;&#23450;&#21015;&#30340;&#36807;&#31243;&#20013;&#65292;&#21487;&#20197;&#20351;&#29992;&#36816;&#31639;&#31526;&#25110;&#32773;&#20989;&#25968;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">emp2</span> <span style="color: #0000FF;">as</span> <span style="color: #0000FF;">select</span> empno, ename, sal/1000 s <span style="color: #0000FF;">from</span> scott.emp;

<span style="color: #8D8D84; font-style: italic;">-- &#38480;&#23450;&#34892;(&#38480;&#23450;&#25554;&#20837;&#30340;&#25968;&#25454;)</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">emp3</span> <span style="color: #0000FF;">as</span> <span style="color: #0000FF;">select</span> empno, ename <span style="color: #0000FF;">from</span> scott.emp <span style="color: #0000FF;">where</span> empno &lt; 7566;

<span style="color: #8D8D84; font-style: italic;">-- &#22914;&#26524;&#21482;&#24819;&#22797;&#21046;&#34920;&#30340;&#32467;&#26500;&#30340;&#35805;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">emp4</span> <span style="color: #0000FF;">as</span> <span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> scott.emp <span style="color: #0000FF;">where</span> 1=2;
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">emp4</span> <span style="color: #0000FF;">as</span> <span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> scott.emp <span style="color: #0000FF;">where</span> rownum &lt; 1;
</pre>
</div>
</div>
</li>
