oracle.org
**** ALTER
#+BEGIN_SRC sql
-- 最基本的用法
alter table 表名 操作关键词 属性


-- 添加一个列
alter table sss add howsoon number default 0;
alter table sss add (status char);
alter table sss add (status char not null);         -- 可以添加其他的属性
alter table sss add (status char default '1');

-- 添加一个主键约束
alter table sss add constraints pk_sss primary key (id);

-- 删除一个列
alter table sss drop COLUMN howsoon;

-- 删除主键
alter table sss drop CONSTRAINTS pk_sss;

-- 删除外键
alter table 表名 drop constraints 外键名;

-- 修改列
alter table sss modify (status varchar2(20) not null);

-- 更改列名
alter table sss rename COLUMN status TO flag;


-- 更改表的表空间
alter table sss move tablespace system;


-- 更改是否记录日志
alter table sss logging;
alter table sss nologging;


-- 如何去给一个表改名字
ALTER TABLE sss RENAME TO sss_new;
rename sss to sss_new;


#+END_SRC


**** DROP
: drop table 表名;
: drop table 表名 cascade constraints;  -- 注意，只是删除约束

如果表存在被外键引用的情况的话，要删除有一下几种方式：
1. 删除外键引用的表
2. 删除外键引用表上存在的外键约束
3. 在删除的过程中加上关键字 cascade constraints.

*** DML（Data Definition Language）
概念，增删改查，又叫 CRUD(Create/Read/Update/Delete)

**** 查询(select)
基本语法:
#+BEGIN_SRC sql
select distinct 字段名|表达式 from [schema.]表名
  where clause
  order by clause
  group by clause
  having clause;
#+END_SRC


用法示例：
#+BEGIN_SRC sql
-- 基本的查询
select * from scott.emp;   -- * 代表所有的列，但在生产环境中不建议使用。有时候会很低效。而且不便于解耦合。

-- 基本的条件
select * from scott.emp where empno < 7802;

-- 排序
select * from scott.emp where empno < 7902 order by empno;
select * from scott.emp where empno < 7902 order by empno desc;   -- 降序
select * from scott.emp where empno < 7902 order by job, empno;   -- 组合多个排序的列

-- distinct
select distinct job from emp;
select distinct job, sal from emp;

-- alias
select to_char(empno) as empnochar from emp where sal > 5000;

#+END_SRC


表的连接
#+BEGIN_SRC sql
-- cross join(叉乘，笛卡尔积)。展示所有的记录的组合。是内连接和外连接的基础。
select * from a cross join b;
select * from a, b;

-- inner join(内连接)
select * from a inner join b on a.deptno = b.deptno;
select a.ename, b.deptname from a inner join b using (deptno);
select a.ename, b.deptname from a,b where b.deptno=a.deptno; -- oracle 中的写法

-- outer join(外连接)
select * from a left join b on a.deptno = b.deptno;
select * from a left outer join b using (deptno);
select * from a right outer join b on a.deptno = b.deptno;
select * from a full join b on a.deptno = b.deptno;   -- 全连接
select * from a, b where a.deptno=b.deptno(+);        -- 左外连
select * from a, b where a.deptno(+)=b.deptno;        -- 右连接

#+END_SRC

