oracle.html


<li><a id="sec-5-2-1-2" name="sec-5-2-1-2"></a>ALTER<br ><div class="outline-text-5" id="text-5-2-1-2">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #8D8D84; font-style: italic;">-- &#26368;&#22522;&#26412;&#30340;&#29992;&#27861;</span>
<span style="color: #0000FF;">alter</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">&#34920;&#21517;</span> &#25805;&#20316;&#20851;&#38190;&#35789; &#23646;&#24615;


<span style="color: #8D8D84; font-style: italic;">-- &#28155;&#21152;&#19968;&#20010;&#21015;</span>
<span style="color: #0000FF;">alter</span> <span style="color: #0000FF;">table</span> sss <span style="color: #0000FF;">add</span> howsoon <span style="color: #0000FF;">number</span> <span style="color: #0000FF;">default</span> <span style="color: #006699;">0</span>;
<span style="color: #0000FF;">alter</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">sss</span> <span style="color: #0000FF;">add</span> <span style="color: #707183;">(</span>status <span style="color: #6434A3;">char</span><span style="color: #707183;">)</span>;
<span style="color: #0000FF;">alter</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">sss</span> <span style="color: #0000FF;">add</span> <span style="color: #707183;">(</span>status <span style="color: #6434A3;">char</span> <span style="color: #0000FF;">not</span> <span style="color: #0000FF;">null</span><span style="color: #707183;">)</span>;         <span style="color: #8D8D84; font-style: italic;">-- &#21487;&#20197;&#28155;&#21152;&#20854;&#20182;&#30340;&#23646;&#24615;</span>
<span style="color: #0000FF;">alter</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">sss</span> <span style="color: #0000FF;">add</span> <span style="color: #707183;">(</span>status <span style="color: #6434A3;">char</span> <span style="color: #0000FF;">default</span> <span style="color: #008000;">'1'</span><span style="color: #707183;">)</span>;

<span style="color: #8D8D84; font-style: italic;">-- &#28155;&#21152;&#19968;&#20010;&#20027;&#38190;&#32422;&#26463;</span>
<span style="color: #0000FF;">alter</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">sss</span> <span style="color: #0000FF;">add</span> <span style="color: #0000FF;">constraints</span> pk_sss <span style="color: #0000FF;">primary</span> <span style="color: #0000FF;">key</span> <span style="color: #707183;">(</span>id<span style="color: #707183;">)</span>;

<span style="color: #8D8D84; font-style: italic;">-- &#21024;&#38500;&#19968;&#20010;&#21015;</span>
<span style="color: #0000FF;">alter</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">sss</span> <span style="color: #0000FF;">drop</span> <span style="color: #0000FF;">COLUMN</span> howsoon;

<span style="color: #8D8D84; font-style: italic;">-- &#21024;&#38500;&#20027;&#38190;</span>
<span style="color: #0000FF;">alter</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">sss</span> <span style="color: #0000FF;">drop</span> <span style="color: #0000FF;">CONSTRAINTS</span> pk_sss;

<span style="color: #8D8D84; font-style: italic;">-- &#21024;&#38500;&#22806;&#38190;</span>
<span style="color: #0000FF;">alter</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">&#34920;&#21517;</span> <span style="color: #0000FF;">drop</span> <span style="color: #0000FF;">constraints</span> &#22806;&#38190;&#21517;;

<span style="color: #8D8D84; font-style: italic;">-- &#20462;&#25913;&#21015;</span>
<span style="color: #0000FF;">alter</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">sss</span> <span style="color: #0000FF;">modify</span> <span style="color: #707183;">(</span>status varchar2<span style="color: #7388D6;">(</span>20<span style="color: #7388D6;">)</span> <span style="color: #0000FF;">not</span> <span style="color: #0000FF;">null</span><span style="color: #707183;">)</span>;

<span style="color: #8D8D84; font-style: italic;">-- &#26356;&#25913;&#21015;&#21517;</span>
<span style="color: #0000FF;">alter</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">sss</span> rename <span style="color: #0000FF;">COLUMN</span> status <span style="color: #0000FF;">TO</span> flag;


<span style="color: #8D8D84; font-style: italic;">-- &#26356;&#25913;&#34920;&#30340;&#34920;&#31354;&#38388;</span>
<span style="color: #0000FF;">alter</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">sss</span> move tablespace <span style="color: #0000FF;">system</span>;


<span style="color: #8D8D84; font-style: italic;">-- &#26356;&#25913;&#26159;&#21542;&#35760;&#24405;&#26085;&#24535;</span>
<span style="color: #0000FF;">alter</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">sss</span> logging;
<span style="color: #0000FF;">alter</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">sss</span> nologging;


<span style="color: #8D8D84; font-style: italic;">-- &#22914;&#20309;&#21435;&#32473;&#19968;&#20010;&#34920;&#25913;&#21517;&#23383;</span>
<span style="color: #0000FF;">ALTER</span> <span style="color: #0000FF;">TABLE</span> <span style="color: #006699;">sss</span> RENAME <span style="color: #0000FF;">TO</span> sss_new;
rename sss <span style="color: #0000FF;">to</span> sss_new;
</pre>
</div>
</div>
</li>


<li><a id="sec-5-2-1-3" name="sec-5-2-1-3"></a>DROP<br ><div class="outline-text-5" id="text-5-2-1-3">
<pre class="example">
drop table 表名;
drop table 表名 cascade constraints;  -- 注意，只是删除约束
</pre>

<p>
如果表存在被外键引用的情况的话，要删除有一下几种方式：
</p>
<ol class="org-ol">
<li>删除外键引用的表
</li>
<li>删除外键引用表上存在的外键约束
</li>
<li>在删除的过程中加上关键字 cascade constraints.
</li>
</ol>
</div>
</li></ul>
</div>

<div id="outline-container-sec-5-2-2" class="outline-4">
<h4 id="sec-5-2-2">DML（Data Definition Language）</h4>
<div class="outline-text-4" id="text-5-2-2">
<p>
概念，增删改查，又叫 CRUD(Create/Read/Update/Delete)
</p>
</div>

<ul class="org-ul"><li><a id="sec-5-2-2-1" name="sec-5-2-2-1"></a>查询(select)<br ><div class="outline-text-5" id="text-5-2-2-1">
<p>
基本语法:
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #0000FF;">select</span> <span style="color: #0000FF;">distinct</span> &#23383;&#27573;&#21517;|&#34920;&#36798;&#24335; <span style="color: #0000FF;">from</span> <span style="color: #707183;">[</span><span style="color: #0000FF;">schema</span>.<span style="color: #707183;">]</span>&#34920;&#21517;
  <span style="color: #0000FF;">where</span> clause
  <span style="color: #0000FF;">order</span> <span style="color: #0000FF;">by</span> clause
  <span style="color: #0000FF;">group</span> <span style="color: #0000FF;">by</span> clause
  <span style="color: #0000FF;">having</span> clause;
</pre>
</div>


<p>
用法示例：
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #8D8D84; font-style: italic;">-- &#22522;&#26412;&#30340;&#26597;&#35810;</span>
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> scott.emp;   <span style="color: #8D8D84; font-style: italic;">-- * &#20195;&#34920;&#25152;&#26377;&#30340;&#21015;&#65292;&#20294;&#22312;&#29983;&#20135;&#29615;&#22659;&#20013;&#19981;&#24314;&#35758;&#20351;&#29992;&#12290;&#26377;&#26102;&#20505;&#20250;&#24456;&#20302;&#25928;&#12290;&#32780;&#19988;&#19981;&#20415;&#20110;&#35299;&#32806;&#21512;&#12290;</span>

<span style="color: #8D8D84; font-style: italic;">-- &#22522;&#26412;&#30340;&#26465;&#20214;</span>
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> scott.emp <span style="color: #0000FF;">where</span> empno &lt; 7802;

<span style="color: #8D8D84; font-style: italic;">-- &#25490;&#24207;</span>
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> scott.emp <span style="color: #0000FF;">where</span> empno &lt; 7902 <span style="color: #0000FF;">order</span> <span style="color: #0000FF;">by</span> empno;
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> scott.emp <span style="color: #0000FF;">where</span> empno &lt; 7902 <span style="color: #0000FF;">order</span> <span style="color: #0000FF;">by</span> empno <span style="color: #0000FF;">desc</span>;   <span style="color: #8D8D84; font-style: italic;">-- &#38477;&#24207;</span>
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> scott.emp <span style="color: #0000FF;">where</span> empno &lt; 7902 <span style="color: #0000FF;">order</span> <span style="color: #0000FF;">by</span> job, empno;   <span style="color: #8D8D84; font-style: italic;">-- &#32452;&#21512;&#22810;&#20010;&#25490;&#24207;&#30340;&#21015;</span>

<span style="color: #8D8D84; font-style: italic;">-- distinct</span>
<span style="color: #0000FF;">select</span> <span style="color: #0000FF;">distinct</span> job <span style="color: #0000FF;">from</span> emp;
<span style="color: #0000FF;">select</span> <span style="color: #0000FF;">distinct</span> job, sal <span style="color: #0000FF;">from</span> emp;

<span style="color: #8D8D84; font-style: italic;">-- alias</span>
<span style="color: #0000FF;">select</span> to_char<span style="color: #707183;">(</span>empno<span style="color: #707183;">)</span> <span style="color: #0000FF;">as</span> empnochar <span style="color: #0000FF;">from</span> emp <span style="color: #0000FF;">where</span> sal &gt; 5000;
</pre>
</div>


<p>
表的连接
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #8D8D84; font-style: italic;">-- cross join(&#21449;&#20056;&#65292;&#31515;&#21345;&#23572;&#31215;)&#12290;&#23637;&#31034;&#25152;&#26377;&#30340;&#35760;&#24405;&#30340;&#32452;&#21512;&#12290;&#26159;&#20869;&#36830;&#25509;&#21644;&#22806;&#36830;&#25509;&#30340;&#22522;&#30784;&#12290;</span>
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> a <span style="color: #0000FF;">cross</span> <span style="color: #0000FF;">join</span> b;
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> a, b;

<span style="color: #8D8D84; font-style: italic;">-- inner join(&#20869;&#36830;&#25509;)</span>
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> a <span style="color: #0000FF;">inner</span> <span style="color: #0000FF;">join</span> b <span style="color: #0000FF;">on</span> a.deptno = b.deptno;
<span style="color: #0000FF;">select</span> a.ename, b.deptname <span style="color: #0000FF;">from</span> a <span style="color: #0000FF;">inner</span> <span style="color: #0000FF;">join</span> b <span style="color: #0000FF;">using</span> <span style="color: #707183;">(</span>deptno<span style="color: #707183;">)</span>;
<span style="color: #0000FF;">select</span> a.ename, b.deptname <span style="color: #0000FF;">from</span> a,b <span style="color: #0000FF;">where</span> b.deptno=a.deptno; <span style="color: #8D8D84; font-style: italic;">-- oracle &#20013;&#30340;&#20889;&#27861;</span>

<span style="color: #8D8D84; font-style: italic;">-- outer join(&#22806;&#36830;&#25509;)</span>
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> a <span style="color: #0000FF;">left</span> <span style="color: #0000FF;">join</span> b <span style="color: #0000FF;">on</span> a.deptno = b.deptno;
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> a <span style="color: #0000FF;">left</span> <span style="color: #0000FF;">outer</span> <span style="color: #0000FF;">join</span> b <span style="color: #0000FF;">using</span> <span style="color: #707183;">(</span>deptno<span style="color: #707183;">)</span>;
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> a <span style="color: #0000FF;">right</span> <span style="color: #0000FF;">outer</span> <span style="color: #0000FF;">join</span> b <span style="color: #0000FF;">on</span> a.deptno = b.deptno;
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> a <span style="color: #0000FF;">full</span> <span style="color: #0000FF;">join</span> b <span style="color: #0000FF;">on</span> a.deptno = b.deptno;   <span style="color: #8D8D84; font-style: italic;">-- &#20840;&#36830;&#25509;</span>
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> a, b <span style="color: #0000FF;">where</span> a.deptno=b.deptno<span style="color: #707183;">(</span>+<span style="color: #707183;">)</span>;        <span style="color: #8D8D84; font-style: italic;">-- &#24038;&#22806;&#36830;</span>
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> a, b <span style="color: #0000FF;">where</span> a.deptno<span style="color: #707183;">(</span>+<span style="color: #707183;">)</span>=b.deptno;        <span style="color: #8D8D84; font-style: italic;">-- &#21491;&#36830;&#25509;</span>
</pre>
</div>
</div>
