oracle.org
***** TODO 阶段性作业（scott用户下的表）
1. 查询每个部门下有多少员工
2. 查询除去 salesman 所有平均工资超过 1500 的部门
3. 查询在 new york 工作的所有员工的姓名，部门名称和工资信息
4. 查询姓名为 King 的员工的编号，名称跟部门
5. 查询各种工作的最低工资
6. 查询工龄大于10年的所有员工信息
7. 查询每个部门员工数量，平均工资和平均工作年限
8. 统计各部门每个工种的人数，平均工资。
9. 查询从事同一种工作但不属于同一部门的员工信息。
10. 查询所有员工工资都大于1000的部门的信息及员工信息
11. 查询入职日期早于其直接上级的所有员工信息。
12. 列出雇员中（除去mgr为空的人)工资第二高的人。
13. 列出1981年来公司所有员工的总收入（包括sal和comm）

***** Group By
示例：
#+BEGIN_SRC sql

select * from emp group by deptno;    -- 错误的用法。因为用group by之后，需要指定跟分组相关的列、字段。

-- 查看每一组的数目
select deptno, count(*) from emp group by deptno;  -- 查看每一个部门有多少人

-- 查询每个部门下有多少员工
select d.dname, count(*) from dept d, emp e 
  where d.deptno = e.deptno group by d.dname;
select d.dname,e.c 
  from dept d,
       (select deptno, count(*) c from emp group by deptno) e
 where d.deptno = e.deptno;


-- 分组的顺序是这样的： 
-- 首先，where过滤原始数据；
-- 其次,依据 group by 进行分组，得到跟分组数相同的记录数目；
-- 最后，用having对groupby之后产生的结果再进行过滤。
select gno,
    count(*) 人数,
    max(yanzhi) 最美,
    min(yanzhi) 最有才,
    avg(yanzhi) 平均,
    sum(yanzhi) 总和
  from boysandgirls
    where name <> '黄'
    group by gno
    having sum(yanzhi)>400;

select * from
  (select gno,
      count(*) 人数,
      max(yanzhi) 最美,
      min(yanzhi) 最有才,
      avg(yanzhi) 平均,
      sum(yanzhi) 总和
    from boysandgirls
      where name <> '黄'
      group by gno) a
   where a.总和>400;

-- 分组之后的表的连接
select * from
  groups a,
  (select gno,
       count(*) 人数,
       max(yanzhi) 最美,
       min(yanzhi) 最有才,
       avg(yanzhi) 平均,
       sum(yanzhi) 总和
     from boysandgirls
       where name <> '黄'
       group by gno
       having sum(yanzhi)>400) b
where a.gno = b.gno;

-- 表的连接之后再分组
select gname, sum(yanzhi) 
  from mates a, groups b 
  where a.gno=b.gno and name<>'黄小波' 
  group by gname
  having sum(a.yanzhi)>350;


#+End_src

