oracle.html

<ul class="org-ul"><li><a id="sec-5-2-2-1-1" name="sec-5-2-2-1-1"></a><span class="todo TODO">TODO</span> 阶段性作业（scott用户下的表）<br ><div class="outline-text-6" id="text-5-2-2-1-1">
<ol class="org-ol">
<li>查询每个部门下有多少员工
</li>
<li>查询除去 salesman 所有平均工资超过 1500 的部门
</li>
<li>查询在 new york 工作的所有员工的姓名，部门名称和工资信息
</li>
<li>查询姓名为 King 的员工的编号，名称跟部门
</li>
<li>查询各种工作的最低工资
</li>
<li>查询工龄大于10年的所有员工信息
</li>
<li>查询每个部门员工数量，平均工资和平均工作年限
</li>
<li>统计各部门每个工种的人数，平均工资。
</li>
<li>查询从事同一种工作但不属于同一部门的员工信息。
</li>
<li>查询所有员工工资都大于1000的部门的信息及员工信息
</li>
<li>查询入职日期早于其直接上级的所有员工信息。
</li>
<li>列出雇员中（除去mgr为空的人)工资第二高的人。
</li>
<li>列出1981年来公司所有员工的总收入（包括sal和comm）
</li>
</ol>
</div>
</li>

<li><a id="sec-5-2-2-1-2" name="sec-5-2-2-1-2"></a>Group By<br ><div class="outline-text-6" id="text-5-2-2-1-2">
<p>
示例：
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> emp <span style="color: #0000FF;">group</span> <span style="color: #0000FF;">by</span> deptno;    <span style="color: #8D8D84; font-style: italic;">-- &#38169;&#35823;&#30340;&#29992;&#27861;&#12290;&#22240;&#20026;&#29992;group by&#20043;&#21518;&#65292;&#38656;&#35201;&#25351;&#23450;&#36319;&#20998;&#32452;&#30456;&#20851;&#30340;&#21015;&#12289;&#23383;&#27573;&#12290;</span>

<span style="color: #8D8D84; font-style: italic;">-- &#26597;&#30475;&#27599;&#19968;&#32452;&#30340;&#25968;&#30446;</span>
<span style="color: #0000FF;">select</span> deptno, <span style="color: #006FE0;">count</span><span style="color: #707183;">(</span>*<span style="color: #707183;">)</span> <span style="color: #0000FF;">from</span> emp <span style="color: #0000FF;">group</span> <span style="color: #0000FF;">by</span> deptno;  <span style="color: #8D8D84; font-style: italic;">-- &#26597;&#30475;&#27599;&#19968;&#20010;&#37096;&#38376;&#26377;&#22810;&#23569;&#20154;</span>

<span style="color: #8D8D84; font-style: italic;">-- &#26597;&#35810;&#27599;&#20010;&#37096;&#38376;&#19979;&#26377;&#22810;&#23569;&#21592;&#24037;</span>
<span style="color: #0000FF;">select</span> d.dname, <span style="color: #006FE0;">count</span><span style="color: #707183;">(</span>*<span style="color: #707183;">)</span> <span style="color: #0000FF;">from</span> dept d, emp e 
  <span style="color: #0000FF;">where</span> d.deptno = e.deptno <span style="color: #0000FF;">group</span> <span style="color: #0000FF;">by</span> d.dname;
<span style="color: #0000FF;">select</span> d.dname,e.c 
  <span style="color: #0000FF;">from</span> dept d,
       <span style="color: #707183;">(</span><span style="color: #0000FF;">select</span> deptno, <span style="color: #006FE0;">count</span><span style="color: #7388D6;">(</span>*<span style="color: #7388D6;">)</span> c <span style="color: #0000FF;">from</span> emp <span style="color: #0000FF;">group</span> <span style="color: #0000FF;">by</span> deptno<span style="color: #707183;">)</span> e
 <span style="color: #0000FF;">where</span> d.deptno = e.deptno;


<span style="color: #8D8D84; font-style: italic;">-- &#20998;&#32452;&#30340;&#39034;&#24207;&#26159;&#36825;&#26679;&#30340;&#65306; </span>
<span style="color: #8D8D84; font-style: italic;">-- &#39318;&#20808;&#65292;where&#36807;&#28388;&#21407;&#22987;&#25968;&#25454;&#65307;</span>
<span style="color: #8D8D84; font-style: italic;">-- &#20854;&#27425;,&#20381;&#25454; group by &#36827;&#34892;&#20998;&#32452;&#65292;&#24471;&#21040;&#36319;&#20998;&#32452;&#25968;&#30456;&#21516;&#30340;&#35760;&#24405;&#25968;&#30446;&#65307;</span>
<span style="color: #8D8D84; font-style: italic;">-- &#26368;&#21518;&#65292;&#29992;having&#23545;groupby&#20043;&#21518;&#20135;&#29983;&#30340;&#32467;&#26524;&#20877;&#36827;&#34892;&#36807;&#28388;&#12290;</span>
<span style="color: #0000FF;">select</span> gno,
    <span style="color: #006FE0;">count</span><span style="color: #707183;">(</span>*<span style="color: #707183;">)</span> &#20154;&#25968;,
    <span style="color: #006FE0;">max</span><span style="color: #707183;">(</span>yanzhi<span style="color: #707183;">)</span> &#26368;&#32654;,
    <span style="color: #006FE0;">min</span><span style="color: #707183;">(</span>yanzhi<span style="color: #707183;">)</span> &#26368;&#26377;&#25165;,
    <span style="color: #006FE0;">avg</span><span style="color: #707183;">(</span>yanzhi<span style="color: #707183;">)</span> &#24179;&#22343;,
    <span style="color: #006FE0;">sum</span><span style="color: #707183;">(</span>yanzhi<span style="color: #707183;">)</span> &#24635;&#21644;
  <span style="color: #0000FF;">from</span> boysandgirls
    <span style="color: #0000FF;">where</span> <span style="color: #0000FF;">name</span> &lt;&gt; <span style="color: #008000;">'&#40644;'</span>
    <span style="color: #0000FF;">group</span> <span style="color: #0000FF;">by</span> gno
    <span style="color: #0000FF;">having</span> <span style="color: #006FE0;">sum</span><span style="color: #707183;">(</span>yanzhi<span style="color: #707183;">)</span>&gt;400;

<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span>
  <span style="color: #707183;">(</span><span style="color: #0000FF;">select</span> gno,
      <span style="color: #006FE0;">count</span><span style="color: #7388D6;">(</span>*<span style="color: #7388D6;">)</span> &#20154;&#25968;,
      <span style="color: #006FE0;">max</span><span style="color: #7388D6;">(</span>yanzhi<span style="color: #7388D6;">)</span> &#26368;&#32654;,
      <span style="color: #006FE0;">min</span><span style="color: #7388D6;">(</span>yanzhi<span style="color: #7388D6;">)</span> &#26368;&#26377;&#25165;,
      <span style="color: #006FE0;">avg</span><span style="color: #7388D6;">(</span>yanzhi<span style="color: #7388D6;">)</span> &#24179;&#22343;,
      <span style="color: #006FE0;">sum</span><span style="color: #7388D6;">(</span>yanzhi<span style="color: #7388D6;">)</span> &#24635;&#21644;
    <span style="color: #0000FF;">from</span> boysandgirls
      <span style="color: #0000FF;">where</span> <span style="color: #0000FF;">name</span> &lt;&gt; <span style="color: #008000;">'&#40644;'</span>
      <span style="color: #0000FF;">group</span> <span style="color: #0000FF;">by</span> gno<span style="color: #707183;">)</span> a
   <span style="color: #0000FF;">where</span> a.&#24635;&#21644;&gt;400;

<span style="color: #8D8D84; font-style: italic;">-- &#20998;&#32452;&#20043;&#21518;&#30340;&#34920;&#30340;&#36830;&#25509;</span>
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span>
  groups a,
  <span style="color: #707183;">(</span><span style="color: #0000FF;">select</span> gno,
       <span style="color: #006FE0;">count</span><span style="color: #7388D6;">(</span>*<span style="color: #7388D6;">)</span> &#20154;&#25968;,
       <span style="color: #006FE0;">max</span><span style="color: #7388D6;">(</span>yanzhi<span style="color: #7388D6;">)</span> &#26368;&#32654;,
       <span style="color: #006FE0;">min</span><span style="color: #7388D6;">(</span>yanzhi<span style="color: #7388D6;">)</span> &#26368;&#26377;&#25165;,
       <span style="color: #006FE0;">avg</span><span style="color: #7388D6;">(</span>yanzhi<span style="color: #7388D6;">)</span> &#24179;&#22343;,
       <span style="color: #006FE0;">sum</span><span style="color: #7388D6;">(</span>yanzhi<span style="color: #7388D6;">)</span> &#24635;&#21644;
     <span style="color: #0000FF;">from</span> boysandgirls
       <span style="color: #0000FF;">where</span> <span style="color: #0000FF;">name</span> &lt;&gt; <span style="color: #008000;">'&#40644;'</span>
       <span style="color: #0000FF;">group</span> <span style="color: #0000FF;">by</span> gno
       <span style="color: #0000FF;">having</span> <span style="color: #006FE0;">sum</span><span style="color: #7388D6;">(</span>yanzhi<span style="color: #7388D6;">)</span>&gt;400<span style="color: #707183;">)</span> b
<span style="color: #0000FF;">where</span> a.gno = b.gno;

<span style="color: #8D8D84; font-style: italic;">-- &#34920;&#30340;&#36830;&#25509;&#20043;&#21518;&#20877;&#20998;&#32452;</span>
<span style="color: #0000FF;">select</span> gname, <span style="color: #006FE0;">sum</span><span style="color: #707183;">(</span>yanzhi<span style="color: #707183;">)</span> 
  <span style="color: #0000FF;">from</span> mates a, groups b 
  <span style="color: #0000FF;">where</span> a.gno=b.gno <span style="color: #0000FF;">and</span> <span style="color: #0000FF;">name</span>&lt;&gt;<span style="color: #008000;">'&#40644;&#23567;&#27874;'</span> 
  <span style="color: #0000FF;">group</span> <span style="color: #0000FF;">by</span> gname
  <span style="color: #0000FF;">having</span> <span style="color: #006FE0;">sum</span><span style="color: #707183;">(</span>a.yanzhi<span style="color: #707183;">)</span>&gt;350;
</pre>
</div>
</div>
</li></ul>
</li>
