oracle.org
**** 插入(insert)
最基本的语法
#+BEGIN_SRC sql
insert into table_name [columns] values (value...);

-- 示例表
create table demo (id number, name varchar2(20));

-- 最简单插入
insert into demo values (1, 'haha');
insert into demo (id, name) values (2, 'hehe');
insert into demo (id) values (3);
insert into demo (name, id) values ('heihei', 4);


-- 注意，插入时，最好指定插入的字段。因为可以提高效率，可以避免错误。
alter table demo add age number;      -- 对表进行扩充
insert into demo values (1, 'haha');  -- 会出错，因为多了一列，但是插入的语法没变
insert into demo (name, id) values ('heihei', 4);  -- 没有问题。




-- 从其他的表中加载数据
insert into table_name select xxx from yyy;

-- 复制 scott.dept 中的deptno>20的所有数据到指定表
create table d as select * from scott.dept where 1=2;  -- 按照之前学的语法，复制表的结构
insert into dept select * from scott.dept where deptno>20;
insert into dept (select * from scott.dept where deptno>20);


-- 创建一张表，只有一个字段， varchar2(20)
-- 把 scott.dept 中所有 deptno > 20 的部门的名称插入其中
create table dept2 (dname varchar2(20));   -- 创建表的语句
-- 下面三种是等价的
insert into dept2 select dname from scott.dept where deptno > 20;
insert into dept2 (dname) select dname from scott.dept where deptno > 20;
insert into dept2 value select dname from scott.dept where deptno > 20;
-- 下面一种是错误的，因为在指定字段的时候，不能够跟 value 关键字一起使用
insert into dept2 (dname) value select dname from scott.dept where deptno > 20;  ---


#+END_SRC





**** 更新(update)
#+BEGIN_SRC sql
-- 基本语法
UPDATE table_name SET column=value[, column=value...] [WHERE condition]

-- 注意，一定不要缺少相应的where，粗心大意是dba或者数据库操作员的天敌。
-- where 条件，尽可能使用主键，因为主键是用来标识唯一一条记录的。
update dept set dname='销售部' where deptno = 30;


#+END_SRC
**** 删除(delete)
#+BEGIN_SRC sql
-- 语法
delete from table_name [where condition]

delete from dept;   -- 删除表中所有记录
delete from dept where dname = 'SALES'; -- 删除表中所有 SALES 的记录

-- truncate 语法，截断数据，会清空表中的所有数据。
-- 不需要提交事务，也不能够回滚。因为 truncate 不产生回滚段，不写 redolog
-- 它删除的效率要高于 delete from，但因为不能回滚，所以应用中应该慎之又慎。
truncate table table_name;

#+END_SRC



*** TCL（Transaction Control Language)
控制数据的事务。事务就是把数据当做一个完整的操作单元，一起成功或者一起失败。这样才能保证数据的一致性。
- set transaction xxx 配置事务属性
  : set transaction read only/write      -- 设置事务是否只读
  : set transaction ISOLATION level read committed   -- 设置事务的隔离属性
- savepoint name 保存点
- rollback to [savepint] 回撤
- commit 提交

*** DCL（Data Control Language)
- grant
- revoke










** 数据类型
*** 字符类型
