oracle.html

<li><a id="sec-5-2-2-2" name="sec-5-2-2-2"></a>插入(insert)<br ><div class="outline-text-5" id="text-5-2-2-2">
<p>
最基本的语法
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">into</span> <span style="color: #0000FF;">table_name</span> <span style="color: #707183;">[</span>columns<span style="color: #707183;">]</span> <span style="color: #0000FF;">values</span> <span style="color: #707183;">(</span><span style="color: #0000FF;">value</span>...<span style="color: #707183;">)</span>;

<span style="color: #8D8D84; font-style: italic;">-- &#31034;&#20363;&#34920;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">demo</span> <span style="color: #707183;">(</span>id <span style="color: #0000FF;">number</span>, <span style="color: #0000FF;">name</span> varchar2<span style="color: #7388D6;">(</span>20<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>;

<span style="color: #8D8D84; font-style: italic;">-- &#26368;&#31616;&#21333;&#25554;&#20837;</span>
<span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">into</span> demo <span style="color: #0000FF;">values</span> <span style="color: #707183;">(</span>1, <span style="color: #008000;">'haha'</span><span style="color: #707183;">)</span>;
<span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">into</span> demo <span style="color: #707183;">(</span>id, <span style="color: #0000FF;">name</span><span style="color: #707183;">)</span> <span style="color: #0000FF;">values</span> <span style="color: #707183;">(</span>2, <span style="color: #008000;">'hehe'</span><span style="color: #707183;">)</span>;
<span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">into</span> demo <span style="color: #707183;">(</span>id<span style="color: #707183;">)</span> <span style="color: #0000FF;">values</span> <span style="color: #707183;">(</span>3<span style="color: #707183;">)</span>;
<span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">into</span> demo <span style="color: #707183;">(</span><span style="color: #0000FF;">name</span>, id<span style="color: #707183;">)</span> <span style="color: #0000FF;">values</span> <span style="color: #707183;">(</span><span style="color: #008000;">'heihei'</span>, 4<span style="color: #707183;">)</span>;


<span style="color: #8D8D84; font-style: italic;">-- &#27880;&#24847;&#65292;&#25554;&#20837;&#26102;&#65292;&#26368;&#22909;&#25351;&#23450;&#25554;&#20837;&#30340;&#23383;&#27573;&#12290;&#22240;&#20026;&#21487;&#20197;&#25552;&#39640;&#25928;&#29575;&#65292;&#21487;&#20197;&#36991;&#20813;&#38169;&#35823;&#12290;</span>
<span style="color: #0000FF;">alter</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">demo</span> <span style="color: #0000FF;">add</span> age <span style="color: #0000FF;">number</span>;      <span style="color: #8D8D84; font-style: italic;">-- &#23545;&#34920;&#36827;&#34892;&#25193;&#20805;</span>
<span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">into</span> demo <span style="color: #0000FF;">values</span> <span style="color: #707183;">(</span>1, <span style="color: #008000;">'haha'</span><span style="color: #707183;">)</span>;  <span style="color: #8D8D84; font-style: italic;">-- &#20250;&#20986;&#38169;&#65292;&#22240;&#20026;&#22810;&#20102;&#19968;&#21015;&#65292;&#20294;&#26159;&#25554;&#20837;&#30340;&#35821;&#27861;&#27809;&#21464;</span>
<span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">into</span> demo <span style="color: #707183;">(</span><span style="color: #0000FF;">name</span>, id<span style="color: #707183;">)</span> <span style="color: #0000FF;">values</span> <span style="color: #707183;">(</span><span style="color: #008000;">'heihei'</span>, 4<span style="color: #707183;">)</span>;  <span style="color: #8D8D84; font-style: italic;">-- &#27809;&#26377;&#38382;&#39064;&#12290;</span>




<span style="color: #8D8D84; font-style: italic;">-- &#20174;&#20854;&#20182;&#30340;&#34920;&#20013;&#21152;&#36733;&#25968;&#25454;</span>
<span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">into</span> <span style="color: #0000FF;">table_name</span> <span style="color: #0000FF;">select</span> xxx <span style="color: #0000FF;">from</span> yyy;

<span style="color: #8D8D84; font-style: italic;">-- &#22797;&#21046; scott.dept &#20013;&#30340;deptno&gt;20&#30340;&#25152;&#26377;&#25968;&#25454;&#21040;&#25351;&#23450;&#34920;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">d</span> <span style="color: #0000FF;">as</span> <span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> scott.dept <span style="color: #0000FF;">where</span> 1=2;  <span style="color: #8D8D84; font-style: italic;">-- &#25353;&#29031;&#20043;&#21069;&#23398;&#30340;&#35821;&#27861;&#65292;&#22797;&#21046;&#34920;&#30340;&#32467;&#26500;</span>
<span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">into</span> dept <span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> scott.dept <span style="color: #0000FF;">where</span> deptno&gt;20;
<span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">into</span> dept <span style="color: #707183;">(</span><span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> scott.dept <span style="color: #0000FF;">where</span> deptno&gt;20<span style="color: #707183;">)</span>;


<span style="color: #8D8D84; font-style: italic;">-- &#21019;&#24314;&#19968;&#24352;&#34920;&#65292;&#21482;&#26377;&#19968;&#20010;&#23383;&#27573;&#65292; varchar2(20)</span>
<span style="color: #8D8D84; font-style: italic;">-- &#25226; scott.dept &#20013;&#25152;&#26377; deptno &gt; 20 &#30340;&#37096;&#38376;&#30340;&#21517;&#31216;&#25554;&#20837;&#20854;&#20013;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">dept2</span> <span style="color: #707183;">(</span>dname varchar2<span style="color: #7388D6;">(</span>20<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>;   <span style="color: #8D8D84; font-style: italic;">-- &#21019;&#24314;&#34920;&#30340;&#35821;&#21477;</span>
<span style="color: #8D8D84; font-style: italic;">-- &#19979;&#38754;&#19977;&#31181;&#26159;&#31561;&#20215;&#30340;</span>
<span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">into</span> dept2 <span style="color: #0000FF;">select</span> dname <span style="color: #0000FF;">from</span> scott.dept <span style="color: #0000FF;">where</span> deptno &gt; 20;
<span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">into</span> dept2 <span style="color: #707183;">(</span>dname<span style="color: #707183;">)</span> <span style="color: #0000FF;">select</span> dname <span style="color: #0000FF;">from</span> scott.dept <span style="color: #0000FF;">where</span> deptno &gt; 20;
<span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">into</span> dept2 <span style="color: #0000FF;">value</span> <span style="color: #0000FF;">select</span> dname <span style="color: #0000FF;">from</span> scott.dept <span style="color: #0000FF;">where</span> deptno &gt; 20;
<span style="color: #8D8D84; font-style: italic;">-- &#19979;&#38754;&#19968;&#31181;&#26159;&#38169;&#35823;&#30340;&#65292;&#22240;&#20026;&#22312;&#25351;&#23450;&#23383;&#27573;&#30340;&#26102;&#20505;&#65292;&#19981;&#33021;&#22815;&#36319; value &#20851;&#38190;&#23383;&#19968;&#36215;&#20351;&#29992;</span>
<span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">into</span> dept2 <span style="color: #707183;">(</span>dname<span style="color: #707183;">)</span> <span style="color: #0000FF;">value</span> <span style="color: #0000FF;">select</span> dname <span style="color: #0000FF;">from</span> scott.dept <span style="color: #0000FF;">where</span> deptno &gt; 20;  <span style="color: #8D8D84; font-style: italic;">---</span>
</pre>
</div>
</div>
</li>





<li><a id="sec-5-2-2-3" name="sec-5-2-2-3"></a>更新(update)<br ><div class="outline-text-5" id="text-5-2-2-3">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #8D8D84; font-style: italic;">-- &#22522;&#26412;&#35821;&#27861;</span>
<span style="color: #0000FF;">UPDATE</span> <span style="color: #0000FF;">table_name</span> <span style="color: #0000FF;">SET</span> <span style="color: #0000FF;">column</span>=<span style="color: #0000FF;">value</span><span style="color: #707183;">[</span>, <span style="color: #0000FF;">column</span>=<span style="color: #0000FF;">value</span>...<span style="color: #707183;">]</span> <span style="color: #707183;">[</span><span style="color: #0000FF;">WHERE</span> condition<span style="color: #707183;">]</span>

<span style="color: #8D8D84; font-style: italic;">-- &#27880;&#24847;&#65292;&#19968;&#23450;&#19981;&#35201;&#32570;&#23569;&#30456;&#24212;&#30340;where&#65292;&#31895;&#24515;&#22823;&#24847;&#26159;dba&#25110;&#32773;&#25968;&#25454;&#24211;&#25805;&#20316;&#21592;&#30340;&#22825;&#25932;&#12290;</span>
<span style="color: #8D8D84; font-style: italic;">-- where &#26465;&#20214;&#65292;&#23613;&#21487;&#33021;&#20351;&#29992;&#20027;&#38190;&#65292;&#22240;&#20026;&#20027;&#38190;&#26159;&#29992;&#26469;&#26631;&#35782;&#21807;&#19968;&#19968;&#26465;&#35760;&#24405;&#30340;&#12290;</span>
<span style="color: #0000FF;">update</span> dept <span style="color: #0000FF;">set</span> dname=<span style="color: #008000;">'&#38144;&#21806;&#37096;'</span> <span style="color: #0000FF;">where</span> deptno = 30;
</pre>
</div>
</div>
</li>
<li><a id="sec-5-2-2-4" name="sec-5-2-2-4"></a>删除(delete)<br ><div class="outline-text-5" id="text-5-2-2-4">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #8D8D84; font-style: italic;">-- &#35821;&#27861;</span>
<span style="color: #0000FF;">delete</span> <span style="color: #0000FF;">from</span> <span style="color: #0000FF;">table_name</span> <span style="color: #707183;">[</span><span style="color: #0000FF;">where</span> condition<span style="color: #707183;">]</span>

<span style="color: #0000FF;">delete</span> <span style="color: #0000FF;">from</span> dept;   <span style="color: #8D8D84; font-style: italic;">-- &#21024;&#38500;&#34920;&#20013;&#25152;&#26377;&#35760;&#24405;</span>
<span style="color: #0000FF;">delete</span> <span style="color: #0000FF;">from</span> dept <span style="color: #0000FF;">where</span> dname = <span style="color: #008000;">'SALES'</span>; <span style="color: #8D8D84; font-style: italic;">-- &#21024;&#38500;&#34920;&#20013;&#25152;&#26377; SALES &#30340;&#35760;&#24405;</span>

<span style="color: #8D8D84; font-style: italic;">-- truncate &#35821;&#27861;&#65292;&#25130;&#26029;&#25968;&#25454;&#65292;&#20250;&#28165;&#31354;&#34920;&#20013;&#30340;&#25152;&#26377;&#25968;&#25454;&#12290;</span>
<span style="color: #8D8D84; font-style: italic;">-- &#19981;&#38656;&#35201;&#25552;&#20132;&#20107;&#21153;&#65292;&#20063;&#19981;&#33021;&#22815;&#22238;&#28378;&#12290;&#22240;&#20026; truncate &#19981;&#20135;&#29983;&#22238;&#28378;&#27573;&#65292;&#19981;&#20889; redolog</span>
<span style="color: #8D8D84; font-style: italic;">-- &#23427;&#21024;&#38500;&#30340;&#25928;&#29575;&#35201;&#39640;&#20110; delete from&#65292;&#20294;&#22240;&#20026;&#19981;&#33021;&#22238;&#28378;&#65292;&#25152;&#20197;&#24212;&#29992;&#20013;&#24212;&#35813;&#24910;&#20043;&#21448;&#24910;&#12290;</span>
truncate <span style="color: #0000FF;">table</span> <span style="color: #0000FF;">table_name</span>;
</pre>
</div>
</div>
</li></ul>
</div>



<div id="outline-container-sec-5-2-3" class="outline-4">
<h4 id="sec-5-2-3">TCL（Transaction Control Language)</h4>
<div class="outline-text-4" id="text-5-2-3">
<p>
控制数据的事务。事务就是把数据当做一个完整的操作单元，一起成功或者一起失败。这样才能保证数据的一致性。
</p>
<ul class="org-ul">
<li>set transaction xxx 配置事务属性
<pre class="example">
set transaction read only/write      -- 设置事务是否只读
set transaction ISOLATION level read committed   -- 设置事务的隔离属性
</pre>
</li>
<li>savepoint name 保存点
</li>
<li>rollback to [savepint] 回撤
</li>
<li>commit 提交
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5-2-4" class="outline-4">
<h4 id="sec-5-2-4">DCL（Data Control Language)</h4>
<div class="outline-text-4" id="text-5-2-4">
<ul class="org-ul">
<li>grant
</li>
<li>revoke
</li>
</ul>
</div>
</div>
</div>
