oracle.org
**** char 类型(nchar)
固定长度，默认是1，最大长度是2000个字节。不够的长度，oracle 会用空格进行填充。
: create table s1 (c char(2001));  -- 错误，因为2001超出了类型的范围
: create table s2 (c char);        -- 默认char的长度为1.
: insert into s2 values ('a');     -- 它是正确的。
: insert into s2 values ('你');    -- 它是错误的。列的值太大，(实际值: 2, 最大值: 1)

**** varchar 类型
是SQL的标准类型。
不建议使用，用 varchar2 代替。因为 varchar2 有更高的效率和更好的兼容性。
**** varchar2 类型(nvarchar2)
可变长度的。最大长度为 4000。效率不及固定长度的char类型。英文占用一个字节，中文占用多字节，所以，中文跟中文占用空间不一致。
nvarchar2, 在 varchar2 基础上加入了字符集支持。

nvarchar2中，长度表示的是字符个数。

: create table demo (a char(100), b varchar2(100), c nvarchar2(100));
: insert into demo values ('a', 'a', 'a');
: insert into demo values ('你', '你', '你');
: select lengthb(a), lengthb(b), lengthb(c) from demo;
: create table s4 (c varchar2(4 char));    -- char 是代表字符个数，是一个单位符号。这个语句创建的表格，只有一个字段， 是 varchar2 类型，可以填充 4 个字符（注意，不是字节）。
: create table s4 (c varchar2(4 byte));    -- byte 是跟上面语句一样的单位符号，代表的是字节。这是 varchar2 的默认单位。这个语句创建的表格，只有一个字段，是 varchar2 类型，可以填充 4 个字节（注意，不是字符）。

**** long 类型
用来存储大容量数据的，最大是 2GB。已弃用，建议使用 LOB 字段代替。


*** 数字类型
**** NUMBER 类型
定义语法为：
: COLUMN number[(precision, scale)]
默认的长度是38。

如果不带参数，精度和小数的位数是根据填充的数字自动判定的。
: create table s5 (c number);
如果 scale 为空，那么默认， scale 为 0。小数点后被截断的数位，采取的是四舍五入制。
: create table s7 (c number(5));
: insert into s7 values (9.2222);   -- 插入的是 9
: insert into s7 values (9.7777);   -- 插入的是 10
如果 precision 为空，那么，确定小数点位数为 scale，precision 自动判定。
: create table s8 (c number(*, 2));
: insert into s8 values (6.23236);
两个参数都具备的情况：
: create table demo (a number(4, 2));
: insert into demo values (987.1);  -- 值大于为此列指定的允许精度
: insert into demo values (7.101);  -- 实际上插入的是 7.10
两个参数，第一个代表精度，第二个代表小数位数。

还有两个子类型 int/float
: create table s9 (c int);
: insert into s9 values (22.22);

*** 时间类型
**** DATE 数据类型
显示的是年月日。
#+BEGIN_SRC sql
-- 查看当天的日期
select sysdate from dual;

-- 修改当前日期显示的格式
alter session set nls_date_format='yyyy.mm.dd';

-- 应用示例
create table d1 (birth date);
insert into d1 values (sysdate);
insert into d1 values (sysdate - 1);             -- 可以进行简单运算，默认单位是“天”
insert into d1 values (to_date('20120701'));     -- 用 to_date 函数对字符串进行转换。可以带两个参数，第一个是必须的。如果第二个参数被忽略，那么 oracle 会根据 yyyy/mm/dd 的顺序尝试对日期进行格式化。
insert into d1 values (to_date('2012/07/01'));
insert into d1 values (to_date('2012=07=01'));

insert into d1 values (to_date('01.07.2012', 'dd.mm.yyyy'));   -- 两个参数都是字符串，需要用单引号引起来。

create table s1 values (birth varchar2(20));
insert into s1 values (to_char(sysdate, 'yyyy-mm-dd'));        -- to_char 是把其他的类型转换为 char 类型



#+END_SRC

**** TIMESTAMP 数据类型

#+BEGIN_SRC sql

-- 返回的是 timestamp with timezone 类型，包含年月日时分秒微妙毫秒，上午下午，时区
-- 在一般业务系统中，时间基本上用的都是 timestamp 类型
-- 可以用 nls_timestamp_format 定制显示方式
select systimestamp from dual;;

#+END_SRC


*** RAW 类型
主要用来处理二进制的。

分为
**** RAW
默认占用空间为 2kb

**** Long RAW
不建议使用，跟 long 类型有相同的缺点。

*** LOB类型(large Object)
**** CLOB 类型
是存储字符的大对象类型。
: create table lobdemo1 (c clob);  -- 创建一个具备 blob 字段的表
: insert into lobdemo1 values ('ssss');
: insert into lobdemo1 values (22222222222222222);
: insert into lobdemo1 values (null);
: insert into lobdemo1 values (empty_clob());   -- 插入的不是空值

**** BLOB 类型
是存储二进制数据的大对象类型。主要的用处是存储图形，音频，视频等。

oracle 提供了dbms_lob 包，对 lob 字段进行操作。

**** BFILE 类型
也是存储二进制。是以外部文件的形式进行存储的。

**** XMLType 类型
主要是为了处理 xml 文档的。


*** ROWID/ROWNUM
**** rowid
rowid 是 oracle 中的伪列。可以通过下面语句显示:
: select d.rowid, d.* from dept d
它是唯一的，不可变的，固定长度的。

它是数据存储物理地址的一种映射。一共有18位，前6位表示对象id，后3位表示fno，后6位表示块编号，最后3位表示行编号。
所以，通过rowid可以最快速度地定位到数据所在的位置。

rowid 是 oracle 特有的。

不建议使用 rowid 作为表的主键。迁移的需求，有改变的风险。



