oracle.html










<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3">数据类型</h3>
<div class="outline-text-3" id="text-5-3">
</div><div id="outline-container-sec-5-3-1" class="outline-4">
<h4 id="sec-5-3-1">字符类型</h4>
<div class="outline-text-4" id="text-5-3-1">
</div><ul class="org-ul"><li><a id="sec-5-3-1-1" name="sec-5-3-1-1"></a>char 类型(nchar)<br ><div class="outline-text-5" id="text-5-3-1-1">
<p>
固定长度，默认是1，最大长度是2000个字节。不够的长度，oracle 会用空格进行填充。
</p>
<pre class="example">
create table s1 (c char(2001));  -- 错误，因为2001超出了类型的范围
create table s2 (c char);        -- 默认char的长度为1.
insert into s2 values ('a');     -- 它是正确的。
insert into s2 values ('你');    -- 它是错误的。列的值太大，(实际值: 2, 最大值: 1)
</pre>
</div>
</li>

<li><a id="sec-5-3-1-2" name="sec-5-3-1-2"></a>varchar 类型<br ><div class="outline-text-5" id="text-5-3-1-2">
<p>
是SQL的标准类型。
不建议使用，用 varchar2 代替。因为 varchar2 有更高的效率和更好的兼容性。
</p>
</div>
</li>
<li><a id="sec-5-3-1-3" name="sec-5-3-1-3"></a>varchar2 类型(nvarchar2)<br ><div class="outline-text-5" id="text-5-3-1-3">
<p>
可变长度的。最大长度为 4000。效率不及固定长度的char类型。英文占用一个字节，中文占用多字节，所以，中文跟中文占用空间不一致。
nvarchar2, 在 varchar2 基础上加入了字符集支持。
</p>

<p>
nvarchar2中，长度表示的是字符个数。
</p>

<pre class="example">
create table demo (a char(100), b varchar2(100), c nvarchar2(100));
insert into demo values ('a', 'a', 'a');
insert into demo values ('你', '你', '你');
select lengthb(a), lengthb(b), lengthb(c) from demo;
create table s4 (c varchar2(4 char));    -- char 是代表字符个数，是一个单位符号。这个语句创建的表格，只有一个字段， 是 varchar2 类型，可以填充 4 个字符（注意，不是字节）。
create table s4 (c varchar2(4 byte));    -- byte 是跟上面语句一样的单位符号，代表的是字节。这是 varchar2 的默认单位。这个语句创建的表格，只有一个字段，是 varchar2 类型，可以填充 4 个字节（注意，不是字符）。
</pre>
</div>
</li>

<li><a id="sec-5-3-1-4" name="sec-5-3-1-4"></a>long 类型<br ><div class="outline-text-5" id="text-5-3-1-4">
<p>
用来存储大容量数据的，最大是 2GB。已弃用，建议使用 LOB 字段代替。
</p>
</div>
</li></ul>
</div>


<div id="outline-container-sec-5-3-2" class="outline-4">
<h4 id="sec-5-3-2">数字类型</h4>
<div class="outline-text-4" id="text-5-3-2">
</div><ul class="org-ul"><li><a id="sec-5-3-2-1" name="sec-5-3-2-1"></a>NUMBER 类型<br ><div class="outline-text-5" id="text-5-3-2-1">
<p>
定义语法为：
</p>
<pre class="example">
COLUMN number[(precision, scale)]
</pre>
<p>
默认的长度是38。
</p>

<p>
如果不带参数，精度和小数的位数是根据填充的数字自动判定的。
</p>
<pre class="example">
create table s5 (c number);
</pre>
<p>
如果 scale 为空，那么默认， scale 为 0。小数点后被截断的数位，采取的是四舍五入制。
</p>
<pre class="example">
create table s7 (c number(5));
insert into s7 values (9.2222);   -- 插入的是 9
insert into s7 values (9.7777);   -- 插入的是 10
</pre>
<p>
如果 precision 为空，那么，确定小数点位数为 scale，precision 自动判定。
</p>
<pre class="example">
create table s8 (c number(*, 2));
insert into s8 values (6.23236);
</pre>
<p>
两个参数都具备的情况：
</p>
<pre class="example">
create table demo (a number(4, 2));
insert into demo values (987.1);  -- 值大于为此列指定的允许精度
insert into demo values (7.101);  -- 实际上插入的是 7.10
</pre>
<p>
两个参数，第一个代表精度，第二个代表小数位数。
</p>

<p>
还有两个子类型 int/float
</p>
<pre class="example">
create table s9 (c int);
insert into s9 values (22.22);
</pre>
</div>
</li></ul>
</div>

<div id="outline-container-sec-5-3-3" class="outline-4">
<h4 id="sec-5-3-3">时间类型</h4>
<div class="outline-text-4" id="text-5-3-3">
</div><ul class="org-ul"><li><a id="sec-5-3-3-1" name="sec-5-3-3-1"></a>DATE 数据类型<br ><div class="outline-text-5" id="text-5-3-3-1">
<p>
显示的是年月日。
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #8D8D84; font-style: italic;">-- &#26597;&#30475;&#24403;&#22825;&#30340;&#26085;&#26399;</span>
<span style="color: #0000FF;">select</span> sysdate <span style="color: #0000FF;">from</span> dual;

<span style="color: #8D8D84; font-style: italic;">-- &#20462;&#25913;&#24403;&#21069;&#26085;&#26399;&#26174;&#31034;&#30340;&#26684;&#24335;</span>
<span style="color: #0000FF;">alter</span> <span style="color: #0000FF;">session</span> <span style="color: #0000FF;">set</span> nls_date_format=<span style="color: #008000;">'yyyy.mm.dd'</span>;

<span style="color: #8D8D84; font-style: italic;">-- &#24212;&#29992;&#31034;&#20363;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">d1</span> <span style="color: #707183;">(</span>birth <span style="color: #6434A3;">date</span><span style="color: #707183;">)</span>;
<span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">into</span> d1 <span style="color: #0000FF;">values</span> <span style="color: #707183;">(</span>sysdate<span style="color: #707183;">)</span>;
<span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">into</span> d1 <span style="color: #0000FF;">values</span> <span style="color: #707183;">(</span>sysdate - 1<span style="color: #707183;">)</span>;             <span style="color: #8D8D84; font-style: italic;">-- &#21487;&#20197;&#36827;&#34892;&#31616;&#21333;&#36816;&#31639;&#65292;&#40664;&#35748;&#21333;&#20301;&#26159;&#8220;&#22825;&#8221;</span>
<span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">into</span> d1 <span style="color: #0000FF;">values</span> <span style="color: #707183;">(</span>to_date<span style="color: #7388D6;">(</span><span style="color: #008000;">'20120701'</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>;     <span style="color: #8D8D84; font-style: italic;">-- &#29992; to_date &#20989;&#25968;&#23545;&#23383;&#31526;&#20018;&#36827;&#34892;&#36716;&#25442;&#12290;&#21487;&#20197;&#24102;&#20004;&#20010;&#21442;&#25968;&#65292;&#31532;&#19968;&#20010;&#26159;&#24517;&#39035;&#30340;&#12290;&#22914;&#26524;&#31532;&#20108;&#20010;&#21442;&#25968;&#34987;&#24573;&#30053;&#65292;&#37027;&#20040; oracle &#20250;&#26681;&#25454; yyyy/mm/dd &#30340;&#39034;&#24207;&#23581;&#35797;&#23545;&#26085;&#26399;&#36827;&#34892;&#26684;&#24335;&#21270;&#12290;</span>
<span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">into</span> d1 <span style="color: #0000FF;">values</span> <span style="color: #707183;">(</span>to_date<span style="color: #7388D6;">(</span><span style="color: #008000;">'2012/07/01'</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>;
<span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">into</span> d1 <span style="color: #0000FF;">values</span> <span style="color: #707183;">(</span>to_date<span style="color: #7388D6;">(</span><span style="color: #008000;">'2012=07=01'</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>;

<span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">into</span> d1 <span style="color: #0000FF;">values</span> <span style="color: #707183;">(</span>to_date<span style="color: #7388D6;">(</span><span style="color: #008000;">'01.07.2012'</span>, <span style="color: #008000;">'dd.mm.yyyy'</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>;   <span style="color: #8D8D84; font-style: italic;">-- &#20004;&#20010;&#21442;&#25968;&#37117;&#26159;&#23383;&#31526;&#20018;&#65292;&#38656;&#35201;&#29992;&#21333;&#24341;&#21495;&#24341;&#36215;&#26469;&#12290;</span>

<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">s1</span> <span style="color: #0000FF;">values</span> <span style="color: #707183;">(</span>birth varchar2<span style="color: #7388D6;">(</span>20<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>;
<span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">into</span> s1 <span style="color: #0000FF;">values</span> <span style="color: #707183;">(</span>to_char<span style="color: #7388D6;">(</span>sysdate, <span style="color: #008000;">'yyyy-mm-dd'</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>;        <span style="color: #8D8D84; font-style: italic;">-- to_char &#26159;&#25226;&#20854;&#20182;&#30340;&#31867;&#22411;&#36716;&#25442;&#20026; char &#31867;&#22411;</span>
</pre>
</div>
</div>
</li>

<li><a id="sec-5-3-3-2" name="sec-5-3-3-2"></a>TIMESTAMP 数据类型<br ><div class="outline-text-5" id="text-5-3-3-2">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #8D8D84; font-style: italic;">-- &#36820;&#22238;&#30340;&#26159; timestamp with timezone &#31867;&#22411;&#65292;&#21253;&#21547;&#24180;&#26376;&#26085;&#26102;&#20998;&#31186;&#24494;&#22937;&#27627;&#31186;&#65292;&#19978;&#21320;&#19979;&#21320;&#65292;&#26102;&#21306;</span>
<span style="color: #8D8D84; font-style: italic;">-- &#22312;&#19968;&#33324;&#19994;&#21153;&#31995;&#32479;&#20013;&#65292;&#26102;&#38388;&#22522;&#26412;&#19978;&#29992;&#30340;&#37117;&#26159; timestamp &#31867;&#22411;</span>
<span style="color: #8D8D84; font-style: italic;">-- &#21487;&#20197;&#29992; nls_timestamp_format &#23450;&#21046;&#26174;&#31034;&#26041;&#24335;</span>
<span style="color: #0000FF;">select</span> systimestamp <span style="color: #0000FF;">from</span> dual;;
</pre>
</div>
</div>
</li></ul>
</div>


<div id="outline-container-sec-5-3-4" class="outline-4">
<h4 id="sec-5-3-4">RAW 类型</h4>
<div class="outline-text-4" id="text-5-3-4">
<p>
主要用来处理二进制的。
</p>

<p>
分为
</p>
</div>
<ul class="org-ul"><li><a id="sec-5-3-4-1" name="sec-5-3-4-1"></a>RAW<br ><div class="outline-text-5" id="text-5-3-4-1">
<p>
默认占用空间为 2kb
</p>
</div>
</li>

<li><a id="sec-5-3-4-2" name="sec-5-3-4-2"></a>Long RAW<br ><div class="outline-text-5" id="text-5-3-4-2">
<p>
不建议使用，跟 long 类型有相同的缺点。
</p>
</div>
</li></ul>
</div>

<div id="outline-container-sec-5-3-5" class="outline-4">
<h4 id="sec-5-3-5">LOB类型(large Object)</h4>
<div class="outline-text-4" id="text-5-3-5">
</div><ul class="org-ul"><li><a id="sec-5-3-5-1" name="sec-5-3-5-1"></a>CLOB 类型<br ><div class="outline-text-5" id="text-5-3-5-1">
<p>
是存储字符的大对象类型。
</p>
<pre class="example">
create table lobdemo1 (c clob);  -- 创建一个具备 blob 字段的表
insert into lobdemo1 values ('ssss');
insert into lobdemo1 values (22222222222222222);
insert into lobdemo1 values (null);
insert into lobdemo1 values (empty_clob());   -- 插入的不是空值
</pre>
</div>
</li>

<li><a id="sec-5-3-5-2" name="sec-5-3-5-2"></a>BLOB 类型<br ><div class="outline-text-5" id="text-5-3-5-2">
<p>
是存储二进制数据的大对象类型。主要的用处是存储图形，音频，视频等。
</p>

<p>
oracle 提供了dbms_lob 包，对 lob 字段进行操作。
</p>
</div>
</li>

<li><a id="sec-5-3-5-3" name="sec-5-3-5-3"></a>BFILE 类型<br ><div class="outline-text-5" id="text-5-3-5-3">
<p>
也是存储二进制。是以外部文件的形式进行存储的。
</p>
</div>
</li>

<li><a id="sec-5-3-5-4" name="sec-5-3-5-4"></a>XMLType 类型<br ><div class="outline-text-5" id="text-5-3-5-4">
<p>
主要是为了处理 xml 文档的。
</p>
</div>
</li></ul>
</div>


<div id="outline-container-sec-5-3-6" class="outline-4">
<h4 id="sec-5-3-6">ROWID/ROWNUM</h4>
<div class="outline-text-4" id="text-5-3-6">
</div><ul class="org-ul"><li><a id="sec-5-3-6-1" name="sec-5-3-6-1"></a>rowid<br ><div class="outline-text-5" id="text-5-3-6-1">
<p>
rowid 是 oracle 中的伪列。可以通过下面语句显示:
</p>
<pre class="example">
select d.rowid, d.* from dept d
</pre>
<p>
它是唯一的，不可变的，固定长度的。
</p>

<p>
它是数据存储物理地址的一种映射。一共有18位，前6位表示对象id，后3位表示fno，后6位表示块编号，最后3位表示行编号。
所以，通过rowid可以最快速度地定位到数据所在的位置。
</p>

<p>
rowid 是 oracle 特有的。
</p>

<p>
不建议使用 rowid 作为表的主键。迁移的需求，有改变的风险。
</p>
</div>
</li>
