oracle.org
**** rownum
列出每一行数据的行数，从1开始，自然增长。

#+BEGIN_SRC sql
-- 基本用法
select rownum, d.* from dept;
select rownum, d.* from dept d where rownum < 3;     -- 显示前两条
select * from (select rownum rn, d.* from dept d) t where t.rn = 3;   -- 只显示第三条

select * from (select * from emp order by sal desc) where rownum<=3;  -- 显示 emp 表中工资前三位的雇员信息。


#+END_SRC


*** NULL
它是 Oracle 中非常特殊的一种类型。它表示不确定，表示没有值。并且它能转化成所有的类型。
向数据库中插入空字符串时，oracle 会把它自动转化为 null 类型。所以，在查询空字符的时候：
: select * from n3 where s = '';
上面的语句是非法，不合适的。应该这样查：
: select * from n3 where s is null;
: select * from n3 where s is not null;
创建表的时候，为了约束插入的数据不能为空，应该在字段的后面写上 not null 约束。
: create table n5 (s varchar2(20) not null);
跟 null 做任何的运算，结果仍然是 null.
: select null + '' from dual;



** 运算符
**** 算术运算符
加/减/乘/除
**** 连接运算符
是用来连接字符串的。跟java中的 + 是一致的。
: select 'abc' || ' bcd ' as 连接后的结果 from dual;
: select d.dname || ' 部门' from dept d;

**** 关系运算符
见课本
**** 比较运算符
IS NULL / Like / Between / In / Exsist.
#+BEGIN_SRC sql


-- 判断 null 值
select * from n5 where s is null;
select * from n5 where s is not null;

-- like 模糊查询。慎用，有可能会导致全表扫描，效率低。
select username from dba_users where username like 'VI_';
select username from dba_users where username like 'SC%';
select username from dba_users where username like '%SC%';

-- in，是 where x = a or x = b or x = c 的一种缩写。下面两条是等价的。
select * from emp where empno in (700, 800, 900);
select * from emp where empno = 700 or empno = 800 or empno = 900;
-- in 后面跟的不一定是逗号分隔的单项，也可能是一个完整的查询语句。
-- 下面两条结果是一致的
-- 这种 in 慎用
select * from emp where deptno in (select deptno from dept where dname = 'SALES');
select a.* from emp a,dept d where a.deptno =d.deptno and d.dname='SALES';


-- between...and
select * from emp where empno between 7800 and 9000;

#+END_SRC

**** 逻辑运算符
and / or / not

[[http://www.cnblogs.com/nick-huang/p/4027038.html][not 的优先级 > and 的优先级 > or 的优先级]]

**** 集合操作符
Union/UnionAll/Intersect/Minus
#+BEGIN_SRC sql

create table depd as select * from dept where rownum < 2;
insert into depd values (99, '外卖部', '珠海');
insert into depd values (98, '小吃部', '斗门');

select * from depd
union
select * from dept;

select * from depd
union all
select * from dept;

select * from depd
intersect
select * from dept;

select * from depd
minus
select * from dept;


#+END_SRC





** 函数
*** 数值函数
- abs 求绝对值
  : select abs(-22) from dual;
- round 四舍五入
  : SELECT ROUND(123415.193) "Round" FROM DUAL;
  : SELECT ROUND(123415.193, 2) "Round" FROM DUAL;
  : SELECT ROUND(123415.193, -1) "Round" FROM DUAL;
- power 求幂
- sqrt 开根号
- trunc 保留小数有效数字

