oracle.html



<li><a id="sec-5-3-6-2" name="sec-5-3-6-2"></a>rownum<br ><div class="outline-text-5" id="text-5-3-6-2">
<p>
列出每一行数据的行数，从1开始，自然增长。
</p>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #8D8D84; font-style: italic;">-- &#22522;&#26412;&#29992;&#27861;</span>
<span style="color: #0000FF;">select</span> rownum, d.* <span style="color: #0000FF;">from</span> dept;
<span style="color: #0000FF;">select</span> rownum, d.* <span style="color: #0000FF;">from</span> dept d <span style="color: #0000FF;">where</span> rownum &lt; 3;     <span style="color: #8D8D84; font-style: italic;">-- &#26174;&#31034;&#21069;&#20004;&#26465;</span>
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> <span style="color: #707183;">(</span><span style="color: #0000FF;">select</span> rownum rn, d.* <span style="color: #0000FF;">from</span> dept d<span style="color: #707183;">)</span> t <span style="color: #0000FF;">where</span> t.rn = 3;   <span style="color: #8D8D84; font-style: italic;">-- &#21482;&#26174;&#31034;&#31532;&#19977;&#26465;</span>

<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> <span style="color: #707183;">(</span><span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> emp <span style="color: #0000FF;">order</span> <span style="color: #0000FF;">by</span> sal <span style="color: #0000FF;">desc</span><span style="color: #707183;">)</span> <span style="color: #0000FF;">where</span> rownum&lt;=3;  <span style="color: #8D8D84; font-style: italic;">-- &#26174;&#31034; emp &#34920;&#20013;&#24037;&#36164;&#21069;&#19977;&#20301;&#30340;&#38599;&#21592;&#20449;&#24687;&#12290;</span>
</pre>
</div>
</div>
</li></ul>
</div>


<div id="outline-container-sec-5-3-7" class="outline-4">
<h4 id="sec-5-3-7">NULL</h4>
<div class="outline-text-4" id="text-5-3-7">
<p>
它是 Oracle 中非常特殊的一种类型。它表示不确定，表示没有值。并且它能转化成所有的类型。
向数据库中插入空字符串时，oracle 会把它自动转化为 null 类型。所以，在查询空字符的时候：
</p>
<pre class="example">
select * from n3 where s = '';
</pre>
<p>
上面的语句是非法，不合适的。应该这样查：
</p>
<pre class="example">
select * from n3 where s is null;
select * from n3 where s is not null;
</pre>
<p>
创建表的时候，为了约束插入的数据不能为空，应该在字段的后面写上 not null 约束。
</p>
<pre class="example">
create table n5 (s varchar2(20) not null);
</pre>
<p>
跟 null 做任何的运算，结果仍然是 null.
</p>
<pre class="example">
select null + '' from dual;
</pre>
</div>
</div>
</div>



<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4">运算符</h3>
<div class="outline-text-3" id="text-5-4">
</div><ul class="org-ul"><li><a id="sec-5-4-0-1" name="sec-5-4-0-1"></a>算术运算符<br ><div class="outline-text-5" id="text-5-4-0-1">
<p>
加/减/乘/除
</p>
</div>
</li>
<li><a id="sec-5-4-0-2" name="sec-5-4-0-2"></a>连接运算符<br ><div class="outline-text-5" id="text-5-4-0-2">
<p>
是用来连接字符串的。跟java中的 + 是一致的。
</p>
<pre class="example">
select 'abc' || ' bcd ' as 连接后的结果 from dual;
select d.dname || ' 部门' from dept d;
</pre>
</div>
</li>

<li><a id="sec-5-4-0-3" name="sec-5-4-0-3"></a>关系运算符<br ><div class="outline-text-5" id="text-5-4-0-3">
<p>
见课本
</p>
</div>
</li>
<li><a id="sec-5-4-0-4" name="sec-5-4-0-4"></a>比较运算符<br ><div class="outline-text-5" id="text-5-4-0-4">
<p>
IS NULL / Like / Between / In / Exsist.
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #8D8D84; font-style: italic;">-- &#21028;&#26029; null &#20540;</span>
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> n5 <span style="color: #0000FF;">where</span> s <span style="color: #0000FF;">is</span> <span style="color: #0000FF;">null</span>;
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> n5 <span style="color: #0000FF;">where</span> s <span style="color: #0000FF;">is</span> <span style="color: #0000FF;">not</span> <span style="color: #0000FF;">null</span>;

<span style="color: #8D8D84; font-style: italic;">-- like &#27169;&#31946;&#26597;&#35810;&#12290;&#24910;&#29992;&#65292;&#26377;&#21487;&#33021;&#20250;&#23548;&#33268;&#20840;&#34920;&#25195;&#25551;&#65292;&#25928;&#29575;&#20302;&#12290;</span>
<span style="color: #0000FF;">select</span> username <span style="color: #0000FF;">from</span> dba_users <span style="color: #0000FF;">where</span> username <span style="color: #0000FF;">like</span> <span style="color: #008000;">'VI_'</span>;
<span style="color: #0000FF;">select</span> username <span style="color: #0000FF;">from</span> dba_users <span style="color: #0000FF;">where</span> username <span style="color: #0000FF;">like</span> <span style="color: #008000;">'SC%'</span>;
<span style="color: #0000FF;">select</span> username <span style="color: #0000FF;">from</span> dba_users <span style="color: #0000FF;">where</span> username <span style="color: #0000FF;">like</span> <span style="color: #008000;">'%SC%'</span>;

<span style="color: #8D8D84; font-style: italic;">-- in&#65292;&#26159; where x = a or x = b or x = c &#30340;&#19968;&#31181;&#32553;&#20889;&#12290;&#19979;&#38754;&#20004;&#26465;&#26159;&#31561;&#20215;&#30340;&#12290;</span>
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> emp <span style="color: #0000FF;">where</span> empno <span style="color: #0000FF;">in</span> <span style="color: #707183;">(</span>700, 800, 900<span style="color: #707183;">)</span>;
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> emp <span style="color: #0000FF;">where</span> empno = 700 <span style="color: #0000FF;">or</span> empno = 800 <span style="color: #0000FF;">or</span> empno = 900;
<span style="color: #8D8D84; font-style: italic;">-- in &#21518;&#38754;&#36319;&#30340;&#19981;&#19968;&#23450;&#26159;&#36887;&#21495;&#20998;&#38548;&#30340;&#21333;&#39033;&#65292;&#20063;&#21487;&#33021;&#26159;&#19968;&#20010;&#23436;&#25972;&#30340;&#26597;&#35810;&#35821;&#21477;&#12290;</span>
<span style="color: #8D8D84; font-style: italic;">-- &#19979;&#38754;&#20004;&#26465;&#32467;&#26524;&#26159;&#19968;&#33268;&#30340;</span>
<span style="color: #8D8D84; font-style: italic;">-- &#36825;&#31181; in &#24910;&#29992;</span>
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> emp <span style="color: #0000FF;">where</span> deptno <span style="color: #0000FF;">in</span> <span style="color: #707183;">(</span><span style="color: #0000FF;">select</span> deptno <span style="color: #0000FF;">from</span> dept <span style="color: #0000FF;">where</span> dname = <span style="color: #008000;">'SALES'</span><span style="color: #707183;">)</span>;
<span style="color: #0000FF;">select</span> a.* <span style="color: #0000FF;">from</span> emp a,dept d <span style="color: #0000FF;">where</span> a.deptno =d.deptno <span style="color: #0000FF;">and</span> d.dname=<span style="color: #008000;">'SALES'</span>;


<span style="color: #8D8D84; font-style: italic;">-- between...and</span>
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> emp <span style="color: #0000FF;">where</span> empno <span style="color: #0000FF;">between</span> 7800 <span style="color: #0000FF;">and</span> 9000;
</pre>
</div>
</div>
</li>

<li><a id="sec-5-4-0-5" name="sec-5-4-0-5"></a>逻辑运算符<br ><div class="outline-text-5" id="text-5-4-0-5">
<p>
and / or / not
</p>

<p>
<a href="http://www.cnblogs.com/nick-huang/p/4027038.html">not 的优先级 &gt; and 的优先级 &gt; or 的优先级</a>
</p>
</div>
</li>

<li><a id="sec-5-4-0-6" name="sec-5-4-0-6"></a>集合操作符<br ><div class="outline-text-5" id="text-5-4-0-6">
<p>
Union/UnionAll/Intersect/Minus
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">depd</span> <span style="color: #0000FF;">as</span> <span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> dept <span style="color: #0000FF;">where</span> rownum &lt; 2;
<span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">into</span> depd <span style="color: #0000FF;">values</span> <span style="color: #707183;">(</span>99, <span style="color: #008000;">'&#22806;&#21334;&#37096;'</span>, <span style="color: #008000;">'&#29664;&#28023;'</span><span style="color: #707183;">)</span>;
<span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">into</span> depd <span style="color: #0000FF;">values</span> <span style="color: #707183;">(</span>98, <span style="color: #008000;">'&#23567;&#21507;&#37096;'</span>, <span style="color: #008000;">'&#26007;&#38376;'</span><span style="color: #707183;">)</span>;

<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> depd
<span style="color: #0000FF;">union</span>
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> dept;

<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> depd
<span style="color: #0000FF;">union</span> <span style="color: #0000FF;">all</span>
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> dept;

<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> depd
<span style="color: #0000FF;">intersect</span>
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> dept;

<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> depd
minus
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> dept;
</pre>
</div>
</div>
</li></ul>
</div>





<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5">函数</h3>
<div class="outline-text-3" id="text-5-5">
</div><div id="outline-container-sec-5-5-1" class="outline-4">
<h4 id="sec-5-5-1">数值函数</h4>
<div class="outline-text-4" id="text-5-5-1">
<ul class="org-ul">
<li>abs 求绝对值
<pre class="example">
select abs(-22) from dual;
</pre>
</li>
<li>round 四舍五入
<pre class="example">
SELECT ROUND(123415.193) "Round" FROM DUAL;
SELECT ROUND(123415.193, 2) "Round" FROM DUAL;
SELECT ROUND(123415.193, -1) "Round" FROM DUAL;
</pre>
</li>
<li>power 求幂
</li>
<li>sqrt 开根号
</li>
<li>trunc 保留小数有效数字
</li>
</ul>
</div>
</div>
