oracle.org
*** 字符函数
- lower 转化为小写
- upper 转换为大写
- trim 去除某些字符
  : select trim('x' from 'xsxdfsxxxx') from dual;
  : select trim(both 'x' from 'xsxdfsxxxx') from dual; -- 去除开始的 x 字符
  : select trim(leading 'x' from 'xsxdfsxxxx') from dual; -- 去除开始的 x 字符
  : select trim(trailing 'x' from 'xsxdfsxxxx') from dual; -- 去除结尾的 x 字符
- ltrim / rtrim 左右去除字符
  : SELECT RTRIM('BROWNING: ./=./=./=./=./=.=',      '/=.') FROM DUAL;  -- 第二个参数包含了要砍掉的所有字符的集合
  : SELECT RTRIM('BROWNING: ./=./=./=./=./=.=     ') FROM DUAL;         -- 如果第二个参数为空，那么默认 trim 掉的是空格
- lpad / rpad 填充字符
  : SELECT LPAD('Page 1',15,'*.') "LPAD example" FROM DUAL;  -- 第二个参数代表了返回值的总长度，最后一个参数如果去掉的话，那么默认填充的是空格
- concate(||) 连接字符
- REGEXP_REPLACE 正则替换
- replace 常规替换
  : SELECT REPLACE('JACK and JUE','J','BL') "Changes" FROM DUAL; -- 一共 3 个参数，第一个是源字符串，第二个是要替换的字符串，第三个是要替换为的字符串。
  : SELECT REPLACE('JACK and JUE','J') "Changes" FROM DUAL;      -- 如果第三个参数为空的话，默认把第二个字符串替换为空。
- SUBSTR 
  : SELECT SUBSTR('ABCDEFG',3,4) "Substring" FROM DUAL;   -- 第一参数表示要处理的源字符串，第二个参数表示子串起始的位置，第三个参数是可选的，表示子串的长度
  : SELECT SUBSTR('ABCDEFG',3) "Substring" FROM DUAL;     -- 如果不适用第三个参数，那么子串默认到源字符串的结尾。
  : SELECT SUBSTR('ABCDEFG',-2,1) "Substring" FROM DUAL;  -- 如果第二个参数是负数，表示从结尾往回回溯。
- TRANSLATE 替换相应的字符
  : select translate('hehehello,haha', 'o,h', '0!') from dual;  -- 三个参数，第一个源字符串，第二个和第三个参数里面的字符是按顺序一一对应的。这个函数就是按照后面两个参数内的字符，进行顺序替换。

- ASCII 显示字符ascii码
  : select ascii('A') from dual;   -- 结果是 65
  : select * from scott.emp e where ascii(substr(e.ename, 1, 1)) = 67;  -- 显示 emp 中所有名字以 C 开头的员工。
- LENGTH/LENGTHB 表示长度。

*** 时间函数
- sysdate/systimestamp systimestamp 显示的时间时区是从操作系统中获取的。的返回值是 TIMESTAMP WITH TIME ZONE 类型。
- current_date/current_timestamp 返回的是当前会话时区的时间。跟 sessiontimezone 有关系的。可以通过 alter session set time_zone='-5:0' 来修改会话的时区。
- localtimestamp 显示当前时间，但是不带时区信息
- add_months 增加日期
  : select add_months(sysdate, 5) from dual;
  : select add_months(sysdate, -5) from dual;   -- 如果第二个参数是负数，相应的是减少几个月
- LAST_DAY 一个月的最后一天
  : select last_day(sysdate) from dual;
- MONTHS_BETWEEN 计算相差的月数
  : select months_between(sysdate, to_date('19981105')) from dual;  -- 周强从出生到现在经历了多少个月。如果把两个参数换过来，得到的是相应的负数。
  : select (sysdate - to_date('19981105'))/30 from dual;  -- 这样写是错误的，因为，一个月未必是30天
- next_day 计算日期之后的第一个相应工作日日期
  : SELECT NEXT_DAY(sysdate, 1) "NEXT DAY" from dual;    -- 如果是数字，那么只能是1-7。相应1表示星期日，2代表星期一...
  : SELECT NEXT_DAY(to_date('20111111', '星期六') "NEXT DAY" from dual;    -- 第二个参数必须跟 nls_date_language 指定的字符集相关联
- round(date) 最接近的日期
  : select round(sysdate - 200, 'YEAR') from dual;  -- 跟现在最接近的年份
  : select round(sysdate, 'MONTH') from dual;       -- 跟今天最接近的月份
- trunc(date) 截取日期
  : SELECT TRUNC(TO_DATE('2010-09-20'), 'MONTH') "New Year" FROM DUAL;
- dbtimezone 显示时区
- EXTRACT(datetime) 分解时间
  #+BEGIN_SRC sql
  SELECT EXTRACT(year FROM systimestamp) "年",
    EXTRACT(month FROM systimestamp) "月",
    EXTRACT(day FROM systimestamp) "日" from dual;  -- 默认采取的是 0 时区，即 unk 时区的值.

  select extract(hour from timestamp '1998-03-03 9:10:11') from dual;  -- 返回的是 9
  #+END_SRC


*** 比较函数
- GREATEST 取最大值
  : select greatest(2, 3, 4) from dual;  -- 结果 4
- LEAST 取最小值
  : select least(2, 3, 4) from dual;     -- 结果 2

*** 转换函数
- to_char
- to_date
- to_number

*** 其他函数
- nvl(e1, e2) 判定e1是否为空，如果为空那么替换为指定的e2.
  : select nvl(null, 2) from dual;
  : select e.ename, nvl(e.comm, 0) from scott.emp e where comm is null;
- nvl2(e1, e2, e3)
  : select e.ename, nvl2(e.comm, e.comm/10, 0) "佣金/10"  from scott.emp e; -- 三个参数。判定第一个是否为 null，如果不是，返回第二个参数，如果是，返回第三个参数。
- nullif
  : select nullif(100, 50*2) n1, nullif(100, 33*3) n2 from dual;
- decode 大家自我修炼，继续深入。因为它很强大，很厉害，很牛x。我们要掌握它，熟练使用它，让它成为我们的好朋友。
  : select m.name, decode(m.sex, 2, '男', 1, '女', '未知') from mates m;

*** 分组函数
- avg
- max
- sum
- count(*|1)
  : select count(*) from scott.emp;
  : select count(1) from scott.emp;
  : select count(distinct deptno) from scott.emp;

*** 分析函数
- row_number
- rank
- dense_rank




** 自定义函数
语法:
#+BEGIN_SRC sql
create [or replace] function function_name [(参数 参数类型 := 默认值 [, 其他参数])] return 参数类型
  as|is
    定义的变量
  begin
    逻辑
    return xxx;
  end;
#+END_SRC

示例:
#+BEGIN_SRC sql
-- 随机抽取 1-n 之间的一个整数
create or replace function hehe (n number := 10) return number
is
  s number;
begin
  s = round(dbms_random.value(0.5, n + 0.5));
  return s;
end hehe;
/


-- 你要还要多久毕业？示例。
create or replace function howsoon (d date := to_date('20170101', 'yyyymmdd')) return number
is
begin
  return to_number(d - sysdate);
end;
/


#+END_SRC

