oracle.html

<div id="outline-container-sec-5-5-2" class="outline-4">
<h4 id="sec-5-5-2">字符函数</h4>
<div class="outline-text-4" id="text-5-5-2">
<ul class="org-ul">
<li>lower 转化为小写
</li>
<li>upper 转换为大写
</li>
<li>trim 去除某些字符
<pre class="example">
select trim('x' from 'xsxdfsxxxx') from dual;
select trim(both 'x' from 'xsxdfsxxxx') from dual; -- 去除开始的 x 字符
select trim(leading 'x' from 'xsxdfsxxxx') from dual; -- 去除开始的 x 字符
select trim(trailing 'x' from 'xsxdfsxxxx') from dual; -- 去除结尾的 x 字符
</pre>
</li>
<li>ltrim / rtrim 左右去除字符
<pre class="example">
SELECT RTRIM('BROWNING: ./=./=./=./=./=.=',      '/=.') FROM DUAL;  -- 第二个参数包含了要砍掉的所有字符的集合
SELECT RTRIM('BROWNING: ./=./=./=./=./=.=     ') FROM DUAL;         -- 如果第二个参数为空，那么默认 trim 掉的是空格
</pre>
</li>
<li>lpad / rpad 填充字符
<pre class="example">
SELECT LPAD('Page 1',15,'*.') "LPAD example" FROM DUAL;  -- 第二个参数代表了返回值的总长度，最后一个参数如果去掉的话，那么默认填充的是空格
</pre>
</li>
<li>concate(||) 连接字符
</li>
<li>REGEXP_REPLACE 正则替换
</li>
<li>replace 常规替换
<pre class="example">
SELECT REPLACE('JACK and JUE','J','BL') "Changes" FROM DUAL; -- 一共 3 个参数，第一个是源字符串，第二个是要替换的字符串，第三个是要替换为的字符串。
SELECT REPLACE('JACK and JUE','J') "Changes" FROM DUAL;      -- 如果第三个参数为空的话，默认把第二个字符串替换为空。
</pre>
</li>
<li>SUBSTR 
<pre class="example">
SELECT SUBSTR('ABCDEFG',3,4) "Substring" FROM DUAL;   -- 第一参数表示要处理的源字符串，第二个参数表示子串起始的位置，第三个参数是可选的，表示子串的长度
SELECT SUBSTR('ABCDEFG',3) "Substring" FROM DUAL;     -- 如果不适用第三个参数，那么子串默认到源字符串的结尾。
SELECT SUBSTR('ABCDEFG',-2,1) "Substring" FROM DUAL;  -- 如果第二个参数是负数，表示从结尾往回回溯。
</pre>
</li>
<li>TRANSLATE 替换相应的字符
<pre class="example">
select translate('hehehello,haha', 'o,h', '0!') from dual;  -- 三个参数，第一个源字符串，第二个和第三个参数里面的字符是按顺序一一对应的。这个函数就是按照后面两个参数内的字符，进行顺序替换。
</pre>
</li>

<li>ASCII 显示字符ascii码
<pre class="example">
select ascii('A') from dual;   -- 结果是 65
select * from scott.emp e where ascii(substr(e.ename, 1, 1)) = 67;  -- 显示 emp 中所有名字以 C 开头的员工。
</pre>
</li>
<li>LENGTH/LENGTHB 表示长度。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5-5-3" class="outline-4">
<h4 id="sec-5-5-3">时间函数</h4>
<div class="outline-text-4" id="text-5-5-3">
<ul class="org-ul">
<li>sysdate/systimestamp systimestamp 显示的时间时区是从操作系统中获取的。的返回值是 TIMESTAMP WITH TIME ZONE 类型。
</li>
<li>current_date/current_timestamp 返回的是当前会话时区的时间。跟 sessiontimezone 有关系的。可以通过 alter session set time_zone='-5:0' 来修改会话的时区。
</li>
<li>localtimestamp 显示当前时间，但是不带时区信息
</li>
<li>add_months 增加日期
<pre class="example">
select add_months(sysdate, 5) from dual;
select add_months(sysdate, -5) from dual;   -- 如果第二个参数是负数，相应的是减少几个月
</pre>
</li>
<li>LAST_DAY 一个月的最后一天
<pre class="example">
select last_day(sysdate) from dual;
</pre>
</li>
<li>MONTHS_BETWEEN 计算相差的月数
<pre class="example">
select months_between(sysdate, to_date('19981105')) from dual;  -- 周强从出生到现在经历了多少个月。如果把两个参数换过来，得到的是相应的负数。
select (sysdate - to_date('19981105'))/30 from dual;  -- 这样写是错误的，因为，一个月未必是30天
</pre>
</li>
<li>next_day 计算日期之后的第一个相应工作日日期
<pre class="example">
SELECT NEXT_DAY(sysdate, 1) "NEXT DAY" from dual;    -- 如果是数字，那么只能是1-7。相应1表示星期日，2代表星期一...
SELECT NEXT_DAY(to_date('20111111', '星期六') "NEXT DAY" from dual;    -- 第二个参数必须跟 nls_date_language 指定的字符集相关联
</pre>
</li>
<li>round(date) 最接近的日期
<pre class="example">
select round(sysdate - 200, 'YEAR') from dual;  -- 跟现在最接近的年份
select round(sysdate, 'MONTH') from dual;       -- 跟今天最接近的月份
</pre>
</li>
<li>trunc(date) 截取日期
<pre class="example">
SELECT TRUNC(TO_DATE('2010-09-20'), 'MONTH') "New Year" FROM DUAL;
</pre>
</li>
<li>dbtimezone 显示时区
</li>
<li>EXTRACT(datetime) 分解时间
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #0000FF;">SELECT</span> <span style="color: #006FE0;">EXTRACT</span><span style="color: #707183;">(</span><span style="color: #0000FF;">year</span> <span style="color: #0000FF;">FROM</span> systimestamp<span style="color: #707183;">)</span> "&#24180;",
  <span style="color: #006FE0;">EXTRACT</span><span style="color: #707183;">(</span><span style="color: #0000FF;">month</span> <span style="color: #0000FF;">FROM</span> systimestamp<span style="color: #707183;">)</span> "&#26376;",
  <span style="color: #006FE0;">EXTRACT</span><span style="color: #707183;">(</span><span style="color: #0000FF;">day</span> <span style="color: #0000FF;">FROM</span> systimestamp<span style="color: #707183;">)</span> "&#26085;" <span style="color: #0000FF;">from</span> dual;  <span style="color: #8D8D84; font-style: italic;">-- &#40664;&#35748;&#37319;&#21462;&#30340;&#26159; 0 &#26102;&#21306;&#65292;&#21363; unk &#26102;&#21306;&#30340;&#20540;.</span>

<span style="color: #0000FF;">select</span> <span style="color: #006FE0;">extract</span><span style="color: #707183;">(</span><span style="color: #0000FF;">hour</span> <span style="color: #0000FF;">from</span> <span style="color: #6434A3;">timestamp</span> <span style="color: #008000;">'1998-03-03 9:10:11'</span><span style="color: #707183;">)</span> <span style="color: #0000FF;">from</span> dual;  <span style="color: #8D8D84; font-style: italic;">-- &#36820;&#22238;&#30340;&#26159; 9</span>
</pre>
</div>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-5-5-4" class="outline-4">
<h4 id="sec-5-5-4">比较函数</h4>
<div class="outline-text-4" id="text-5-5-4">
<ul class="org-ul">
<li>GREATEST 取最大值
<pre class="example">
select greatest(2, 3, 4) from dual;  -- 结果 4
</pre>
</li>
<li>LEAST 取最小值
<pre class="example">
select least(2, 3, 4) from dual;     -- 结果 2
</pre>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5-5-5" class="outline-4">
<h4 id="sec-5-5-5">转换函数</h4>
<div class="outline-text-4" id="text-5-5-5">
<ul class="org-ul">
<li>to_char
</li>
<li>to_date
</li>
<li>to_number
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5-5-6" class="outline-4">
<h4 id="sec-5-5-6">其他函数</h4>
<div class="outline-text-4" id="text-5-5-6">
<ul class="org-ul">
<li>nvl(e1, e2) 判定e1是否为空，如果为空那么替换为指定的e2.
<pre class="example">
select nvl(null, 2) from dual;
select e.ename, nvl(e.comm, 0) from scott.emp e where comm is null;
</pre>
</li>
<li>nvl2(e1, e2, e3)
<pre class="example">
select e.ename, nvl2(e.comm, e.comm/10, 0) "佣金/10"  from scott.emp e; -- 三个参数。判定第一个是否为 null，如果不是，返回第二个参数，如果是，返回第三个参数。
</pre>
</li>
<li>nullif
<pre class="example">
select nullif(100, 50*2) n1, nullif(100, 33*3) n2 from dual;
</pre>
</li>
<li>decode 大家自我修炼，继续深入。因为它很强大，很厉害，很牛x。我们要掌握它，熟练使用它，让它成为我们的好朋友。
<pre class="example">
select m.name, decode(m.sex, 2, '男', 1, '女', '未知') from mates m;
</pre>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5-5-7" class="outline-4">
<h4 id="sec-5-5-7">分组函数</h4>
<div class="outline-text-4" id="text-5-5-7">
<ul class="org-ul">
<li>avg
</li>
<li>max
</li>
<li>sum
</li>
<li>count(*|1)
<pre class="example">
select count(*) from scott.emp;
select count(1) from scott.emp;
select count(distinct deptno) from scott.emp;
</pre>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5-5-8" class="outline-4">
<h4 id="sec-5-5-8">分析函数</h4>
<div class="outline-text-4" id="text-5-5-8">
<ul class="org-ul">
<li>row_number
</li>
<li>rank
</li>
<li>dense_rank
</li>
</ul>
</div>
</div>
</div>




<div id="outline-container-sec-5-6" class="outline-3">
<h3 id="sec-5-6">自定义函数</h3>
<div class="outline-text-3" id="text-5-6">
<p>
语法:
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #0000FF;">create</span> <span style="color: #707183;">[</span><span style="color: #0000FF;">or</span> replace<span style="color: #707183;">]</span> <span style="color: #0000FF;">function</span> function_name <span style="color: #707183;">[</span><span style="color: #7388D6;">(</span>&#21442;&#25968; &#21442;&#25968;&#31867;&#22411; := &#40664;&#35748;&#20540; <span style="color: #909183;">[</span>, &#20854;&#20182;&#21442;&#25968;<span style="color: #909183;">]</span><span style="color: #7388D6;">)</span><span style="color: #707183;">]</span> <span style="color: #0000FF;">return</span> &#21442;&#25968;&#31867;&#22411;
  <span style="color: #0000FF;">as</span>|<span style="color: #0000FF;">is</span>
    &#23450;&#20041;&#30340;&#21464;&#37327;
  <span style="color: #0000FF;">begin</span>
    &#36923;&#36753;
    <span style="color: #0000FF;">return</span> xxx;
  <span style="color: #0000FF;">end</span>;
</pre>
</div>

<p>
示例:
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #8D8D84; font-style: italic;">-- &#38543;&#26426;&#25277;&#21462; 1-n &#20043;&#38388;&#30340;&#19968;&#20010;&#25972;&#25968;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">or</span> replace <span style="color: #0000FF;">function</span> <span style="color: #006699;">hehe</span> <span style="color: #707183;">(</span>n <span style="color: #0000FF;">number</span> := 10<span style="color: #707183;">)</span> <span style="color: #0000FF;">return</span> <span style="color: #0000FF;">number</span>
<span style="color: #0000FF;">is</span>
  s <span style="color: #0000FF;">number</span>;
<span style="color: #0000FF;">begin</span>
  s = round<span style="color: #707183;">(</span>dbms_random.<span style="color: #0000FF;">value</span><span style="color: #7388D6;">(</span>0.5, n + 0.5<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>;
  <span style="color: #0000FF;">return</span> s;
<span style="color: #0000FF;">end</span> hehe;
/


<span style="color: #8D8D84; font-style: italic;">-- &#20320;&#35201;&#36824;&#35201;&#22810;&#20037;&#27605;&#19994;&#65311;&#31034;&#20363;&#12290;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">or</span> replace <span style="color: #0000FF;">function</span> <span style="color: #006699;">howsoon</span> <span style="color: #707183;">(</span>d <span style="color: #6434A3;">date</span> := to_date<span style="color: #7388D6;">(</span><span style="color: #008000;">'20170101'</span>, <span style="color: #008000;">'yyyymmdd'</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span> <span style="color: #0000FF;">return</span> <span style="color: #0000FF;">number</span>
<span style="color: #0000FF;">is</span>
<span style="color: #0000FF;">begin</span>
  <span style="color: #0000FF;">return</span> to_number<span style="color: #707183;">(</span>d - sysdate<span style="color: #707183;">)</span>;
<span style="color: #0000FF;">end</span>;
/
</pre>
</div>
</div>
</div>
</section>
