oracle.org
* 同义词 (Synonymous)
#+BEGIN_SRC sql
-- 必须要拥有创建同义词的权限
grant create synonym to vip;

-- 基本的创建
create synonym s10 for sssssssss;                    -- 简化 sql 语句.
create or replace synonym e for scott.emp;           -- 省略 schema，隐藏细节，简化操作


-- 同义词的删除
drop synonym e;


-- 公用同义词的使用。一次创建，每个用户都可以使用。
grant create public synonym to vip;
create public synonym e for scott.emp;


-- 删除公用同义词
drop public synonym e;


-- DBA_XXX 等其实也是同义词，所以在调用的时候，不需要写 SYS.
select object_name, object_type from dba_objects where object_name = 'DBA_OBJECTS;'

#+END_SRC

有余力的同学也可以看一下 database link 的概念。

* 序列 (Sequence)
#+BEGIN_SRC sql
-- SQLServer 中自增字段的写法
create table test(id int primary key identity);
-- MySQL 中自增字段的写法
create table test(id int primary key auto_increment);


-- 创建一个序列语法
CREATE SEQUENCE 序列名字
  [start with 数字]     -- 初始数字
  [minvalue 数字]       -- 最小值
  [maxvalue 数字]       -- 最大值
  [increment by 数字]   -- 增量
  [cycle]               -- 是否要循环
  [cache 数字]          -- 是否缓存，即是否在内存中预先分配接下来要用到的数字
  [order | nooreder]    -- 排序
　

-- 最基本的创建。默认从1开始，增量为1
create sequence seq_001;

-- start with 的值表示初始，必须要大于等于 minvalue
-- 如果是 nocycle 模式，到达最大值继续执行会报错。否则，会循环。
-- 循环的起始数值是 minvalue 而不是 start with 的值。
create sequence seq_006 start with 3 minvalue -6 maxvalue 8 cycle nocache;

-- 修改
alter sequence increment by 8;
rename seq_006 to seq_666;

-- 删除序列
drop sequence seq_006;

-- 序列的使用
select 序列名字.nextval from dual;    -- 序列的下一个值，调用之后会自动增长，每次返回值不一定相同。
select 序列名字.currval from dual;    -- 返回序列的当前值，每次调用返回值是一致的。需要序列被初始化(nextval)之后才能使用，否则报错。

create table seqtab (id number primary key, name varchar2(20));
insert into seqtab values (seq_001.nextval, 'hello'); -- 这种写法虽然看起来麻烦，但是在开发中有其灵活性和通用性，是非常强大的。

-- 自动插入，需要配合触发器 (triggle) 使用。有兴趣、有余力的同学，请自己关注。其他人无视则可。

#+END_SRC

* 表的分区(Partition)
建议在下面两种情况下要对表进行分区:
1. 表的数据量超过 2G
2. 表里面存在大量的历史数据

表分区是为了达到分而治之的目的，是鸡蛋不能放在同一个篮子里的切实实践。首先能提高效率，再者可保障安全。

Oracle 里的基本分区有：
1. 范围分区(Range)
2. 列表分区(List)
3. 哈希分区(Hash)

另外可以对表的分区进行复合，建立子分区。 Oracle 11 之后添加了很多不同的复合形式，但常用的有两种：
1. 范围-哈希分区
2. 范围-列表分区

#+BEGIN_SRC sql

-- 查看当前用户下表的分区详情。
select table_name, partition_name from user_tab_partitions;
select table_name, partition_name, subpartition_name from user_tab_subpartitions;

-- 从分区中查询数据
select * from table_name partition (partition_name);

-- 复合分区中进行查询数据
select * from cxbe3 subpartition (p1_ps4);   -- 表示 p1 分区下的 ps4 子分区

#+END_SRC

