oracle.html

<section id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">同义词 (Synonymous)</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #8D8D84; font-style: italic;">-- &#24517;&#39035;&#35201;&#25317;&#26377;&#21019;&#24314;&#21516;&#20041;&#35789;&#30340;&#26435;&#38480;</span>
<span style="color: #0000FF;">grant</span> <span style="color: #0000FF;">create</span> synonym <span style="color: #0000FF;">to</span> vip;

<span style="color: #8D8D84; font-style: italic;">-- &#22522;&#26412;&#30340;&#21019;&#24314;</span>
<span style="color: #0000FF;">create</span> synonym s10 <span style="color: #0000FF;">for</span> sssssssss;                    <span style="color: #8D8D84; font-style: italic;">-- &#31616;&#21270; sql &#35821;&#21477;.</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">or</span> replace synonym e <span style="color: #0000FF;">for</span> scott.emp;           <span style="color: #8D8D84; font-style: italic;">-- &#30465;&#30053; schema&#65292;&#38544;&#34255;&#32454;&#33410;&#65292;&#31616;&#21270;&#25805;&#20316;</span>


<span style="color: #8D8D84; font-style: italic;">-- &#21516;&#20041;&#35789;&#30340;&#21024;&#38500;</span>
<span style="color: #0000FF;">drop</span> synonym e;


<span style="color: #8D8D84; font-style: italic;">-- &#20844;&#29992;&#21516;&#20041;&#35789;&#30340;&#20351;&#29992;&#12290;&#19968;&#27425;&#21019;&#24314;&#65292;&#27599;&#20010;&#29992;&#25143;&#37117;&#21487;&#20197;&#20351;&#29992;&#12290;</span>
<span style="color: #0000FF;">grant</span> <span style="color: #0000FF;">create</span> <span style="color: #0000FF;">public</span> synonym <span style="color: #0000FF;">to</span> vip;
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">public</span> synonym e <span style="color: #0000FF;">for</span> scott.emp;


<span style="color: #8D8D84; font-style: italic;">-- &#21024;&#38500;&#20844;&#29992;&#21516;&#20041;&#35789;</span>
<span style="color: #0000FF;">drop</span> <span style="color: #0000FF;">public</span> synonym e;


<span style="color: #8D8D84; font-style: italic;">-- DBA_XXX &#31561;&#20854;&#23454;&#20063;&#26159;&#21516;&#20041;&#35789;&#65292;&#25152;&#20197;&#22312;&#35843;&#29992;&#30340;&#26102;&#20505;&#65292;&#19981;&#38656;&#35201;&#20889; SYS.</span>
<span style="color: #0000FF;">select</span> object_name, object_type <span style="color: #0000FF;">from</span> dba_objects <span style="color: #0000FF;">where</span> object_name = <span style="color: #008000;">'DBA_OBJECTS;'</span>
</pre>
</div>

<p>
有余力的同学也可以看一下 database link 的概念。
</p>
</div>
</section>

<section id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">序列 (Sequence)</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #8D8D84; font-style: italic;">-- SQLServer &#20013;&#33258;&#22686;&#23383;&#27573;&#30340;&#20889;&#27861;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">test</span><span style="color: #707183;">(</span>id <span style="color: #6434A3;">int</span> <span style="color: #0000FF;">primary</span> <span style="color: #0000FF;">key</span> <span style="color: #0000FF;">identity</span><span style="color: #707183;">)</span>;
<span style="color: #8D8D84; font-style: italic;">-- MySQL &#20013;&#33258;&#22686;&#23383;&#27573;&#30340;&#20889;&#27861;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">test</span><span style="color: #707183;">(</span>id <span style="color: #6434A3;">int</span> <span style="color: #0000FF;">primary</span> <span style="color: #0000FF;">key</span> auto_increment<span style="color: #707183;">)</span>;


<span style="color: #8D8D84; font-style: italic;">-- &#21019;&#24314;&#19968;&#20010;&#24207;&#21015;&#35821;&#27861;</span>
<span style="color: #0000FF;">CREATE</span> <span style="color: #0000FF;">SEQUENCE</span> <span style="color: #006699;">&#24207;&#21015;&#21517;&#23383;</span>
  <span style="color: #707183;">[</span><span style="color: #0000FF;">start</span> <span style="color: #0000FF;">with</span> &#25968;&#23383;<span style="color: #707183;">]</span>     <span style="color: #8D8D84; font-style: italic;">-- &#21021;&#22987;&#25968;&#23383;</span>
  <span style="color: #707183;">[</span>minvalue &#25968;&#23383;<span style="color: #707183;">]</span>       <span style="color: #8D8D84; font-style: italic;">-- &#26368;&#23567;&#20540;</span>
  <span style="color: #707183;">[</span>maxvalue &#25968;&#23383;<span style="color: #707183;">]</span>       <span style="color: #8D8D84; font-style: italic;">-- &#26368;&#22823;&#20540;</span>
  <span style="color: #707183;">[</span>increment <span style="color: #0000FF;">by</span> &#25968;&#23383;<span style="color: #707183;">]</span>   <span style="color: #8D8D84; font-style: italic;">-- &#22686;&#37327;</span>
  <span style="color: #707183;">[</span><span style="color: #0000FF;">cycle</span><span style="color: #707183;">]</span>               <span style="color: #8D8D84; font-style: italic;">-- &#26159;&#21542;&#35201;&#24490;&#29615;</span>
  <span style="color: #707183;">[</span>cache &#25968;&#23383;<span style="color: #707183;">]</span>          <span style="color: #8D8D84; font-style: italic;">-- &#26159;&#21542;&#32531;&#23384;&#65292;&#21363;&#26159;&#21542;&#22312;&#20869;&#23384;&#20013;&#39044;&#20808;&#20998;&#37197;&#25509;&#19979;&#26469;&#35201;&#29992;&#21040;&#30340;&#25968;&#23383;</span>
  <span style="color: #707183;">[</span><span style="color: #0000FF;">order</span> | nooreder<span style="color: #707183;">]</span>    <span style="color: #8D8D84; font-style: italic;">-- &#25490;&#24207;</span>
&#12288;

<span style="color: #8D8D84; font-style: italic;">-- &#26368;&#22522;&#26412;&#30340;&#21019;&#24314;&#12290;&#40664;&#35748;&#20174;1&#24320;&#22987;&#65292;&#22686;&#37327;&#20026;1</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">sequence</span> <span style="color: #006699;">seq_001</span>;

<span style="color: #8D8D84; font-style: italic;">-- start with &#30340;&#20540;&#34920;&#31034;&#21021;&#22987;&#65292;&#24517;&#39035;&#35201;&#22823;&#20110;&#31561;&#20110; minvalue</span>
<span style="color: #8D8D84; font-style: italic;">-- &#22914;&#26524;&#26159; nocycle &#27169;&#24335;&#65292;&#21040;&#36798;&#26368;&#22823;&#20540;&#32487;&#32493;&#25191;&#34892;&#20250;&#25253;&#38169;&#12290;&#21542;&#21017;&#65292;&#20250;&#24490;&#29615;&#12290;</span>
<span style="color: #8D8D84; font-style: italic;">-- &#24490;&#29615;&#30340;&#36215;&#22987;&#25968;&#20540;&#26159; minvalue &#32780;&#19981;&#26159; start with &#30340;&#20540;&#12290;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">sequence</span> <span style="color: #006699;">seq_006</span> <span style="color: #0000FF;">start</span> <span style="color: #0000FF;">with</span> 3 minvalue -6 maxvalue 8 <span style="color: #0000FF;">cycle</span> nocache;

<span style="color: #8D8D84; font-style: italic;">-- &#20462;&#25913;</span>
<span style="color: #0000FF;">alter</span> <span style="color: #0000FF;">sequence</span> <span style="color: #006699;">increment</span> <span style="color: #0000FF;">by</span> 8;
rename seq_006 <span style="color: #0000FF;">to</span> seq_666;

<span style="color: #8D8D84; font-style: italic;">-- &#21024;&#38500;&#24207;&#21015;</span>
<span style="color: #0000FF;">drop</span> <span style="color: #0000FF;">sequence</span> <span style="color: #006699;">seq_006</span>;

<span style="color: #8D8D84; font-style: italic;">-- &#24207;&#21015;&#30340;&#20351;&#29992;</span>
<span style="color: #0000FF;">select</span> &#24207;&#21015;&#21517;&#23383;.nextval <span style="color: #0000FF;">from</span> dual;    <span style="color: #8D8D84; font-style: italic;">-- &#24207;&#21015;&#30340;&#19979;&#19968;&#20010;&#20540;&#65292;&#35843;&#29992;&#20043;&#21518;&#20250;&#33258;&#21160;&#22686;&#38271;&#65292;&#27599;&#27425;&#36820;&#22238;&#20540;&#19981;&#19968;&#23450;&#30456;&#21516;&#12290;</span>
<span style="color: #0000FF;">select</span> &#24207;&#21015;&#21517;&#23383;.currval <span style="color: #0000FF;">from</span> dual;    <span style="color: #8D8D84; font-style: italic;">-- &#36820;&#22238;&#24207;&#21015;&#30340;&#24403;&#21069;&#20540;&#65292;&#27599;&#27425;&#35843;&#29992;&#36820;&#22238;&#20540;&#26159;&#19968;&#33268;&#30340;&#12290;&#38656;&#35201;&#24207;&#21015;&#34987;&#21021;&#22987;&#21270;(nextval)&#20043;&#21518;&#25165;&#33021;&#20351;&#29992;&#65292;&#21542;&#21017;&#25253;&#38169;&#12290;</span>

<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">seqtab</span> <span style="color: #707183;">(</span>id <span style="color: #0000FF;">number</span> <span style="color: #0000FF;">primary</span> <span style="color: #0000FF;">key</span>, <span style="color: #0000FF;">name</span> varchar2<span style="color: #7388D6;">(</span>20<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>;
<span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">into</span> seqtab <span style="color: #0000FF;">values</span> <span style="color: #707183;">(</span>seq_001.nextval, <span style="color: #008000;">'hello'</span><span style="color: #707183;">)</span>; <span style="color: #8D8D84; font-style: italic;">-- &#36825;&#31181;&#20889;&#27861;&#34429;&#28982;&#30475;&#36215;&#26469;&#40635;&#28902;&#65292;&#20294;&#26159;&#22312;&#24320;&#21457;&#20013;&#26377;&#20854;&#28789;&#27963;&#24615;&#21644;&#36890;&#29992;&#24615;&#65292;&#26159;&#38750;&#24120;&#24378;&#22823;&#30340;&#12290;</span>

<span style="color: #8D8D84; font-style: italic;">-- &#33258;&#21160;&#25554;&#20837;&#65292;&#38656;&#35201;&#37197;&#21512;&#35302;&#21457;&#22120; (triggle) &#20351;&#29992;&#12290;&#26377;&#20852;&#36259;&#12289;&#26377;&#20313;&#21147;&#30340;&#21516;&#23398;&#65292;&#35831;&#33258;&#24049;&#20851;&#27880;&#12290;&#20854;&#20182;&#20154;&#26080;&#35270;&#21017;&#21487;&#12290;</span>
</pre>
</div>
</div>
</section>

<section id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">表的分区(Partition)</h2>
<div class="outline-text-2" id="text-8">
<p>
建议在下面两种情况下要对表进行分区:
</p>
<ol class="org-ol">
<li>表的数据量超过 2G
</li>
<li>表里面存在大量的历史数据
</li>
</ol>

<p>
表分区是为了达到分而治之的目的，是鸡蛋不能放在同一个篮子里的切实实践。首先能提高效率，再者可保障安全。
</p>

<p>
Oracle 里的基本分区有：
</p>
<ol class="org-ol">
<li>范围分区(Range)
</li>
<li>列表分区(List)
</li>
<li>哈希分区(Hash)
</li>
</ol>

<p>
另外可以对表的分区进行复合，建立子分区。 Oracle 11 之后添加了很多不同的复合形式，但常用的有两种：
</p>
<ol class="org-ol">
<li>范围-哈希分区
</li>
<li>范围-列表分区
</li>
</ol>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #8D8D84; font-style: italic;">-- &#26597;&#30475;&#24403;&#21069;&#29992;&#25143;&#19979;&#34920;&#30340;&#20998;&#21306;&#35814;&#24773;&#12290;</span>
<span style="color: #0000FF;">select</span> <span style="color: #0000FF;">table_name</span>, partition_name <span style="color: #0000FF;">from</span> user_tab_partitions;
<span style="color: #0000FF;">select</span> <span style="color: #0000FF;">table_name</span>, partition_name, subpartition_name <span style="color: #0000FF;">from</span> user_tab_subpartitions;

<span style="color: #8D8D84; font-style: italic;">-- &#20174;&#20998;&#21306;&#20013;&#26597;&#35810;&#25968;&#25454;</span>
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> <span style="color: #0000FF;">table_name</span> partition <span style="color: #707183;">(</span>partition_name<span style="color: #707183;">)</span>;

<span style="color: #8D8D84; font-style: italic;">-- &#22797;&#21512;&#20998;&#21306;&#20013;&#36827;&#34892;&#26597;&#35810;&#25968;&#25454;</span>
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> cxbe3 subpartition <span style="color: #707183;">(</span>p1_ps4<span style="color: #707183;">)</span>;   <span style="color: #8D8D84; font-style: italic;">-- &#34920;&#31034; p1 &#20998;&#21306;&#19979;&#30340; ps4 &#23376;&#20998;&#21306;</span>
</pre>
</div>
</div>
