oracle.org
** 范围分区
#+BEGIN_SRC sql
-- 基本创建
create table bea1 (name varchar2(20), birth date, yz number);   -- 表的创建语句，不带分区的情况
create table bea2 (name varchar2(20), birth date, yz number)    -- 按照生日，范围分区。
partition by range (birth)
(
  partition p1 values less than (to_date('19900101', 'yyyymmdd')),
  partition p2 values less than (to_date('20000101', 'yyyymmdd'))
);
-- 测试 bea2
insert into bea2 values ('xxx', to_date('19880102'), 87);   -- 会被插入到 p1 分区
insert into bea2 values ('yyy', to_date('19920102'), 82);   -- 会被插入到 p2 分区
insert into bea2 values ('zzz', to_date('20010102'), 89);   -- 会出现错误，ORA-14400: 插入的分区关键字未映射到任何分区。因为没为这条数据创建相应分区。
select * from bea2;                   -- 两条数据，xxx 和 yyy
select * from bea2 partition (p1);    -- 显示的是 xxx 的数据。这是从特定分区中查询数据的语法
select * from bea2 partition (p2);    -- 显示的是 yyy 的数据

-- maxvalue 的使用
create table bea3 (name varchar2(20), birth date, yz number)    -- 按照生日，范围分区。
partition by range (birth)
(
  partition p1 values less than (to_date('19900101', 'yyyymmdd')),
  partition p2 values less than (to_date('20000101', 'yyyymmdd')),
  partition p3 values less than (MAXVALUE);
);
insert into bea3 values ('zzz', to_date('20010102'), 89);   -- 插入的是有maxvalue关键字的 p3 分区
select * from bea3 partition (p3);                          -- 可以查询到.

-- 分区的关键字，可以是数值，可以是日期，也可以是字符串
create table bea5(name varchar2(20),birth date, yz number)
partition by range(name)
(
  partition p1 values less than ('i'),
  partition p2 values less than ('x'),
  partition p3 values less than (MAXVALUE)
);

-- 在创建每个分区的时候，为每个分区指定表空间
create table bea6(name varchar2(20),birth date, yz number)
partition by range(yz)
(
  partition p1 values less than (60),
  partition p2 values less than (85) tablespace users,
  partition p3 values less than (MAXVALUE) tablespace system
);

-- 可以按照多个字段进行分区
create table bea7(name varchar2(20),birth date, yz number)
partition by range(name, yz)
(
  partition p1 values less than ('j', 60),
  partition p2 values less than ('z', 90),
  partition p3 values less than (MAXVALUE, MAXVALUE)
);


#+END_SRC


