oracle.html

<div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1">范围分区</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #8D8D84; font-style: italic;">-- &#22522;&#26412;&#21019;&#24314;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">bea1</span> <span style="color: #707183;">(</span><span style="color: #0000FF;">name</span> varchar2<span style="color: #7388D6;">(</span>20<span style="color: #7388D6;">)</span>, birth <span style="color: #6434A3;">date</span>, yz <span style="color: #0000FF;">number</span><span style="color: #707183;">)</span>;   <span style="color: #8D8D84; font-style: italic;">-- &#34920;&#30340;&#21019;&#24314;&#35821;&#21477;&#65292;&#19981;&#24102;&#20998;&#21306;&#30340;&#24773;&#20917;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">bea2</span> <span style="color: #707183;">(</span><span style="color: #0000FF;">name</span> varchar2<span style="color: #7388D6;">(</span>20<span style="color: #7388D6;">)</span>, birth <span style="color: #6434A3;">date</span>, yz <span style="color: #0000FF;">number</span><span style="color: #707183;">)</span>    <span style="color: #8D8D84; font-style: italic;">-- &#25353;&#29031;&#29983;&#26085;&#65292;&#33539;&#22260;&#20998;&#21306;&#12290;</span>
partition <span style="color: #0000FF;">by</span> range <span style="color: #707183;">(</span>birth<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>
  partition p1 <span style="color: #0000FF;">values</span> <span style="color: #0000FF;">less</span> <span style="color: #0000FF;">than</span> <span style="color: #7388D6;">(</span>to_date<span style="color: #909183;">(</span><span style="color: #008000;">'19900101'</span>, <span style="color: #008000;">'yyyymmdd'</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>,
  partition p2 <span style="color: #0000FF;">values</span> <span style="color: #0000FF;">less</span> <span style="color: #0000FF;">than</span> <span style="color: #7388D6;">(</span>to_date<span style="color: #909183;">(</span><span style="color: #008000;">'20000101'</span>, <span style="color: #008000;">'yyyymmdd'</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
<span style="color: #707183;">)</span>;
<span style="color: #8D8D84; font-style: italic;">-- &#27979;&#35797; bea2</span>
<span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">into</span> bea2 <span style="color: #0000FF;">values</span> <span style="color: #707183;">(</span><span style="color: #008000;">'xxx'</span>, to_date<span style="color: #7388D6;">(</span><span style="color: #008000;">'19880102'</span><span style="color: #7388D6;">)</span>, 87<span style="color: #707183;">)</span>;   <span style="color: #8D8D84; font-style: italic;">-- &#20250;&#34987;&#25554;&#20837;&#21040; p1 &#20998;&#21306;</span>
<span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">into</span> bea2 <span style="color: #0000FF;">values</span> <span style="color: #707183;">(</span><span style="color: #008000;">'yyy'</span>, to_date<span style="color: #7388D6;">(</span><span style="color: #008000;">'19920102'</span><span style="color: #7388D6;">)</span>, 82<span style="color: #707183;">)</span>;   <span style="color: #8D8D84; font-style: italic;">-- &#20250;&#34987;&#25554;&#20837;&#21040; p2 &#20998;&#21306;</span>
<span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">into</span> bea2 <span style="color: #0000FF;">values</span> <span style="color: #707183;">(</span><span style="color: #008000;">'zzz'</span>, to_date<span style="color: #7388D6;">(</span><span style="color: #008000;">'20010102'</span><span style="color: #7388D6;">)</span>, 89<span style="color: #707183;">)</span>;   <span style="color: #8D8D84; font-style: italic;">-- &#20250;&#20986;&#29616;&#38169;&#35823;&#65292;ORA-14400: &#25554;&#20837;&#30340;&#20998;&#21306;&#20851;&#38190;&#23383;&#26410;&#26144;&#23556;&#21040;&#20219;&#20309;&#20998;&#21306;&#12290;&#22240;&#20026;&#27809;&#20026;&#36825;&#26465;&#25968;&#25454;&#21019;&#24314;&#30456;&#24212;&#20998;&#21306;&#12290;</span>
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> bea2;                   <span style="color: #8D8D84; font-style: italic;">-- &#20004;&#26465;&#25968;&#25454;&#65292;xxx &#21644; yyy</span>
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> bea2 partition <span style="color: #707183;">(</span>p1<span style="color: #707183;">)</span>;    <span style="color: #8D8D84; font-style: italic;">-- &#26174;&#31034;&#30340;&#26159; xxx &#30340;&#25968;&#25454;&#12290;&#36825;&#26159;&#20174;&#29305;&#23450;&#20998;&#21306;&#20013;&#26597;&#35810;&#25968;&#25454;&#30340;&#35821;&#27861;</span>
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> bea2 partition <span style="color: #707183;">(</span>p2<span style="color: #707183;">)</span>;    <span style="color: #8D8D84; font-style: italic;">-- &#26174;&#31034;&#30340;&#26159; yyy &#30340;&#25968;&#25454;</span>

<span style="color: #8D8D84; font-style: italic;">-- maxvalue &#30340;&#20351;&#29992;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">bea3</span> <span style="color: #707183;">(</span><span style="color: #0000FF;">name</span> varchar2<span style="color: #7388D6;">(</span>20<span style="color: #7388D6;">)</span>, birth <span style="color: #6434A3;">date</span>, yz <span style="color: #0000FF;">number</span><span style="color: #707183;">)</span>    <span style="color: #8D8D84; font-style: italic;">-- &#25353;&#29031;&#29983;&#26085;&#65292;&#33539;&#22260;&#20998;&#21306;&#12290;</span>
partition <span style="color: #0000FF;">by</span> range <span style="color: #707183;">(</span>birth<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>
  partition p1 <span style="color: #0000FF;">values</span> <span style="color: #0000FF;">less</span> <span style="color: #0000FF;">than</span> <span style="color: #7388D6;">(</span>to_date<span style="color: #909183;">(</span><span style="color: #008000;">'19900101'</span>, <span style="color: #008000;">'yyyymmdd'</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>,
  partition p2 <span style="color: #0000FF;">values</span> <span style="color: #0000FF;">less</span> <span style="color: #0000FF;">than</span> <span style="color: #7388D6;">(</span>to_date<span style="color: #909183;">(</span><span style="color: #008000;">'20000101'</span>, <span style="color: #008000;">'yyyymmdd'</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>,
  partition p3 <span style="color: #0000FF;">values</span> <span style="color: #0000FF;">less</span> <span style="color: #0000FF;">than</span> <span style="color: #7388D6;">(</span>MAXVALUE<span style="color: #7388D6;">)</span>;
<span style="color: #707183;">)</span>;
<span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">into</span> bea3 <span style="color: #0000FF;">values</span> <span style="color: #707183;">(</span><span style="color: #008000;">'zzz'</span>, to_date<span style="color: #7388D6;">(</span><span style="color: #008000;">'20010102'</span><span style="color: #7388D6;">)</span>, 89<span style="color: #707183;">)</span>;   <span style="color: #8D8D84; font-style: italic;">-- &#25554;&#20837;&#30340;&#26159;&#26377;maxvalue&#20851;&#38190;&#23383;&#30340; p3 &#20998;&#21306;</span>
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> bea3 partition <span style="color: #707183;">(</span>p3<span style="color: #707183;">)</span>;                          <span style="color: #8D8D84; font-style: italic;">-- &#21487;&#20197;&#26597;&#35810;&#21040;.</span>

<span style="color: #8D8D84; font-style: italic;">-- &#20998;&#21306;&#30340;&#20851;&#38190;&#23383;&#65292;&#21487;&#20197;&#26159;&#25968;&#20540;&#65292;&#21487;&#20197;&#26159;&#26085;&#26399;&#65292;&#20063;&#21487;&#20197;&#26159;&#23383;&#31526;&#20018;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">bea5</span><span style="color: #707183;">(</span><span style="color: #0000FF;">name</span> varchar2<span style="color: #7388D6;">(</span>20<span style="color: #7388D6;">)</span>,birth <span style="color: #6434A3;">date</span>, yz <span style="color: #0000FF;">number</span><span style="color: #707183;">)</span>
partition <span style="color: #0000FF;">by</span> range<span style="color: #707183;">(</span><span style="color: #0000FF;">name</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>
  partition p1 <span style="color: #0000FF;">values</span> <span style="color: #0000FF;">less</span> <span style="color: #0000FF;">than</span> <span style="color: #7388D6;">(</span><span style="color: #008000;">'i'</span><span style="color: #7388D6;">)</span>,
  partition p2 <span style="color: #0000FF;">values</span> <span style="color: #0000FF;">less</span> <span style="color: #0000FF;">than</span> <span style="color: #7388D6;">(</span><span style="color: #008000;">'x'</span><span style="color: #7388D6;">)</span>,
  partition p3 <span style="color: #0000FF;">values</span> <span style="color: #0000FF;">less</span> <span style="color: #0000FF;">than</span> <span style="color: #7388D6;">(</span>MAXVALUE<span style="color: #7388D6;">)</span>
<span style="color: #707183;">)</span>;

<span style="color: #8D8D84; font-style: italic;">-- &#22312;&#21019;&#24314;&#27599;&#20010;&#20998;&#21306;&#30340;&#26102;&#20505;&#65292;&#20026;&#27599;&#20010;&#20998;&#21306;&#25351;&#23450;&#34920;&#31354;&#38388;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">bea6</span><span style="color: #707183;">(</span><span style="color: #0000FF;">name</span> varchar2<span style="color: #7388D6;">(</span>20<span style="color: #7388D6;">)</span>,birth <span style="color: #6434A3;">date</span>, yz <span style="color: #0000FF;">number</span><span style="color: #707183;">)</span>
partition <span style="color: #0000FF;">by</span> range<span style="color: #707183;">(</span>yz<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>
  partition p1 <span style="color: #0000FF;">values</span> <span style="color: #0000FF;">less</span> <span style="color: #0000FF;">than</span> <span style="color: #7388D6;">(</span>60<span style="color: #7388D6;">)</span>,
  partition p2 <span style="color: #0000FF;">values</span> <span style="color: #0000FF;">less</span> <span style="color: #0000FF;">than</span> <span style="color: #7388D6;">(</span>85<span style="color: #7388D6;">)</span> tablespace users,
  partition p3 <span style="color: #0000FF;">values</span> <span style="color: #0000FF;">less</span> <span style="color: #0000FF;">than</span> <span style="color: #7388D6;">(</span>MAXVALUE<span style="color: #7388D6;">)</span> tablespace <span style="color: #0000FF;">system</span>
<span style="color: #707183;">)</span>;

<span style="color: #8D8D84; font-style: italic;">-- &#21487;&#20197;&#25353;&#29031;&#22810;&#20010;&#23383;&#27573;&#36827;&#34892;&#20998;&#21306;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">bea7</span><span style="color: #707183;">(</span><span style="color: #0000FF;">name</span> varchar2<span style="color: #7388D6;">(</span>20<span style="color: #7388D6;">)</span>,birth <span style="color: #6434A3;">date</span>, yz <span style="color: #0000FF;">number</span><span style="color: #707183;">)</span>
partition <span style="color: #0000FF;">by</span> range<span style="color: #707183;">(</span><span style="color: #0000FF;">name</span>, yz<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>
  partition p1 <span style="color: #0000FF;">values</span> <span style="color: #0000FF;">less</span> <span style="color: #0000FF;">than</span> <span style="color: #7388D6;">(</span><span style="color: #008000;">'j'</span>, 60<span style="color: #7388D6;">)</span>,
  partition p2 <span style="color: #0000FF;">values</span> <span style="color: #0000FF;">less</span> <span style="color: #0000FF;">than</span> <span style="color: #7388D6;">(</span><span style="color: #008000;">'z'</span>, 90<span style="color: #7388D6;">)</span>,
  partition p3 <span style="color: #0000FF;">values</span> <span style="color: #0000FF;">less</span> <span style="color: #0000FF;">than</span> <span style="color: #7388D6;">(</span>MAXVALUE, MAXVALUE<span style="color: #7388D6;">)</span>
<span style="color: #707183;">)</span>;
</pre>
</div>
</div>
</div>
