oracle.org
** 列表分区
#+BEGIN_SRC sql
-- 按照性别进行分区。不要忘记指定默认分区
create table beaa (name varchar2(20), sex varchar2(20), yz number)
partition by list (sex)
(
	partition p1 values ('男'),
	partition p2 values ('女'),
	partition p3 values (DEFAULT)
);

-- 指定相应的存储表空间
create table beaa (name varchar2(20), sex varchar2(20), yz number)
partition by list (sex)
(
	partition p1 values ('男') tablespace users,
	partition p2 values ('女') tablespace system,
	partition p3 values (DEFAULT)
);

#+END_SRC

** 哈希分区

[[http://www.bing.com/knows/search?q=%E5%93%88%E5%B8%8C%E7%AE%97%E6%B3%95&mkt=zh-cn&FORM=BKACAI][哈希算法]],散列是也~

#+BEGIN_SRC sql
create table beax (name varchar2(20), yz number)
partition by hash (name)
(
  partition p1 tablespace users,
  partition p2,
  partition p3,
  partition p4,
  partition p5
);

-- 创建多个分区的简略写法。分区的名字由oracle自动维护。
create table beax (name varchar2(20), yz number)
partition by hash (name)
partitions 5;

-- 指定表空间
create table beax (name varchar2(20), yz number)
partition by hash (name)
partitions 5 stores in (users, system, users, system, system);


#+END_SRC

** 范围-列表分区
#+BEGIN_SRC sql
-- 先按照生日分区，之后子分区是按照名字哈希分区
create table cxbe1 (name varchar2(20), birth date, yz number)
partition by range (birth)
subpartition by hash (name)
subpartitions 3
(
  partition p1 values less than (to_date('19900101','yyyymmdd')),
  partition p2 values less than (to_date('20000101','yyyymmdd')),
  partition p3 values less than (maxvalue)
);

-- 先按照颜值分区，之后子分区是按照生日哈希分区
create table cxbe2 (name varchar2(20), birth date, yz number)
partition by range (yz)
subpartition by hash (birth)
subpartitions 3
(
  partition p1 values less than (50),
  partition p2 values less than (80),
  partition p3 values less than (MAXVALUE)
);


#+END_SRC

** 范围-列表分区
#+BEGIN_SRC sql
-- 先按照颜值范围分区，在每个分区内再进行哈希分区
create table cxbe3 (name varchar2(20), sex varchar2(20), yz number)
partition by range (yz)
subpartition by list (sex)
subpartitions template
(
  subpartition ps1 values ('男') tablespace users,
  subpartition ps2 values ('女') tablespace users,
  subpartition ps2 values (DEFAULT)
)
(
  partition p1 values less than (60),
  partition p2 values less than (80),
  partition p3 values less than (MAXVALUE)
);


#+END_SRC

