oracle.html


<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2">列表分区</h3>
<div class="outline-text-3" id="text-8-2">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #8D8D84; font-style: italic;">-- &#25353;&#29031;&#24615;&#21035;&#36827;&#34892;&#20998;&#21306;&#12290;&#19981;&#35201;&#24536;&#35760;&#25351;&#23450;&#40664;&#35748;&#20998;&#21306;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">beaa</span> <span style="color: #707183;">(</span><span style="color: #0000FF;">name</span> varchar2<span style="color: #7388D6;">(</span>20<span style="color: #7388D6;">)</span>, sex varchar2<span style="color: #7388D6;">(</span>20<span style="color: #7388D6;">)</span>, yz <span style="color: #0000FF;">number</span><span style="color: #707183;">)</span>
partition <span style="color: #0000FF;">by</span> list <span style="color: #707183;">(</span>sex<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>
  partition p1 <span style="color: #0000FF;">values</span> <span style="color: #7388D6;">(</span><span style="color: #008000;">'&#30007;'</span><span style="color: #7388D6;">)</span>,
  partition p2 <span style="color: #0000FF;">values</span> <span style="color: #7388D6;">(</span><span style="color: #008000;">'&#22899;'</span><span style="color: #7388D6;">)</span>,
  partition p3 <span style="color: #0000FF;">values</span> <span style="color: #7388D6;">(</span><span style="color: #0000FF;">DEFAULT</span><span style="color: #7388D6;">)</span>
<span style="color: #707183;">)</span>;

<span style="color: #8D8D84; font-style: italic;">-- &#25351;&#23450;&#30456;&#24212;&#30340;&#23384;&#20648;&#34920;&#31354;&#38388;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">beaa</span> <span style="color: #707183;">(</span><span style="color: #0000FF;">name</span> varchar2<span style="color: #7388D6;">(</span>20<span style="color: #7388D6;">)</span>, sex varchar2<span style="color: #7388D6;">(</span>20<span style="color: #7388D6;">)</span>, yz <span style="color: #0000FF;">number</span><span style="color: #707183;">)</span>
partition <span style="color: #0000FF;">by</span> list <span style="color: #707183;">(</span>sex<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>
  partition p1 <span style="color: #0000FF;">values</span> <span style="color: #7388D6;">(</span><span style="color: #008000;">'&#30007;'</span><span style="color: #7388D6;">)</span> tablespace users,
  partition p2 <span style="color: #0000FF;">values</span> <span style="color: #7388D6;">(</span><span style="color: #008000;">'&#22899;'</span><span style="color: #7388D6;">)</span> tablespace <span style="color: #0000FF;">system</span>,
  partition p3 <span style="color: #0000FF;">values</span> <span style="color: #7388D6;">(</span><span style="color: #0000FF;">DEFAULT</span><span style="color: #7388D6;">)</span>
<span style="color: #707183;">)</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-3" class="outline-3">
<h3 id="sec-8-3">哈希分区</h3>
<div class="outline-text-3" id="text-8-3">
<p>
<a href="http://www.bing.com/knows/search?q=%E5%93%88%E5%B8%8C%E7%AE%97%E6%B3%95&mkt=zh-cn&FORM=BKACAI">哈希算法</a>,散列是也~
</p>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">beax</span> <span style="color: #707183;">(</span><span style="color: #0000FF;">name</span> varchar2<span style="color: #7388D6;">(</span>20<span style="color: #7388D6;">)</span>, yz <span style="color: #0000FF;">number</span><span style="color: #707183;">)</span>
partition <span style="color: #0000FF;">by</span> hash <span style="color: #707183;">(</span><span style="color: #0000FF;">name</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>
  partition p1 tablespace users,
  partition p2,
  partition p3,
  partition p4,
  partition p5
<span style="color: #707183;">)</span>;

<span style="color: #8D8D84; font-style: italic;">-- &#21019;&#24314;&#22810;&#20010;&#20998;&#21306;&#30340;&#31616;&#30053;&#20889;&#27861;&#12290;&#20998;&#21306;&#30340;&#21517;&#23383;&#30001;oracle&#33258;&#21160;&#32500;&#25252;&#12290;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">beax</span> <span style="color: #707183;">(</span><span style="color: #0000FF;">name</span> varchar2<span style="color: #7388D6;">(</span>20<span style="color: #7388D6;">)</span>, yz <span style="color: #0000FF;">number</span><span style="color: #707183;">)</span>
partition <span style="color: #0000FF;">by</span> hash <span style="color: #707183;">(</span><span style="color: #0000FF;">name</span><span style="color: #707183;">)</span>
partitions 5;

<span style="color: #8D8D84; font-style: italic;">-- &#25351;&#23450;&#34920;&#31354;&#38388;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">beax</span> <span style="color: #707183;">(</span><span style="color: #0000FF;">name</span> varchar2<span style="color: #7388D6;">(</span>20<span style="color: #7388D6;">)</span>, yz <span style="color: #0000FF;">number</span><span style="color: #707183;">)</span>
partition <span style="color: #0000FF;">by</span> hash <span style="color: #707183;">(</span><span style="color: #0000FF;">name</span><span style="color: #707183;">)</span>
partitions 5 stores <span style="color: #0000FF;">in</span> <span style="color: #707183;">(</span>users, <span style="color: #0000FF;">system</span>, users, <span style="color: #0000FF;">system</span>, <span style="color: #0000FF;">system</span><span style="color: #707183;">)</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-4" class="outline-3">
<h3 id="sec-8-4">范围-列表分区</h3>
<div class="outline-text-3" id="text-8-4">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #8D8D84; font-style: italic;">-- &#20808;&#25353;&#29031;&#29983;&#26085;&#20998;&#21306;&#65292;&#20043;&#21518;&#23376;&#20998;&#21306;&#26159;&#25353;&#29031;&#21517;&#23383;&#21704;&#24076;&#20998;&#21306;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">cxbe1</span> <span style="color: #707183;">(</span><span style="color: #0000FF;">name</span> varchar2<span style="color: #7388D6;">(</span>20<span style="color: #7388D6;">)</span>, birth <span style="color: #6434A3;">date</span>, yz <span style="color: #0000FF;">number</span><span style="color: #707183;">)</span>
partition <span style="color: #0000FF;">by</span> range <span style="color: #707183;">(</span>birth<span style="color: #707183;">)</span>
subpartition <span style="color: #0000FF;">by</span> hash <span style="color: #707183;">(</span><span style="color: #0000FF;">name</span><span style="color: #707183;">)</span>
subpartitions 3
<span style="color: #707183;">(</span>
  partition p1 <span style="color: #0000FF;">values</span> <span style="color: #0000FF;">less</span> <span style="color: #0000FF;">than</span> <span style="color: #7388D6;">(</span>to_date<span style="color: #909183;">(</span><span style="color: #008000;">'19900101'</span>,<span style="color: #008000;">'yyyymmdd'</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>,
  partition p2 <span style="color: #0000FF;">values</span> <span style="color: #0000FF;">less</span> <span style="color: #0000FF;">than</span> <span style="color: #7388D6;">(</span>to_date<span style="color: #909183;">(</span><span style="color: #008000;">'20000101'</span>,<span style="color: #008000;">'yyyymmdd'</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>,
  partition p3 <span style="color: #0000FF;">values</span> <span style="color: #0000FF;">less</span> <span style="color: #0000FF;">than</span> <span style="color: #7388D6;">(</span>maxvalue<span style="color: #7388D6;">)</span>
<span style="color: #707183;">)</span>;

<span style="color: #8D8D84; font-style: italic;">-- &#20808;&#25353;&#29031;&#39068;&#20540;&#20998;&#21306;&#65292;&#20043;&#21518;&#23376;&#20998;&#21306;&#26159;&#25353;&#29031;&#29983;&#26085;&#21704;&#24076;&#20998;&#21306;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">cxbe2</span> <span style="color: #707183;">(</span><span style="color: #0000FF;">name</span> varchar2<span style="color: #7388D6;">(</span>20<span style="color: #7388D6;">)</span>, birth <span style="color: #6434A3;">date</span>, yz <span style="color: #0000FF;">number</span><span style="color: #707183;">)</span>
partition <span style="color: #0000FF;">by</span> range <span style="color: #707183;">(</span>yz<span style="color: #707183;">)</span>
subpartition <span style="color: #0000FF;">by</span> hash <span style="color: #707183;">(</span>birth<span style="color: #707183;">)</span>
subpartitions 3
<span style="color: #707183;">(</span>
  partition p1 <span style="color: #0000FF;">values</span> <span style="color: #0000FF;">less</span> <span style="color: #0000FF;">than</span> <span style="color: #7388D6;">(</span>50<span style="color: #7388D6;">)</span>,
  partition p2 <span style="color: #0000FF;">values</span> <span style="color: #0000FF;">less</span> <span style="color: #0000FF;">than</span> <span style="color: #7388D6;">(</span>80<span style="color: #7388D6;">)</span>,
  partition p3 <span style="color: #0000FF;">values</span> <span style="color: #0000FF;">less</span> <span style="color: #0000FF;">than</span> <span style="color: #7388D6;">(</span>MAXVALUE<span style="color: #7388D6;">)</span>
<span style="color: #707183;">)</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-5" class="outline-3">
<h3 id="sec-8-5">范围-列表分区</h3>
<div class="outline-text-3" id="text-8-5">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #8D8D84; font-style: italic;">-- &#20808;&#25353;&#29031;&#39068;&#20540;&#33539;&#22260;&#20998;&#21306;&#65292;&#22312;&#27599;&#20010;&#20998;&#21306;&#20869;&#20877;&#36827;&#34892;&#21704;&#24076;&#20998;&#21306;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">cxbe3</span> <span style="color: #707183;">(</span><span style="color: #0000FF;">name</span> varchar2<span style="color: #7388D6;">(</span>20<span style="color: #7388D6;">)</span>, sex varchar2<span style="color: #7388D6;">(</span>20<span style="color: #7388D6;">)</span>, yz <span style="color: #0000FF;">number</span><span style="color: #707183;">)</span>
partition <span style="color: #0000FF;">by</span> range <span style="color: #707183;">(</span>yz<span style="color: #707183;">)</span>
subpartition <span style="color: #0000FF;">by</span> list <span style="color: #707183;">(</span>sex<span style="color: #707183;">)</span>
subpartitions template
<span style="color: #707183;">(</span>
  subpartition ps1 <span style="color: #0000FF;">values</span> <span style="color: #7388D6;">(</span><span style="color: #008000;">'&#30007;'</span><span style="color: #7388D6;">)</span> tablespace users,
  subpartition ps2 <span style="color: #0000FF;">values</span> <span style="color: #7388D6;">(</span><span style="color: #008000;">'&#22899;'</span><span style="color: #7388D6;">)</span> tablespace users,
  subpartition ps2 <span style="color: #0000FF;">values</span> <span style="color: #7388D6;">(</span><span style="color: #0000FF;">DEFAULT</span><span style="color: #7388D6;">)</span>
<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>
  partition p1 <span style="color: #0000FF;">values</span> <span style="color: #0000FF;">less</span> <span style="color: #0000FF;">than</span> <span style="color: #7388D6;">(</span>60<span style="color: #7388D6;">)</span>,
  partition p2 <span style="color: #0000FF;">values</span> <span style="color: #0000FF;">less</span> <span style="color: #0000FF;">than</span> <span style="color: #7388D6;">(</span>80<span style="color: #7388D6;">)</span>,
  partition p3 <span style="color: #0000FF;">values</span> <span style="color: #0000FF;">less</span> <span style="color: #0000FF;">than</span> <span style="color: #7388D6;">(</span>MAXVALUE<span style="color: #7388D6;">)</span>
<span style="color: #707183;">)</span>;
</pre>
</div>
</div>
</div>
