oracle.org
** 分区的修改
#+BEGIN_SRC sql

-- 添加分区
alter table bea2 add partition p9 values less than (MAXVALUE);
alter table bea2 add partition p9 values (1, 2);   -- 针对 list 分区
alter table bea2 add partition;                    -- 针对 hash 分区

-- 删除分区内数据
alter table bea2 truncate partition p3;

-- 删除分区
alter table bea2 drop partition p3;

-- 合并相邻分区
alter table bea2 merge partitions p2, p3 into partition p8;

-- 拆分分区
alter table bea2 split partition p2 at (3000) into (partition p3, partition p14);     -- 范围分区的拆分
alter table bea2 split partition p2 values (1,2) into (partition p3, partition p4);   -- 列表分区的拆分
alter table bea2 split partition p2 into (partition p3 values (1, 2), partition p4 values (3), partition p5);   -- 列表分区的拆分

-- 重命名分区
alter table bea2 rename partition p2 to p12;

#+END_SRC

如果分区字段的数据被 update，发生了跨分区的情况，会发生什么？
: 错误:更新分区关键字列将导致分区的更改
可以通过以下语法，使行数据可以移动
: alter table m8 enable row movement;
通过这种方式，实现了行数据的迁移。但是数据的 rowid 也会随之发生变化。

* 视图 (View)

四种类型
1. 关系视图 (Relational View)
2. 内嵌式图 (Inline View)
3. 对象视图 (Object View)
4. 物化视图 (Materialize View)

** 关系视图
又称为虚表，不占物理空间，存储在数据字典中。它能简化命令，隐藏复杂度，解耦，增强安全性。

#+BEGIN_SRC sql
-- 初始化要使用的表
create table emp as select * from emp;                        -- 复制表
alter table emp add constraints pk_emp primary key (empno);   -- 添加主键
create table dept as select * from dept;

-- 创建语法
create [or replace] [force | noforce]
view view_name as select * from table_name
[with read only]              -- 强迫视图只能查看，不能修改
[with check option]
;

-- 创建视图
create view v_emp as select empno, ename, sal from emp where sal > 1000;

create view v_emp01 as
select e.ename, e.sal, d.dname from emp e, dept d where e.deptno = d.deptno;


-- 删除视图
drop view v_emp01;


#+END_SRC


** 内嵌视图

#+BEGIN_SRC sql

-- 查询的基本语句，from 后面跟的是表或者视图
select 所有要查询的列 from 要查询的表/视图 where clause;

-- 这是之前我们用过的一个查询，查询所有 rownum > 2 的所有数据
-- 在这个查询中，我们在 from 之后用到了一个带括号的查询语句，这个查询语句就是内嵌视图。
select * from 
  (select rownum rn, empno, ename, sal from scott.emp) 
  where rn > 2;

-- 内嵌视图，从逻辑上可以分解为:
-- 第一步：
create view linshigong001 as select rownum rn, empno, ename, sal from scott.emp;
-- 第二步：
select * from linshigong001 where rn > 2;
-- 第三步：
drop view linshigong001;

#+END_SRC

** 对象视图（可选）
#+BEGIN_SRC sql
-- 创建对象
CREATE OR REPLACE TYPE depttype 
AS OBJECT 
(
deptid number,
deptname varchar2(30),
loc number
);

CREATE OR REPLACE VIEW v_dept OF depttype
  WITH OBJECT OID (deptid) 
AS 
  SELECT deptid, deptname, loc FROM emp;

SELECT * FROM v_dept;
select ref(t) from v_dept t;  -- oid

#+END_SRC



