oracle.html

<div id="outline-container-sec-8-6" class="outline-3">
<h3 id="sec-8-6">分区的修改</h3>
<div class="outline-text-3" id="text-8-6">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #8D8D84; font-style: italic;">-- &#28155;&#21152;&#20998;&#21306;</span>
<span style="color: #0000FF;">alter</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">bea2</span> <span style="color: #0000FF;">add</span> partition p9 <span style="color: #0000FF;">values</span> <span style="color: #0000FF;">less</span> <span style="color: #0000FF;">than</span> <span style="color: #707183;">(</span>MAXVALUE<span style="color: #707183;">)</span>;
<span style="color: #0000FF;">alter</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">bea2</span> <span style="color: #0000FF;">add</span> partition p9 <span style="color: #0000FF;">values</span> <span style="color: #707183;">(</span>1, 2<span style="color: #707183;">)</span>;   <span style="color: #8D8D84; font-style: italic;">-- &#38024;&#23545; list &#20998;&#21306;</span>
<span style="color: #0000FF;">alter</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">bea2</span> <span style="color: #0000FF;">add</span> partition;                    <span style="color: #8D8D84; font-style: italic;">-- &#38024;&#23545; hash &#20998;&#21306;</span>

<span style="color: #8D8D84; font-style: italic;">-- &#21024;&#38500;&#20998;&#21306;&#20869;&#25968;&#25454;</span>
<span style="color: #0000FF;">alter</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">bea2</span> truncate partition p3;

<span style="color: #8D8D84; font-style: italic;">-- &#21024;&#38500;&#20998;&#21306;</span>
<span style="color: #0000FF;">alter</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">bea2</span> <span style="color: #0000FF;">drop</span> partition p3;

<span style="color: #8D8D84; font-style: italic;">-- &#21512;&#24182;&#30456;&#37051;&#20998;&#21306;</span>
<span style="color: #0000FF;">alter</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">bea2</span> merge partitions p2, p3 <span style="color: #0000FF;">into</span> partition p8;

<span style="color: #8D8D84; font-style: italic;">-- &#25286;&#20998;&#20998;&#21306;</span>
<span style="color: #0000FF;">alter</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">bea2</span> split partition p2 <span style="color: #0000FF;">at</span> <span style="color: #707183;">(</span>3000<span style="color: #707183;">)</span> <span style="color: #0000FF;">into</span> <span style="color: #707183;">(</span>partition p3, partition p14<span style="color: #707183;">)</span>;     <span style="color: #8D8D84; font-style: italic;">-- &#33539;&#22260;&#20998;&#21306;&#30340;&#25286;&#20998;</span>
<span style="color: #0000FF;">alter</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">bea2</span> split partition p2 <span style="color: #0000FF;">values</span> <span style="color: #707183;">(</span>1,2<span style="color: #707183;">)</span> <span style="color: #0000FF;">into</span> <span style="color: #707183;">(</span>partition p3, partition p4<span style="color: #707183;">)</span>;   <span style="color: #8D8D84; font-style: italic;">-- &#21015;&#34920;&#20998;&#21306;&#30340;&#25286;&#20998;</span>
<span style="color: #0000FF;">alter</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">bea2</span> split partition p2 <span style="color: #0000FF;">into</span> <span style="color: #707183;">(</span>partition p3 <span style="color: #0000FF;">values</span> <span style="color: #7388D6;">(</span>1, 2<span style="color: #7388D6;">)</span>, partition p4 <span style="color: #0000FF;">values</span> <span style="color: #7388D6;">(</span>3<span style="color: #7388D6;">)</span>, partition p5<span style="color: #707183;">)</span>;   <span style="color: #8D8D84; font-style: italic;">-- &#21015;&#34920;&#20998;&#21306;&#30340;&#25286;&#20998;</span>

<span style="color: #8D8D84; font-style: italic;">-- &#37325;&#21629;&#21517;&#20998;&#21306;</span>
<span style="color: #0000FF;">alter</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">bea2</span> rename partition p2 <span style="color: #0000FF;">to</span> p12;
</pre>
</div>

<p>
如果分区字段的数据被 update，发生了跨分区的情况，会发生什么？
</p>
<pre class="example">
错误:更新分区关键字列将导致分区的更改
</pre>
<p>
可以通过以下语法，使行数据可以移动
</p>
<pre class="example">
alter table m8 enable row movement;
</pre>
<p>
通过这种方式，实现了行数据的迁移。但是数据的 rowid 也会随之发生变化。
</p>
</div>
</div>
</section>

<section id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">视图 (View)</h2>
<div class="outline-text-2" id="text-9">
<p>
四种类型
</p>
<ol class="org-ol">
<li>关系视图 (Relational View)
</li>
<li>内嵌式图 (Inline View)
</li>
<li>对象视图 (Object View)
</li>
<li>物化视图 (Materialize View)
</li>
</ol>
</div>

<div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1">关系视图</h3>
<div class="outline-text-3" id="text-9-1">
<p>
又称为虚表，不占物理空间，存储在数据字典中。它能简化命令，隐藏复杂度，解耦，增强安全性。
</p>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #8D8D84; font-style: italic;">-- &#21021;&#22987;&#21270;&#35201;&#20351;&#29992;&#30340;&#34920;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">emp</span> <span style="color: #0000FF;">as</span> <span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> emp;                        <span style="color: #8D8D84; font-style: italic;">-- &#22797;&#21046;&#34920;</span>
<span style="color: #0000FF;">alter</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">emp</span> <span style="color: #0000FF;">add</span> <span style="color: #0000FF;">constraints</span> pk_emp <span style="color: #0000FF;">primary</span> <span style="color: #0000FF;">key</span> <span style="color: #707183;">(</span>empno<span style="color: #707183;">)</span>;   <span style="color: #8D8D84; font-style: italic;">-- &#28155;&#21152;&#20027;&#38190;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">dept</span> <span style="color: #0000FF;">as</span> <span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> dept;

<span style="color: #8D8D84; font-style: italic;">-- &#21019;&#24314;&#35821;&#27861;</span>
<span style="color: #0000FF;">create</span> <span style="color: #707183;">[</span><span style="color: #0000FF;">or</span> replace<span style="color: #707183;">]</span> <span style="color: #707183;">[</span>force | noforce<span style="color: #707183;">]</span>
<span style="color: #0000FF;">view</span> view_name <span style="color: #0000FF;">as</span> <span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> <span style="color: #0000FF;">table_name</span>
<span style="color: #707183;">[</span><span style="color: #0000FF;">with</span> <span style="color: #0000FF;">read</span> <span style="color: #0000FF;">only</span><span style="color: #707183;">]</span>              <span style="color: #8D8D84; font-style: italic;">-- &#24378;&#36843;&#35270;&#22270;&#21482;&#33021;&#26597;&#30475;&#65292;&#19981;&#33021;&#20462;&#25913;</span>
<span style="color: #707183;">[</span><span style="color: #0000FF;">with</span> <span style="color: #0000FF;">check</span> <span style="color: #0000FF;">option</span><span style="color: #707183;">]</span>
;

<span style="color: #8D8D84; font-style: italic;">-- &#21019;&#24314;&#35270;&#22270;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">view</span> <span style="color: #006699;">v_emp</span> <span style="color: #0000FF;">as</span> <span style="color: #0000FF;">select</span> empno, ename, sal <span style="color: #0000FF;">from</span> emp <span style="color: #0000FF;">where</span> sal &gt; 1000;

<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">view</span> <span style="color: #006699;">v_emp01</span> <span style="color: #0000FF;">as</span>
<span style="color: #0000FF;">select</span> e.ename, e.sal, d.dname <span style="color: #0000FF;">from</span> emp e, dept d <span style="color: #0000FF;">where</span> e.deptno = d.deptno;


<span style="color: #8D8D84; font-style: italic;">-- &#21024;&#38500;&#35270;&#22270;</span>
<span style="color: #0000FF;">drop</span> <span style="color: #0000FF;">view</span> <span style="color: #006699;">v_emp01</span>;
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-9-2" class="outline-3">
<h3 id="sec-9-2">内嵌视图</h3>
<div class="outline-text-3" id="text-9-2">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #8D8D84; font-style: italic;">-- &#26597;&#35810;&#30340;&#22522;&#26412;&#35821;&#21477;&#65292;from &#21518;&#38754;&#36319;&#30340;&#26159;&#34920;&#25110;&#32773;&#35270;&#22270;</span>
<span style="color: #0000FF;">select</span> &#25152;&#26377;&#35201;&#26597;&#35810;&#30340;&#21015; <span style="color: #0000FF;">from</span> &#35201;&#26597;&#35810;&#30340;&#34920;/&#35270;&#22270; <span style="color: #0000FF;">where</span> clause;

<span style="color: #8D8D84; font-style: italic;">-- &#36825;&#26159;&#20043;&#21069;&#25105;&#20204;&#29992;&#36807;&#30340;&#19968;&#20010;&#26597;&#35810;&#65292;&#26597;&#35810;&#25152;&#26377; rownum &gt; 2 &#30340;&#25152;&#26377;&#25968;&#25454;</span>
<span style="color: #8D8D84; font-style: italic;">-- &#22312;&#36825;&#20010;&#26597;&#35810;&#20013;&#65292;&#25105;&#20204;&#22312; from &#20043;&#21518;&#29992;&#21040;&#20102;&#19968;&#20010;&#24102;&#25324;&#21495;&#30340;&#26597;&#35810;&#35821;&#21477;&#65292;&#36825;&#20010;&#26597;&#35810;&#35821;&#21477;&#23601;&#26159;&#20869;&#23884;&#35270;&#22270;&#12290;</span>
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> 
  <span style="color: #707183;">(</span><span style="color: #0000FF;">select</span> rownum rn, empno, ename, sal <span style="color: #0000FF;">from</span> scott.emp<span style="color: #707183;">)</span> 
  <span style="color: #0000FF;">where</span> rn &gt; 2;

<span style="color: #8D8D84; font-style: italic;">-- &#20869;&#23884;&#35270;&#22270;&#65292;&#20174;&#36923;&#36753;&#19978;&#21487;&#20197;&#20998;&#35299;&#20026;:</span>
<span style="color: #8D8D84; font-style: italic;">-- &#31532;&#19968;&#27493;&#65306;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">view</span> <span style="color: #006699;">linshigong001</span> <span style="color: #0000FF;">as</span> <span style="color: #0000FF;">select</span> rownum rn, empno, ename, sal <span style="color: #0000FF;">from</span> scott.emp;
<span style="color: #8D8D84; font-style: italic;">-- &#31532;&#20108;&#27493;&#65306;</span>
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> linshigong001 <span style="color: #0000FF;">where</span> rn &gt; 2;
<span style="color: #8D8D84; font-style: italic;">-- &#31532;&#19977;&#27493;&#65306;</span>
<span style="color: #0000FF;">drop</span> <span style="color: #0000FF;">view</span> <span style="color: #006699;">linshigong001</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-9-3" class="outline-3">
<h3 id="sec-9-3">对象视图（可选）</h3>
<div class="outline-text-3" id="text-9-3">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #8D8D84; font-style: italic;">-- &#21019;&#24314;&#23545;&#35937;</span>
<span style="color: #0000FF;">CREATE</span> <span style="color: #0000FF;">OR</span> REPLACE <span style="color: #0000FF;">TYPE</span> <span style="color: #006699;">depttype</span> 
<span style="color: #0000FF;">AS</span> <span style="color: #6434A3;">OBJECT</span> 
<span style="color: #707183;">(</span>
deptid <span style="color: #0000FF;">number</span>,
deptname varchar2<span style="color: #7388D6;">(</span>30<span style="color: #7388D6;">)</span>,
loc <span style="color: #0000FF;">number</span>
<span style="color: #707183;">)</span>;

<span style="color: #0000FF;">CREATE</span> <span style="color: #0000FF;">OR</span> REPLACE <span style="color: #0000FF;">VIEW</span> <span style="color: #006699;">v_dept</span> <span style="color: #0000FF;">OF</span> depttype
  <span style="color: #0000FF;">WITH</span> <span style="color: #6434A3;">OBJECT</span> OID <span style="color: #707183;">(</span>deptid<span style="color: #707183;">)</span> 
<span style="color: #0000FF;">AS</span> 
  <span style="color: #0000FF;">SELECT</span> deptid, deptname, loc <span style="color: #0000FF;">FROM</span> emp;

<span style="color: #0000FF;">SELECT</span> * <span style="color: #0000FF;">FROM</span> v_dept;
<span style="color: #0000FF;">select</span> <span style="color: #6434A3;">ref</span><span style="color: #707183;">(</span>t<span style="color: #707183;">)</span> <span style="color: #0000FF;">from</span> v_dept t;  <span style="color: #8D8D84; font-style: italic;">-- oid</span>
</pre>
</div>
</div>
</div>
