oracle.org
** 物化视图

它是 Oracle 中保存了查询结果的对象。它把查询的数据保存为实实在在的数据，再次访问的时候，就不需要从基表中去查询，而直接从保存的数据里拿取。所以能大大提高效率，增强性能。我们可以用能自动同步数据的临时表的概念来理解它。所以，它不是虚表，它占用存储空间。

它主要用来提高效率，所以用在查询消耗比较大的连接上。也可以用来把远程的数据缓存到本地，通过这种方式保障性能。

这是一种以空间换时间的方法。

创建物化视图要考虑一下几个方面：
1. 什么时候生成数据。
   : build immediate/deferred                               -- 在创建无话视图的时候立刻创建，或者推迟到需要的时候手动创建
2. 如果基表里的数据发生变化，以一种什么样的策略保持同步
   : refresh complete/fast/force/never                      -- 四中方式依次对应： 全量刷新，即删除后重新生成 / 增量刷新 / oracle 自动判断，如果能增量则增量否则全量 / 不同步数据
3. 如果基表里的数据发生变化，刷新的时机
   : on commit/demand start with sysdate next sysdate + 1   -- 分别为： 基表有更新的话立刻同步 / 按照时间段，按需同步，按需同步要与 start with next 一起使用
4. 告诉 Oracle，如果从基本中查询数据的时候，允不允许参考使用物化视图里的结果。（如果使用物化视图的话，实质上 oracle 要修改你查询的语句，所以才叫查询重写）
   : enable/disable query rewrite

#+BEGIN_SRC sql
-- 最基本的创建。这里用的是全量更新。全量更新会很笨重。
create materialized view mv_emp
  build immediate
  refresh complete
  on demand start with sysdate next sysdate + 1
  enable query rewrite
  as
  select * from emp;




-- 但如果要用 refresh fast 方式，即增量更新方式，那么，需要在原来的表上创建物化视图日志表，以便让 oracle 知道需要同步些什么东西。
-- 创建语句为如下，后面需要 with 语句指定按照 rowid 还是主键作为每一行数据的身份证号码。
create materialized view log on emp with primary key;
-- 之后创建增量刷新的物化视图
create materialized view mv_emp_fast
  build immediate
  refresh fast
  on demand start with sysdate next sysdate + 1
  with primary key   -- 这里要跟物化视图日志指定的相对应。
  enable query rewrite
  as
  select * from emp;



-- 删除
drop materialized view log on emp;
drop materialized view mv_emp;

#+END_SRC


* 作业相关
#+BEGIN_SRC sql
-- 简单的过程语句。用来在 t1 表中插入 100000 条数据。
create table t1 (id number, name varchar2(20));

begin
  for i in 1..100000 loop
    insert into t1 values (i, 'zhouqiang');
    commit;
  end loop;

end;
/
#+END_SRC


列出当月所有的星期五.
1. 需要列出当月所有的日期。

   需要用到的知识点：
   1) 本月第一天： trunc
   2) 本月最后一天： last_day
   3) 计算本月的天数： 天数 = 月末 - 月初 + 1
   3) 如何获取连续的时间
      (1) connect by
          : select level from dual connect by level <= 本月的天数;
      (2) rownum
          : select rownum from dba_objects where rownum <= 本月的天数;


2. 在当月所有的日期中查询所有是星期五的日期
   1) 获取星期几： decode


select xxx from (select level from dual connect by level <= 本月的天数);
