oracle.html



<div id="outline-container-sec-9-4" class="outline-3">
<h3 id="sec-9-4">物化视图</h3>
<div class="outline-text-3" id="text-9-4">
<p>
它是 Oracle 中保存了查询结果的对象。它把查询的数据保存为实实在在的数据，再次访问的时候，就不需要从基表中去查询，而直接从保存的数据里拿取。所以能大大提高效率，增强性能。我们可以用能自动同步数据的临时表的概念来理解它。所以，它不是虚表，它占用存储空间。
</p>

<p>
它主要用来提高效率，所以用在查询消耗比较大的连接上。也可以用来把远程的数据缓存到本地，通过这种方式保障性能。
</p>

<p>
这是一种以空间换时间的方法。
</p>

<p>
创建物化视图要考虑一下几个方面：
</p>
<ol class="org-ol">
<li>什么时候生成数据。
<pre class="example">
build immediate/deferred                               -- 在创建无话视图的时候立刻创建，或者推迟到需要的时候手动创建
</pre>
</li>
<li>如果基表里的数据发生变化，以一种什么样的策略保持同步
<pre class="example">
refresh complete/fast/force/never                      -- 四中方式依次对应： 全量刷新，即删除后重新生成 / 增量刷新 / oracle 自动判断，如果能增量则增量否则全量 / 不同步数据
</pre>
</li>
<li>如果基表里的数据发生变化，刷新的时机
<pre class="example">
on commit/demand start with sysdate next sysdate + 1   -- 分别为： 基表有更新的话立刻同步 / 按照时间段，按需同步，按需同步要与 start with next 一起使用
</pre>
</li>
<li>告诉 Oracle，如果从基本中查询数据的时候，允不允许参考使用物化视图里的结果。（如果使用物化视图的话，实质上 oracle 要修改你查询的语句，所以才叫查询重写）
<pre class="example">
enable/disable query rewrite
</pre>
</li>
</ol>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #8D8D84; font-style: italic;">-- &#26368;&#22522;&#26412;&#30340;&#21019;&#24314;&#12290;&#36825;&#37324;&#29992;&#30340;&#26159;&#20840;&#37327;&#26356;&#26032;&#12290;&#20840;&#37327;&#26356;&#26032;&#20250;&#24456;&#31528;&#37325;&#12290;</span>
<span style="color: #0000FF;">create</span> materialized <span style="color: #0000FF;">view</span> <span style="color: #006699;">mv_emp</span>
  build <span style="color: #0000FF;">immediate</span>
  refresh complete
  <span style="color: #0000FF;">on</span> demand <span style="color: #0000FF;">start</span> <span style="color: #0000FF;">with</span> sysdate <span style="color: #0000FF;">next</span> sysdate + 1
  enable query rewrite
  <span style="color: #0000FF;">as</span>
  <span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> emp;




<span style="color: #8D8D84; font-style: italic;">-- &#20294;&#22914;&#26524;&#35201;&#29992; refresh fast &#26041;&#24335;&#65292;&#21363;&#22686;&#37327;&#26356;&#26032;&#26041;&#24335;&#65292;&#37027;&#20040;&#65292;&#38656;&#35201;&#22312;&#21407;&#26469;&#30340;&#34920;&#19978;&#21019;&#24314;&#29289;&#21270;&#35270;&#22270;&#26085;&#24535;&#34920;&#65292;&#20197;&#20415;&#35753; oracle &#30693;&#36947;&#38656;&#35201;&#21516;&#27493;&#20123;&#20160;&#20040;&#19996;&#35199;&#12290;</span>
<span style="color: #8D8D84; font-style: italic;">-- &#21019;&#24314;&#35821;&#21477;&#20026;&#22914;&#19979;&#65292;&#21518;&#38754;&#38656;&#35201; with &#35821;&#21477;&#25351;&#23450;&#25353;&#29031; rowid &#36824;&#26159;&#20027;&#38190;&#20316;&#20026;&#27599;&#19968;&#34892;&#25968;&#25454;&#30340;&#36523;&#20221;&#35777;&#21495;&#30721;&#12290;</span>
<span style="color: #0000FF;">create</span> materialized <span style="color: #0000FF;">view</span> <span style="color: #006699;">log</span> <span style="color: #0000FF;">on</span> emp <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">primary</span> <span style="color: #0000FF;">key</span>;
<span style="color: #8D8D84; font-style: italic;">-- &#20043;&#21518;&#21019;&#24314;&#22686;&#37327;&#21047;&#26032;&#30340;&#29289;&#21270;&#35270;&#22270;</span>
<span style="color: #0000FF;">create</span> materialized <span style="color: #0000FF;">view</span> <span style="color: #006699;">mv_emp_fast</span>
  build <span style="color: #0000FF;">immediate</span>
  refresh fast
  <span style="color: #0000FF;">on</span> demand <span style="color: #0000FF;">start</span> <span style="color: #0000FF;">with</span> sysdate <span style="color: #0000FF;">next</span> sysdate + 1
  <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">primary</span> <span style="color: #0000FF;">key</span>   <span style="color: #8D8D84; font-style: italic;">-- &#36825;&#37324;&#35201;&#36319;&#29289;&#21270;&#35270;&#22270;&#26085;&#24535;&#25351;&#23450;&#30340;&#30456;&#23545;&#24212;&#12290;</span>
  enable query rewrite
  <span style="color: #0000FF;">as</span>
  <span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> emp;



<span style="color: #8D8D84; font-style: italic;">-- &#21024;&#38500;</span>
<span style="color: #0000FF;">drop</span> materialized <span style="color: #0000FF;">view</span> <span style="color: #006699;">log</span> <span style="color: #0000FF;">on</span> emp;
<span style="color: #0000FF;">drop</span> materialized <span style="color: #0000FF;">view</span> <span style="color: #006699;">mv_emp</span>;
</pre>
</div>
</div>
</div>
</section>


<section id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">作业相关</h2>
<div class="outline-text-2" id="text-10">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #8D8D84; font-style: italic;">-- &#31616;&#21333;&#30340;&#36807;&#31243;&#35821;&#21477;&#12290;&#29992;&#26469;&#22312; t1 &#34920;&#20013;&#25554;&#20837; 100000 &#26465;&#25968;&#25454;&#12290;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">t1</span> <span style="color: #707183;">(</span>id <span style="color: #0000FF;">number</span>, <span style="color: #0000FF;">name</span> varchar2<span style="color: #7388D6;">(</span>20<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>;

<span style="color: #0000FF;">begin</span>
  <span style="color: #0000FF;">for</span> i <span style="color: #0000FF;">in</span> 1..100000 loop
    <span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">into</span> t1 <span style="color: #0000FF;">values</span> <span style="color: #707183;">(</span>i, <span style="color: #008000;">'zhouqiang'</span><span style="color: #707183;">)</span>;
    <span style="color: #0000FF;">commit</span>;
  <span style="color: #0000FF;">end</span> loop;

<span style="color: #0000FF;">end</span>;
/
</pre>
</div>


<p>
列出当月所有的星期五.
</p>
<ol class="org-ol">
<li>需要列出当月所有的日期。

<p>
需要用到的知识点：
</p>
<ol class="org-ol">
<li>本月第一天： trunc
</li>
<li>本月最后一天： last_day
</li>
<li>计算本月的天数： 天数 = 月末 - 月初 + 1
</li>
<li>如何获取连续的时间
(1) connect by
<pre class="example">
select level from dual connect by level &lt;= 本月的天数;
</pre>
<p>
(2) rownum
</p>
<pre class="example">
select rownum from dba_objects where rownum &lt;= 本月的天数;
</pre>
</li>
</ol>
</li>
</ol>


<ol class="org-ol">
<li>在当月所有的日期中查询所有是星期五的日期
<ol class="org-ol">
<li>获取星期几： decode
</li>
</ol>
</li>
</ol>


<p>
select xxx from (select level from dual connect by level &lt;= 本月的天数);
</p>
</div>
</section>
