oracle.org
* 索引

创建语句
: CREATE INDEX 索引名字 ON 表名 (表的字段名) [TABLESPACE 表空间名字];
重建索引
: alter index ind_s rebuild;
删除语句
: drop index ind_s;

索引的类型

1. 唯一索引
   : create unique index ind_s on s (name);
2. 组合索引
   : create index ind_s on s (name, addr);
3. 反向索引
   : create index ind_s_reverse on s (name) reverse;
4. 函数索引
   #+BEGIN_SRC sql
   -- 创建一个表
   create table ss (name varchar2(20), value number);
   
   -- 插入几条数据
   insert into ss values ('abc', 100);
   insert into ss values ('hello', 99);
   insert into ss values ('ok', 22);
   insert into ss values ('miss', 111);
   insert into ss values ('admin', 190);
   commit;

   -- 在 name 字段上创建普通的索引
   create index ind_ss_normal on ss (name);

   -- 打开 autotrace，查看执行计划。
   -- 结果， table_access_full，即全表扫描，也就是说，没有走索引
   set autotrace on;
   select * from ss where substr(name, 1, 1) = 'h';

   -- 创建关于 name 的函数索引
   create index ind_ss_substr on ss (substr(name, 1, 1));

   -- 再次查看执行计划
   select * from ss where substr(name, 1, 1) = 'h';
   -- 显示结果如下，即走了索引，走的是我们创建的函数索引。
   -- | TABLE ACCESS BY INDEX ROWID | SS              |
   -- | INDEX RANGE SCAN            | INDEX_SS_SUBSTR |
   
   #+END_SRC

5. 位图索引






注意，要合理使用索引。因为，不合理的索引，不仅不能带来效率的提升，反而会拖累系统。
索引的更新同步，是比较消耗资源的。




不要只凭主观去看 SQL 语句到底有没有走索引，要学会看Oracle的 Explain Plan（解释计划)。
主要有两种方式:
1. 在 sqlplus 之下，打开 autotrace 选项:
   : set autotrace on
   这样，每条语句执行之后就会打印出相关的执行计划情况。
   其中， Table_Access_Full 表示全表扫描， xxx_by_index_rowid 表示扫描索引。

2. 手动生成解释计划，在 sqlplus 下的语法为:
   #+BEGIN_SRC sql
   explain plan for select CLAUSE;   -- 通过 explain plan for 生成计划
   select * from plan_table;         -- plan_table 保存的是上述解释计划的结果
   select * from table(dbms_xplan.display);  -- 是对上面表里面数据的更直观显示
   #+END_SRC


批量生成数据的方式
#+BEGIN_SRC sql
-- 第一种，生成随机数，随机字符串
create sequence shello;

create table demo as
 select 
     shello.nextval id,
     'SIT_' || dbms_random.string('l', 5) abc,
     round(dbms_random.value(0, 100)) score
   from dual connect by level <= 100000;

-- 第二种，用已有的数据，例：
begin
  for i in 1..100 loop
     -- 复制多份数据
     insert into demo select xxx,yyy from dba_objects;
  end loop;
end;
select row_number over (order by )






#+END_SRC

