oracle.html
<section id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">索引</h2>
<div class="outline-text-2" id="text-11">
<p>
创建语句
</p>
<pre class="example">
CREATE INDEX 索引名字 ON 表名 (表的字段名) [TABLESPACE 表空间名字];
</pre>
<p>
重建索引
</p>
<pre class="example">
alter index ind_s rebuild;
</pre>
<p>
删除语句
</p>
<pre class="example">
drop index ind_s;
</pre>

<p>
索引的类型
</p>

<ol class="org-ol">
<li>唯一索引
<pre class="example">
create unique index ind_s on s (name);
</pre>
</li>
<li>组合索引
<pre class="example">
create index ind_s on s (name, addr);
</pre>
</li>
<li>反向索引
<pre class="example">
create index ind_s_reverse on s (name) reverse;
</pre>
</li>
<li>函数索引
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #8D8D84; font-style: italic;">-- &#21019;&#24314;&#19968;&#20010;&#34920;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">ss</span> <span style="color: #707183;">(</span><span style="color: #0000FF;">name</span> varchar2<span style="color: #7388D6;">(</span>20<span style="color: #7388D6;">)</span>, <span style="color: #0000FF;">value</span> <span style="color: #0000FF;">number</span><span style="color: #707183;">)</span>;

<span style="color: #8D8D84; font-style: italic;">-- &#25554;&#20837;&#20960;&#26465;&#25968;&#25454;</span>
<span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">into</span> ss <span style="color: #0000FF;">values</span> <span style="color: #707183;">(</span><span style="color: #008000;">'abc'</span>, 100<span style="color: #707183;">)</span>;
<span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">into</span> ss <span style="color: #0000FF;">values</span> <span style="color: #707183;">(</span><span style="color: #008000;">'hello'</span>, 99<span style="color: #707183;">)</span>;
<span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">into</span> ss <span style="color: #0000FF;">values</span> <span style="color: #707183;">(</span><span style="color: #008000;">'ok'</span>, 22<span style="color: #707183;">)</span>;
<span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">into</span> ss <span style="color: #0000FF;">values</span> <span style="color: #707183;">(</span><span style="color: #008000;">'miss'</span>, 111<span style="color: #707183;">)</span>;
<span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">into</span> ss <span style="color: #0000FF;">values</span> <span style="color: #707183;">(</span><span style="color: #008000;">'admin'</span>, 190<span style="color: #707183;">)</span>;
<span style="color: #0000FF;">commit</span>;

<span style="color: #8D8D84; font-style: italic;">-- &#22312; name &#23383;&#27573;&#19978;&#21019;&#24314;&#26222;&#36890;&#30340;&#32034;&#24341;</span>
<span style="color: #0000FF;">create</span> index ind_ss_normal <span style="color: #0000FF;">on</span> ss <span style="color: #707183;">(</span><span style="color: #0000FF;">name</span><span style="color: #707183;">)</span>;

<span style="color: #8D8D84; font-style: italic;">-- &#25171;&#24320; autotrace&#65292;&#26597;&#30475;&#25191;&#34892;&#35745;&#21010;&#12290;</span>
<span style="color: #8D8D84; font-style: italic;">-- &#32467;&#26524;&#65292; table_access_full&#65292;&#21363;&#20840;&#34920;&#25195;&#25551;&#65292;&#20063;&#23601;&#26159;&#35828;&#65292;&#27809;&#26377;&#36208;&#32034;&#24341;</span>
<span style="color: #0000FF;">set</span> autotrace <span style="color: #0000FF;">on</span>;
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> ss <span style="color: #0000FF;">where</span> substr<span style="color: #707183;">(</span><span style="color: #0000FF;">name</span>, 1, 1<span style="color: #707183;">)</span> = <span style="color: #008000;">'h'</span>;

<span style="color: #8D8D84; font-style: italic;">-- &#21019;&#24314;&#20851;&#20110; name &#30340;&#20989;&#25968;&#32034;&#24341;</span>
<span style="color: #0000FF;">create</span> index ind_ss_substr <span style="color: #0000FF;">on</span> ss <span style="color: #707183;">(</span>substr<span style="color: #7388D6;">(</span><span style="color: #0000FF;">name</span>, 1, 1<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>;

<span style="color: #8D8D84; font-style: italic;">-- &#20877;&#27425;&#26597;&#30475;&#25191;&#34892;&#35745;&#21010;</span>
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> ss <span style="color: #0000FF;">where</span> substr<span style="color: #707183;">(</span><span style="color: #0000FF;">name</span>, 1, 1<span style="color: #707183;">)</span> = <span style="color: #008000;">'h'</span>;
<span style="color: #8D8D84; font-style: italic;">-- &#26174;&#31034;&#32467;&#26524;&#22914;&#19979;&#65292;&#21363;&#36208;&#20102;&#32034;&#24341;&#65292;&#36208;&#30340;&#26159;&#25105;&#20204;&#21019;&#24314;&#30340;&#20989;&#25968;&#32034;&#24341;&#12290;</span>
<span style="color: #8D8D84; font-style: italic;">-- | TABLE ACCESS BY INDEX ROWID | SS              |</span>
<span style="color: #8D8D84; font-style: italic;">-- | INDEX RANGE SCAN            | INDEX_SS_SUBSTR |</span>
</pre>
</div>
</li>

<li>位图索引
</li>
</ol>






<p>
注意，要合理使用索引。因为，不合理的索引，不仅不能带来效率的提升，反而会拖累系统。
索引的更新同步，是比较消耗资源的。
</p>




<p>
不要只凭主观去看 SQL 语句到底有没有走索引，要学会看Oracle的 Explain Plan（解释计划)。
主要有两种方式:
</p>
<ol class="org-ol">
<li>在 sqlplus 之下，打开 autotrace 选项:
<pre class="example">
set autotrace on
</pre>
<p>
这样，每条语句执行之后就会打印出相关的执行计划情况。
其中， Table_Access_Full 表示全表扫描， xxx_by_index_rowid 表示扫描索引。
</p>
</li>

<li>手动生成解释计划，在 sqlplus 下的语法为:
<div class="org-src-container">

<pre class="src src-sql">explain plan <span style="color: #0000FF;">for</span> <span style="color: #0000FF;">select</span> CLAUSE;   <span style="color: #8D8D84; font-style: italic;">-- &#36890;&#36807; explain plan for &#29983;&#25104;&#35745;&#21010;</span>
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> plan_table;         <span style="color: #8D8D84; font-style: italic;">-- plan_table &#20445;&#23384;&#30340;&#26159;&#19978;&#36848;&#35299;&#37322;&#35745;&#21010;&#30340;&#32467;&#26524;</span>
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> <span style="color: #0000FF;">table</span><span style="color: #707183;">(</span>dbms_xplan.display<span style="color: #707183;">)</span>;  <span style="color: #8D8D84; font-style: italic;">-- &#26159;&#23545;&#19978;&#38754;&#34920;&#37324;&#38754;&#25968;&#25454;&#30340;&#26356;&#30452;&#35266;&#26174;&#31034;</span>
</pre>
</div>
</li>
</ol>


<p>
批量生成数据的方式
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #8D8D84; font-style: italic;">-- &#31532;&#19968;&#31181;&#65292;&#29983;&#25104;&#38543;&#26426;&#25968;&#65292;&#38543;&#26426;&#23383;&#31526;&#20018;</span>
<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">sequence</span> <span style="color: #006699;">shello</span>;

<span style="color: #0000FF;">create</span> <span style="color: #0000FF;">table</span> <span style="color: #006699;">demo</span> <span style="color: #0000FF;">as</span>
 <span style="color: #0000FF;">select</span> 
     shello.nextval id,
     <span style="color: #008000;">'SIT_'</span> || dbms_random.string<span style="color: #707183;">(</span><span style="color: #008000;">'l'</span>, 5<span style="color: #707183;">)</span> abc,
     round<span style="color: #707183;">(</span>dbms_random.<span style="color: #0000FF;">value</span><span style="color: #7388D6;">(</span>0, 100<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span> score
   <span style="color: #0000FF;">from</span> dual <span style="color: #0000FF;">connect</span> <span style="color: #0000FF;">by</span> <span style="color: #0000FF;">level</span> &lt;= 100000;

<span style="color: #8D8D84; font-style: italic;">-- &#31532;&#20108;&#31181;&#65292;&#29992;&#24050;&#26377;&#30340;&#25968;&#25454;&#65292;&#20363;&#65306;</span>
<span style="color: #0000FF;">begin</span>
  <span style="color: #0000FF;">for</span> i <span style="color: #0000FF;">in</span> 1..100 loop
     <span style="color: #8D8D84; font-style: italic;">-- &#22797;&#21046;&#22810;&#20221;&#25968;&#25454;</span>
     <span style="color: #0000FF;">insert</span> <span style="color: #0000FF;">into</span> demo <span style="color: #0000FF;">select</span> xxx,yyy <span style="color: #0000FF;">from</span> dba_objects;
  <span style="color: #0000FF;">end</span> loop;
<span style="color: #0000FF;">end</span>;
<span style="color: #0000FF;">select</span> row_number over <span style="color: #707183;">(</span><span style="color: #0000FF;">order</span> <span style="color: #0000FF;">by</span> <span style="color: #707183;">)</span>
</pre>
</div>
</div>
</section>
